{"entry":{"id":"gamedesign.mdx","slug":"gamedesign","body":"\n## Game Design Document\n\n### Executive Summary\n\n- **Game Concept:** A brief description of the game, including the genre, setting, and gameplay.\n- **Target Audience:** Big Tiddie Goth Gfs?\n- **Project Scope:** MVP is 1 Fun Level with Low-To-No-Bugs, released to the Steam. The Product is playable with Mouse and Keyboard and has no placeholder assets, and runs on all Test Machines. The Full Scope is a Playable Product with 2 Levels. \n\n### Logistics\n\n- **Release Platform:** RogueJester will be releaesed to the Steam Store\n- **Development Space:** RogueJester is being developed on Unity. 2021.3.11f1\n- **Build Update Rules:** Unity Dev Ops Builds is To Be Determined pending Billing investigation\n\n### Gameplay\n\n- **Objectives:** The goals of the game, and how players can achieve them.\n- **Progression:** How the game progresses, and how players can unlock new content.\n- **Gameplay Mechanics:** The rules and mechanics of the game, such as how characters move, interact with the environment, and fight enemies.\n- **User Interface:** The user interface of the game, including the menus, buttons, and other elements that players will interact with.\n\n### Mechanics\n\n- **Combat:** The rules and mechanics of combat, such as how players attack enemies, defend themselves, and use special abilities.\n- **Physics:** The physics of the game world, such as how objects move and interact with each other.\n- **Other Mechanics:** Any other mechanics that are important to the game, such as crafting, inventory management, or character customization.\n\n### Game Elements\n\n- **Worldbuilding:** The setting and lore of the game world.\n- **Story:** The plot of the game, including the characters, events, and challenges that players will face.\n- **Characters:** The characters that players can control or interact with.\n- **Locations:** The different locations that players can visit in the game world.\n- **Level Design:** The design of the levels in the game, including the enemies, obstacles, and puzzles that players will encounter.\n\n### Assets\n\n- **Art:** The art assets for the game, such as character models, environment assets, and textures.\n- **Music:** The music and sound effects for the game.\n- **Programming:** The code that powers the game, including the gameplay mechanics, user interface, and level design.\n\n### Conclusion\n\nThis game design document provides a high-level overview of the game. For more detailed information, please refer to the attached documents.\n\nThis is just a template, so you can feel free to modify it to fit your specific game. You may also want to add additional sections, such as a marketing plan or a financial plan.","collection":"theory","data":{"title":"Theory of GameDesign","description":"We found the area of game design to be extremely interesting and would consider life has a form of gamification. Capitalism is a hardcore survival game, where your hard earn bucks get taken away by greed.","tags":["gaming","design","theory"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1633545505446-586bf83717f0?fit=crop&w=1400&h=700&q=75"}}}