{"entry":{"id":"healthcare.mdx","slug":"healthcare","body":"\n## Introduction\n\nThe Health Care Debate written by will be a slow series of battles rather than just one major war. I believe the best stance would be for both parties to come together and focus on a few key issues: \n\n- A. The removal of evergreening pharma / trollish patents [2].\n- B. Reverse the bans on the importation of drugs.\n- C. Grants and Tax Incentives.\n\n(a) student & machine learning/researching within particular healthcare niches (EPS for STEM investment is amazing for the society), (b) progressive* generic manufacturing, (c) open sourcing all research/action data (help offset the billions lost for failed drugs), [4] allow all entities (NGO, Medicare ~ not just VA) to barter drug prices, thus upper-limit price regulation, [5] heavy levy-tax on harmful entities/corps/substances, [6] fiduciary-like regulations && career-limitation/bans (No revolving door) for doctors/hospitals staff/health + persons that operate in government agencies like FDA / EPA, etc... This view is based on a 6 fucking hour flight without wifi; fueled by meme withdrawals, lack of sleep, desires for CISPHER the ghost to save the world, and investments in designer babies made in artificial wombs.\n\n[1] Evergreening Pharma Patents - this is a classical move played by pharma companies to continue to make profits off of loopholes within the broken patent system. While every company/entity has the right to defend its expensive patent, it is unethical and greedy for them to use Dinsey-like legislation to monopolize social health and social networking programs. A case in point would be Epipens, granted there is a generic on the market but it was an issue, including its internal situation, definitely a good read. This is a massive issue in other nations, including India. From this point, you could also stem into how flawed the patent system is  /  patent trolling. I also believe the patent fight over CRISPR is a prime example of how burning money verse for a greater cause. \n\n[2] Allowing drugs to be imported from EU/Canada (besides just OTC) would dynamically create, destroy and restructure how drugs are obtained; imagine a doctor writing you a prescription which then automatically enters an amazon-esque online marketplace, where you can opt to get it delivered to your house. This already exists for the most part, but it is very unethical and illegal, I have talked to people that get all their expensive drugs [diabetic, hepi-1, adhd] drugs via the mail from Canadian/EU/Foreign pharmacies. It's cheaper to fly to India, stockpile drugs, enjoy a good vacation, get surgery, and fly back verse doing it all here.\n\n[2b] If a company wants to produce a generic to compete against a monopoly, especially if the trust is on an expired-patented drug, then there should be massive tax incentives/tax breaks to encourage the de-monopolization of that said drug. This does go hand-in-hand with the patent issue and the importation issue. Some drugs have a monopoly within the US because it's illegal to have that said drug be imported. \n\n[3a] Open-sourcing the research/data should allow companies to escape heavy tax burdens if they are attempting to produce a drug but it fail to enter the market. It would help other entities continue the research while preventing others from making the same mistake. If a company spends billions in R&D, test cases, etc… then the government should ensure that the company does not go bankrupt from taxation, especially when the current market for R&D is fueled by investors, which we do not want to lose/push away. \n\n[3b] If a student graduates high school with a high enough GPA, then they should have free access to community college, followed by access to free public university if they are doing R&D for health/engineering / algorithmic / STEMish. ; higher learning schools are already expensive, which is discouraging and harmful at the end of the day. I rather see more youth thrown into the education cycle rather than the criminal.\n\n[4] I am sorry but damn Cali, you guys had a chance to lower the fuck out of our medicare costs (they are super high for the state)… but you guys didn't want to vote that equal right for drug bartering? :C, now I will go back and invest in those pharma stocks dat $abbv.\n\n[5] If it's going to cause cancer, heart complications, and obesity, then there better be a tax on that shit! With all that tax money going back strictly toward medical / health ideals. Tax on Soda, Tax on Fast Food, etc. Furthermore, there should be heavy fines/taxes on entities that release harmful chemicals into the environment, like coal plants && pollution fines up the ass. We should not have Exxon get away from dumping hazardous materials and then allowing shareholders to profit off of it.\n\n[6] Pharma reps should, at most, be allowed to give free samples for their drugs, but other than that, they should NOT be allowed to use any other monetary actions to gain/alter/manipulate/influence. No more free lunches! FDA needs a massive cleanse, it is filled with corruption and backdoor policies. ","collection":"theory","data":{"title":"Healthcare","description":"Debate letter that combines several text transformers into a unique article.","tags":["healthcare","social","data"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1614680376739-414d95ff43df?fit=crop&w=1400&h=700&q=75"}}}