{"entry":{"id":"phytochemicals.mdx","slug":"phytochemicals","body":"\n## Information\n\nPhytochemicals are a broad and complex group of chemical compounds produced by plants.\n\n### Polyphenols\n\nPolyphenols are a group of natural compounds that have a common feature: they have several hydroxyl groups attached to aromatic rings, which are carbon atoms arranged in a hexagonal shape. \nPolyphenols can be classified into four main types, depending on their structure and origin, and these types are phenolic acids, flavonoids, stilbenes, and lignans. \nRemember that polyphenols are not a well-defined group of compounds, but they share some chemical and biological properties that make them interesting for health and nutrition.\n\n#### Phenolic Acids\nPhenolic acids are derived from benzoic or cinnamic acid and are found in fruits, vegetables, cereals, and spices. \n\n#### Flavonoids\nFlavonoids are the most abundant and diverse polyphenols and are found in almost all plants. \n\n#### Stilbenes\n\nThey have a basic structure of two aromatic rings connected by a three-carbon chain. \nStilbenes are rare polyphenols that have a structure of two aromatic rings linked by a double bond. \nThey are found in grapes, peanuts, and berries. \n\n#### Lignans\n\nLignans are polyphenols that have a structure of two phenylpropane units connected by a carbon-carbon bond. \nThey are found in seeds, grains, and legumes. \n\n\n---\n\n## Notes\n\nThis documentation is looking to expand upon the nature of `Phytochemicals` and provide additional information for referencing.\n\n### Logs\n\n#### Journal\n\n- 2023-05-07 : Research Papers on Phytochemicals and Eggs\n  - [2021 - Enriching laying hens eggs by feeding diets with different fatty acid composition and antioxidants](https://www.nature.com/articles/s41598-021-00343-1#Abs1)\n  - [2022 - Impacts of polyphenols on laying hens' productivity and egg quality: A review](https://onlinelibrary.wiley.com/doi/full/10.1111/jpn.13758)","collection":"theory","data":{"title":"Phytochemicals","description":"Polyphenols are a group of natural compounds found in plants that have unique properties within health and industry.","tags":["food","health"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1511688878353-3a2f5be94cd7?fit=crop&w=1400&h=700&q=75"}}}