{"entry":{"id":"socialmedia.mdx","slug":"socialmedia","body":"\n## Information\n\nCurrently this document is a collection of anecdotal conversations and data points that will then be consolidated into a theory.\nIt would be far more interesting to have this theory evolve as machine learning is slowly echoing into the mental boundaries of society.\nSpawn an army of social media bots and push false or misinformation?\nCreation of politically-infused deepfake content that pushes the civil limits of the modern era.\n\n---\n\n## Notes\n\n### Log\n\n#### Journal\n\n- 2023-05-07 \n    - Conversation between h0lybyte and Stamp\n\n    *h0lybyte:* \n    \n    I am currently rewriting a theory on social media. \n    I believe that the way the current algorithmic flow of information that major social media platforms offer tend to be scaled more towards favoring advertisers and/or are not accessible to personal modification(s) / weights without going to extreme lengths.\n    \n    Extreme length example that I have done would be: \n    \n    [1] - Create a Virtual machine.\n    \n    [2] - Register a new email / gmail.\n    \n    [3] - Browse YouTube but strictly only content that you find useful. Videos on motivation, health, fitness, investment, programming, philosophy. \n    \n    [4] - Let the YT Algorithm then continue to feed more videos within those topics / areas.\n    \n    It has helped a ton, again this is just a personal experiment / anecdotal but the concept is there, at the core level.\n    \n    *Stamp:* I agree with that. \n    \n    The algorithm also keeps users glued to the social media platforms for hours per day watching endless contents that sometimes are really wasteful.\n    It also creates a sense of pressure and competition to gain the most likes or more followers.\n    That creates distorted realities and fakeness as people want to gain as many followers as possible.\n\n    ","collection":"theory","data":{"title":"Social Media Toxicity","description":"Theory on the toxicity of social media and steps on improving its depths within our mental state.","tags":["social","media","mental","health"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1562577309-4932fdd64cd1?fit=crop&w=1400&h=700&q=75"}}}