{"entry":{"id":"swartz-guerilla-manifesto.mdx","slug":"swartz-guerilla-manifesto","body":"\n## Guerilla Open Access Manifesto\n\nInformation is power.\nBut like all power, there are those who want to keep it for themselves.\nThe world’s entire scientific and cultural heritage, published over centuries in books and journals, is increasingly being digitized and locked up by a handful of private corporations.\nWant to read the papers featuring the most famous results of the sciences?\nYou’ll need to send enormous amounts to publishers like Reed Elsevier.\n\nThere are those struggling to change this.\nThe Open Access Movement has fought valiantly to ensure that scientists do not sign their copyrights away but instead ensure their work is published on the Internet, under terms that allow anyone to access it.\nBut even under the best scenarios, their work will only apply to things published in the future.\nEverything up until now will have been lost.\n\nThat is too high a price to pay.\nForcing academics to pay money to read the work of their colleagues?\nScanning entire libraries but only allowing the folks at Google to read them?\nProviding scientific articles to those at elite universities in the First World, but not to children in the Global South?\nIt’s outrageous and unacceptable.\n\n“I agree,” many say, “but what can we do? The companies hold the copyrights, they make enormous amounts of money by charging for access, and it’s perfectly legal — there’s nothing we can do to stop them.”\nBut there is something we can, something that’s already being done: we can fight back.\n\nThose with access to these resources — students, librarians, scientists — you have been given a privilege.\nYou get to feed at this banquet of knowledge while the rest of the world is locked out.\nBut you need not — indeed, morally, you cannot — keep this privilege for yourselves.\nYou have a duty to share it with the world.\nAnd you have: trading passwords with colleagues, filling download requests for friends.\n\nMeanwhile, those who have been locked out are not standing idly by.\nYou have been sneaking through holes and climbing over fences, liberating the information locked up by the publishers and sharing them with your friends.\n\nBut all of this action goes on in the dark, hidden underground.\nIt’s called stealing or piracy, as if sharing a wealth of knowledge were the moral equivalent of plundering a ship and murdering its crew.\nBut sharing isn’t immoral — it’s a moral imperative.\nOnly those blinded by greed would refuse to let a friend make a copy.\n\nLarge corporations, of course, are blinded by greed.\nThe laws under which they operate require it — their shareholders would revolt at anything less.\nAnd the politicians they have bought off back them, passing laws giving them the exclusive power to decide who can make copies.\n\nThere is no justice in following unjust laws.\nIt’s time to come into the light and, in the grand tradition of civil disobedience, declare our opposition to this private theft of public culture.\n\nWe need to take information, wherever it is stored, make our copies and share them with the world.\nWe need to take stuff that's out of copyright and add it to the archive.\nWe need to buy secret databases and put them on the Web.\nWe need to download scientific journals and upload them to file sharing networks.\nWe need to fight for Guerilla Open Access.\n\nWith enough of us, around the world, we’ll not just send a strong message opposing the privatization of knowledge — we’ll make it a thing of the past.\nWill you join us?\n\nAaron Swartz\n\nJuly 2008, Eremo, Italy","collection":"theory","data":{"title":"Guerilla Open Access Manifesto","description":"Guerilla Open Access Manifesto by Aaron Swartz","tags":["open","research","theory"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1633545505446-586bf83717f0?fit=crop&w=1400&h=700&q=75"}}}