[{"id":"deadcode.mdx","slug":"deadcode","body":"import VideoComponent from \"@c/Element/Video/Video.astro\";\nexport const components = { video: VideoComponent };\n\n* * *\n\n## Videos\n\n    - ## Stop Writing Dead Programs by Jack Rusher \n        - A brilliant presentation from Jack Rusher at the Strange Loop 2022 on an area of `deadcode`.\n        - <VideoComponent iframe src=\"yt\" id=\"8Ab3ArE8W3s\" description=\"Jack Rusher breaks down different fundamental flaws that newer programming languages are carrying over from older languages.\" />\n\n## Information\n  \nDeadcode is a theory-craft that disintegrates, analyzes and abstracts information from archived codes, libraries, frameworks and applications. There are multiple areas within the `deadcode` but the objective would be to help understand, learn and grow from the vast amount of old code.  \n\n## History\n\nWe want to keep an archive of old / deprecated software scripts/libraries as a reference material for future programmers, hackers and researchers. As more and more codebases are fading out or being replaced, it might be wise to keep records of important functions and modules as an educational source of information.\n","collection":"theory","data":{"title":"DeadCode","description":"DeadCode is a theory that focuses on learning from archived code.","tags":["deadcode","theory"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1476370648495-3533f64427a2?fit=crop&w=1400&h=700&q=75"}},{"id":"fintech.mdx","slug":"fintech","body":"\n\n## Information\n\nFinTech, Financial Technology, is an economical construct that stems from classical capitalism and the expansion of informatics through the information age.\n\n## FinTech A-Z\n\nWe decided to write out the `A, B, C, D, s` of the fintech universe into cute and informative reference notes, making it easier for newcomers to understand!\n\n## A\n\n> The *A* in FinTech stands for *Artificial Intelligence*.\n> We have extensive notes on this area within our [ML/AI](https://kbve.com/application/ml/) page\n\n## B\n\n> The *B* in FinTech stands for *Blockchain*.\n> We still need to expand these notes for our favorite data storage mechanism.\n\n## C\n\n> The *C* in FinTech stands for *Cloud Computing*.\n> We could dive into the types of cloud(s), building your own, expanding it via k8s/docker, ect..\n\n## D\n\n> The *D* in FinTechAZ stands for *Data*.\n> A great analogy would be the idea that data mining / collection is equivalent to crude oil, while data organization is equivalent to chemical refinement.\n> Data comes as a cluster of random hydrocarbons and the (data organization) is the separation of the data types, variables and data meta-info.\n\n## E\n\n> The *E* in FinTechAZ stands for *Energy*.\n> The electrical costs from a sustainability aspect to an overall cost reduction within the given environment.\n\n## F\n\n> The *F* is *Financial*.\n\n## G\n\n> The *G* is *Gamification*.\n\n## H\n\n> The *H* is *Hedge*.\n\n## I\n\n> The *I* is: *Internet of Things*\n\n## J\n\n> The *J* is: *Jurisdiction*.\n\n## K\n\n> The *K* is: *Key Kilobyte*.\n> I am definitely trying to sneak K into the mix xD.\n> The `key` aspect is important from data relations to cryptography.\n\n## L\n\n> The *L* is: *Leverage Lion*.\n\n## M\n\n> The *M* is: *Macro Monkey*.\n\n## N\n\n> The *N* is: *NAV Net*.\n> NAV\n\n## O\n\n> The *O* is: *Operations Octopus*.\n\n## P\n\n> The *P* is *Profit Prophet*.\n\n## Q\n\n> The *Q* is *Qualitative*.\n\n## R\n\n> The *R* is *Real Estate*.\n\n## S\n\n> The *S* is Security.\n> This includes the representation of negotiable financial instruments AND realms of cybersecurity.\n\n## T\n\n> The *T* is for *Technology*.\n\n## U\n\n> The *U* is for *Utility*.\n\n## V\n\n> The *V* is for *Virtual*.\n\n## W\n\n> The *W* is for *Wealth*.\n> The *Wealth* is a representation of capital within a personal/corporate entity through the form of credit, debt and futures.\n\n## X\n\n> The *X* is for *Xenon*.\n> Xenocurrency is a term to define currencies that are deposited/exchanged in markets outside of its origin.\n\n## Y\n\n> The *Y* is for *Yield*.\n\n## Z\n\n> The *Z* is for *Zombie*.\n\n## References\n\nThese are the notes / references that we used to compile the foundation of the `A-Z` glossary.\nSome of these information sheets may be removed/replaced with more specific documentation references, as the l\n\n```text\n\nhttps://thedocs.worldbank.org/en/doc/11ea23266a1f65d9a08cbe0e9b072c89-0430012022/original/Fintech-and-the-Future-of-Finance-Glossary.pdf\n\n```\n\n## Art\n\nThe artwork for the AZ will be made using a combination of Stable Diffusion with Artful Intelligence v1. We can start with breaking down the outline of all 26 letters, then expand their term to at least 3-5 sentences, which we will then feed into the machine to output a visual art piece for the respected letter. The style would be a mixture of classic 90s cartoons mixed with old school anime but we will test case out a couple and see where it goes from there.\n","collection":"theory","data":{"title":"FinTech","description":"We are breaking down and noting the different theories within fintech.","tags":["financial","tech","data"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1614680376739-414d95ff43df?fit=crop&w=1400&h=700&q=75"}},{"id":"gamedesign.mdx","slug":"gamedesign","body":"","collection":"theory","data":{"title":"Game Design","description":"We are breaking down and noting the different theories within fintech.","tags":["financial","tech","data"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1633545505446-586bf83717f0?fit=crop&w=1400&h=700&q=75"}},{"id":"healthcare.mdx","slug":"healthcare","body":"\n## Introduction\n\nThe Health Care Debate written by will be a slow series of battles rather than just one major war. I believe the best stance would be for both parties to come together and focus on a few key issues: \n\n- A. The removal of evergreening pharma / trollish patents [2].\n- B. Reverse the bans on the importation of drugs.\n- C. Grants and Tax Incentives.\n\n(a) student & machine learning/researching within particular healthcare niches (EPS for STEM investment is amazing for the society), (b) progressive* generic manufacturing, (c) open sourcing all research/action data (help offset the billions lost for failed drugs), [4] allow all entities (NGO, Medicare ~ not just VA) to barter drug prices, thus upper-limit price regulation, [5] heavy levy-tax on harmful entities/corps/substances, [6] fiduciary-like regulations && career-limitation/bans (No revolving door) for doctors/hospitals staff/health + persons that operate in government agencies like FDA / EPA, etc... This view is based on a 6 fucking hour flight without wifi; fueled by meme withdrawals, lack of sleep, desires for CISPHER the ghost to save the world, and investments in designer babies made in artificial wombs.\n\n[1] Evergreening Pharma Patents - this is a classical move played by pharma companies to continue to make profits off of loopholes within the broken patent system. While every company/entity has the right to defend its expensive patent, it is unethical and greedy for them to use Dinsey-like legislation to monopolize social health and social networking programs. A case in point would be Epipens, granted there is a generic on the market but it was an issue, including its internal situation, definitely a good read. This is a massive issue in other nations, including India. From this point, you could also stem into how flawed the patent system is  /  patent trolling. I also believe the patent fight over CRISPR is a prime example of how burning money verse for a greater cause. \n\n[2] Allowing drugs to be imported from EU/Canada (besides just OTC) would dynamically create, destroy and restructure how drugs are obtained; imagine a doctor writing you a prescription which then automatically enters an amazon-esque online marketplace, where you can opt to get it delivered to your house. This already exists for the most part, but it is very unethical and illegal, I have talked to people that get all their expensive drugs [diabetic, hepi-1, adhd] drugs via the mail from Canadian/EU/Foreign pharmacies. It's cheaper to fly to India, stockpile drugs, enjoy a good vacation, get surgery, and fly back verse doing it all here.\n\n[2b] If a company wants to produce a generic to compete against a monopoly, especially if the trust is on an expired-patented drug, then there should be massive tax incentives/tax breaks to encourage the de-monopolization of that said drug. This does go hand-in-hand with the patent issue and the importation issue. Some drugs have a monopoly within the US because it's illegal to have that said drug be imported. \n\n[3a] Open-sourcing the research/data should allow companies to escape heavy tax burdens if they are attempting to produce a drug but it fail to enter the market. It would help other entities continue the research while preventing others from making the same mistake. If a company spends billions in R&D, test cases, etc… then the government should ensure that the company does not go bankrupt from taxation, especially when the current market for R&D is fueled by investors, which we do not want to lose/push away. \n\n[3b] If a student graduates high school with a high enough GPA, then they should have free access to community college, followed by access to free public university if they are doing R&D for health/engineering / algorithmic / STEMish. ; higher learning schools are already expensive, which is discouraging and harmful at the end of the day. I rather see more youth thrown into the education cycle rather than the criminal.\n\n[4] I am sorry but damn Cali, you guys had a chance to lower the fuck out of our medicare costs (they are super high for the state)… but you guys didn't want to vote that equal right for drug bartering? :C, now I will go back and invest in those pharma stocks dat $abbv.\n\n[5] If it's going to cause cancer, heart complications, and obesity, then there better be a tax on that shit! With all that tax money going back strictly toward medical / health ideals. Tax on Soda, Tax on Fast Food, etc. Furthermore, there should be heavy fines/taxes on entities that release harmful chemicals into the environment, like coal plants && pollution fines up the ass. We should not have Exxon get away from dumping hazardous materials and then allowing shareholders to profit off of it.\n\n[6] Pharma reps should, at most, be allowed to give free samples for their drugs, but other than that, they should NOT be allowed to use any other monetary actions to gain/alter/manipulate/influence. No more free lunches! FDA needs a massive cleanse, it is filled with corruption and backdoor policies. ","collection":"theory","data":{"title":"Healthcare","description":"Debate letter that combines several text transformers into a unique article.","tags":["healthcare","social","data"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1614680376739-414d95ff43df?fit=crop&w=1400&h=700&q=75"}},{"id":"matrix.mdx","slug":"matrix","body":"\n## Theory\n\nThe `Matrix` theory, maybe referenced as AEM or AEMatrix, is an Array Eisenhower Matrix, where the problems reside within a quadrant and scale within their respective zone based upon priority.\nThe theory's core foundation comes from President Eisenhower and extends through Ziggy's reference work. It has been expanded upon through various periods of time and still continues to be improved.\n\n## Eisenhower Matrix\n\n- The theory places all objectives through a simple quadrant based upon the priority.\n\n- We have added onto the existing Eisenhower Matrix system, such that we also have a simple priority\nnumbering system on top of it. The system is as follows:\n  - Urgent & Important: This is set in Github Projects as \"1 U-I\"\n  - Urgent & Not Important: This is set as \"2 U-NI\"\n  - Not Urgent & Important: This is set as \"3 NU-I\"\n  - Not Urgent & Not Important: This is set as \"4 NU-NI\"\n\n- Then in the labels for the issues, we've added a numbering system that starts at zero (lowest priority) and can scale infinitely, with higher numbers being higher priority. For now, we have just 0 through 3, designated as Low, Medium, High, and Very High Priority.\n- With this, in Github Projects, we can group by the Eisenhower Matrix, and then sort by labels.\n- If the priority labels start with the number, then they'll be sorted by those priorities. Order by Z-A (Descending) and you'll have the highest priority tasks at the top of each grouped list for every quadrant of the Eisenhower matrix.\n\n## State\n\n- The Change Control Flow proceeds:\n  - -> Preserve the [Present State]\n  - -> Plan the [Future State]\n  - -> Review* and Approve the `Change`\n  - -> Build the `Change`\n  - -> Launch the `Change`\n- [Present State] becomes [Preserved State], [Future State] becomes [Present State]\n\n* * *\n\n## Terms\n\n- Launch: (alias of `submit`, `execute`, `Go-Live...`) the execution of the state.\n- Build: (alias of `develop`, `Code`, `Work On...`) the development of the state.\n- Review: Depending on the domain of the system being changed, different people should be contacted to be made aware of the impending change. Some people, managers, are empowered to approve or deny a change.\n- Preserve: When a Change is being considered, the first action is always to \"Save your Work\", and capture certain or all elements of the Present and current State of the system that is impact.\n- Plan: The set of instructions that further define and detail the Change to come. The Plan represents a wide variety of types of documentation. The Plan can be adjusted several times while being prepared to be approved.\n\n## Notes\n\n## Journal\n\n``` \n9/22/2022\n> Ziggy had some ideas\n  - Rather than using a simple quadrant system, we could extend the matrix to include a positive and negative array between -100 and 100 in order to 'map out' each task in a much more thorough way.\n  - This could then be used as part of a ai assistant with a simple question to the user\n\n  3rd dimension: Z\n  - Priority range of -10 to 10\n```\n\n## References\n\n1. Flutter Library for Graphics / Charts - [1](https://pub.dev/packages/graphic)\n2. Javascript Library for Graphics / Charts - [2](https://d3js.org/)\n3. Nivo Library / Javascript & React - [3](https://nivo.rocks/)\n\n### Review by Jab5\n\nThis review was taken on 11/25/2022 for v1 for the AE Matrix.\n\n>Jab5: no no thats fair, so the main two things of note i saw that you might want to take into consideration. Is lightly expanding on titles or being more specific with each title, this way when whoever needs to do that task already knows exactly what it is, so its the same picture in everyone's head, leading to a lot less confusion and potentially preventing the situation of whomever is working on the task making something completely different than what it was supposed to be\n>Jab5: the other thing id more or less think about is potentially setting specific times/lengths on different tasks, as that helps to make sure that things more or less do get done in the first place. This largely subjective because it depends a lot on how your group works on it for example if its just every once in a while then that probably wont be very helpful. But having an understanding of the time frame on the individual tasks is something that will always potentially be useful\n>Jab5: And just remember the tool is only as good as your team uses it. So if its just one person interacting with it then honestly going into a large large amount of detail may potentially be more trouble than its worth\n>Jab5: but thats just what i got from looking at how its all arranged from the outside. Its all honestly completely subjective to how it works best for the team itself\n","collection":"theory","data":{"title":"Matrix","description":"KBVE Matrix is based upon the Eisenhower Matrix and git.","tags":["concept","management","task"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1606606767399-01e271823a2e?fit=crop&w=1400&h=700&q=75"}},{"id":"programming.mdx","slug":"programming","body":"\n## Free Programming Books\n\n- Collection of [Free Programming Books](https://ebookfoundation.github.io/free-programming-books/)\n","collection":"theory","data":{"title":"Programming","description":"Programming Notes and Resources","tags":["programming","theory","resources"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1476370648495-3533f64427a2?fit=crop&w=1400&h=700&q=75"}},{"id":"prompt.mdx","slug":"prompt","body":"\n# {frontmatter.title}\n\n## Prompt Theory Information","collection":"theory","data":{"title":"Prompt Engineering Theory","description":"Prompt engineering theory covers a wide range of different GPT concepts, including examples and short cuts to generate the right style of questions and content.","tags":["design","dev","prompt","gpt"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1658874919865-35bb32505edc?fit=crop&w=1400&h=700&q=75"}},{"id":"solarpunk.mdx","slug":"solarpunk","body":"","collection":"theory","data":{"title":"SolarPunk","description":"SolarPunk is a hybrid movement within the technological and environmental eco-systems, with emphasis on utilizing nature.","tags":["design","dev","prompt","gpt"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1658874919865-35bb32505edc?fit=crop&w=1400&h=700&q=75"}}]