{"entry":{"id":"authelia.mdx","slug":"authelia","body":"\nimport GitHub from \"@w/Github.astro\";\nimport Details from \"@w/Details.astro\";\nimport TabMenu from \"@w/TabMenu.astro\";\nimport TabData from \"@w/TabData.astro\";\nimport YT from \"@w/YT.astro\";\nimport N from \"@n/N.astro\";\n\n<TabMenu first=\"general\" data={[\"cheatsheet\", \"system\", \"errors\", \"media\", \"notes\"]}>\n  <TabData tail=\"block\" data=\"general\">\n\n## Information\n\n> Tldr; Authelia is an authentication and authorization application that provides a backend server and frontend portal through various core features and plugins.\n\nHave you ever wondered how to secure your web applications with a simple, secure and elegant solution?\nDo you want to offer your users a seamless and convenient login experience across multiple domains and services?\nIf so, you might be interested in Autheila, an open-source authentication and authorization server that provides two-factor authentication and single sign-on (SSO) for your applications via a web portal.\nIn this document, KBVE will introduce you and your dev team to the features and benefits of Autheila, and show you how to set it up with some common reverse proxies like [Nginx](https://kbve.com/application/nginx), [Traefik](https://kbve.com/application/traefik), or HAProxy.\nBy the end of this reference document, you will be able to protect your web applications with Autheila and enjoy a secure and hassle-free authentication process.\n\n<Details data=\"Metaphor for Autheila\">\n\n### Metaphor\n\nAutheila is a gatekeeper!\nAutheila acts as a gatekeeper for your web applications, allowing or denying access based on your authentication and authorization policies.\nIt also provides a single key for your users to unlock multiple gates, saving them time and hassle.\nAutheila is like a smart and reliable gatekeeper that keeps your web applications safe and user-friendly.\n\n</Details>\n\n<Details data=\"Autheila for a 5yr old!\">\n### 5\n\nImagine you have a lot of toys that you like to play with on different websites.\nSome of them are your own toys, and some of them are shared with your friends.\nYou do not want anyone else to take or break your toys, so you need a way to keep them safe.\nAutheila is like a special friend who helps you do that.\nAutheila asks you for your name and a secret code every time you want to play with your toys.\nSometimes, Autheila also asks you for another secret code that only you know or have.\nThis way, Autheila makes sure that it is really you and not someone else who wants to play with your toys.\nAutheila also remembers your name and secret codes for all the websites, so you don’t have to type them again and again.\nYou just have to tell Autheila once, and then you can play with any toy you want.\nAutheila is like a smart and helpful friend who protects your toys and makes it easy for you to play with them.\n\n</Details>\n\n## Install\n\nThere are different methods to install Authelia, depending on your preferences and environment.\n\n</TabData>\n\n<TabData data=\"cheatsheet\">\n\n## Cheatsheet\n\nAutheila\n\n</TabData>\n\n<TabData data=\"system\">\n\n## System\n\nSystem resources, information and general help.\n\n\n</TabData>\n\n<TabData data=\"errors\">\n\n## Errors\n\nCommon errors within Authelia that our team has ran across.\n\n</TabData>\n\n<TabData data=\"media\">\n\n## Videos\n\nAuthelia videos that will help you with installing, updating and other things.\n\n</TabData>\n\n<TabData data=\"notes\">\n\n## Notes\n\nNotes on Authelia\n\n### Log\n\n#### Journal\n\n<Details data=\"2023-04-15\">Added a test case for the tab system. Looking to see if there might be any other issues when building out the system.</Details>\n<Details data=\"2023-04-11\">Added a quick details component to make the page a bit less clustered</Details>\n<Details data=\"2023-04-10\">General Authelia information and concepts.</Details>\n\n### License\n\n- Authelia is an open source application.\n- Authelia operates under the Apache 2.0 license.\n\n<N ns=\"ads\" template=\"mdx2\" id=\"ezoic\" />\n\n</TabData>\n</TabMenu>\n","collection":"application","data":{"title":"Authelia","description":"Open-source auth software as a middleware. Authelia handles the authentication and authorization of the user/entity, allowing to secure access outside the scope of the application and provides a unique firewall-like access terminal.","tags":["security","host","firewall"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1509822929063-6b6cfc9b42f2?fit=crop&w=1400&h=700&q=75"}}}