{"entry":{"id":"ml/ml.mdx","slug":"ml","body":"\nimport MDXLayer from \"@l/MDXLayer.astro\";\nimport Widget from \"@w/Widget.astro\";\nimport MDXJS from \"@w/MDXJS.astro\";\nimport MDXHero from \"@w/MDXHero.astro\";\n\nimport NotesGlob from \"./_notes/NotesGlob.astro\";\nimport PromptGlob from \"./_prompt/PromptGlob.astro\";\nimport ServicesGlob from \"./_services/ServicesGlob.astro\";\nimport ModelGlob from \"./_model/ModelGlob.astro\";\n\n\n<MDXLayer title={frontmatter.title} description={frontmatter.description}>\n<Widget img={frontmatter.img} skeleton={false}>\n\n<MDXHero content={frontmatter} />\n\n\n<MDXJS>\n\n## ML\n  - `Are you curious about the latest buzzword in the tech world?` \n  - `Have you been wondering what machine learning is?`\n  - `Let us take you on a journey to understand the basics of this revolutionary technology and its potential to revolutionize the future.` \n\n`mL (machine learning)` is a subset of artificial intelligence and follows the theory of computational training, to understand core principles through computer science and statistics.\nThese training methods can be broken down to supervised, unsupervised and reinforcement learning.\n\nIf you're interested in learning the basics of Machine Learning, then you'll need to have a sound understanding of `Computational Theory` and the `Basics of Computer Science`.\nThis involves learning the fundamentals of programming languages (python), algorithms, and data structures. \nKnowing these topics will give you a strong foundation to build upon as you dive deeper into Machine Learning; you will also need to understand the mathematics behind `Machine Learning`-algorithms, such as linear algebra, statistics, calculus, and probability. \nAdditionally, you will need to be well-versed in the different `Machine Learning` / `ML` techniques and tools, such as neural networks, decision trees, support vector machines, and deep learning.\nFinally, you'll need to understand the various Machine Learning frameworks available, such as Keras, PyTorch, TensorFlow, and Scikit-Learn.\n\n### Information\n\nThis documentation is a `reference guide` to the vast realm of machine learning and artificial general intelligence with examples, concepts and libraries to help you get started!\nWe want to create this whole page as a one stop shop for all your mL needs xD!\nNote: This is an ever growing and evolving list of all `mL` / `ai` services, concepts and ideas that can be referenced for your experiences within the field.\n\n### AI\n  - Artificial intelligence is an umbrella phrase that encapsulates various fields within computer science, mathematics, philosophy and information with the goal to emulate natural intelligence display by humans and animals.\n\n### Scope\n  - The dream for many programmers, scientists, engineers and humans would be to create an entity that could scale past our natural intelligence. \n  - This is a task that would define the 21st century and push the upper limits on humanity, naturism and metaphysics into the next industrial intelligence revolution.\n\n\n* * *\n\n\n\n\n</MDXJS>\n\n<ModelGlob />\n\n<ServicesGlob />\n\n<PromptGlob />\n\n<NotesGlob />\n\n</Widget>\n</MDXLayer>","collection":"application","data":{"title":"Machine Learning","description":"mL/AI - The movement to emulate natural intelligence.","tags":["software","technology"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1620712943543-bcc4688e7485?fit=crop&w=1400&h=700&q=75"}}}