{"entry":{"id":"ml.mdx","slug":"ml","body":"\n## ML\n  - `Are you curious about the latest buzzword in the tech world?` \n  - `Have you been wondering what machine learning is?`\n  - `Let us take you on a journey to understand the basics of this revolutionary technology and its potential to revolutionize the future.` \n\n`mL (machine learning)` is a subset of artificial intelligence and follows the theory of computational training, to understand core principles through computer science and statistics.\nThese training methods can be broken down to supervised, unsupervised and reinforcement learning.\n\nIf you're interested in learning the basics of Machine Learning, then you'll need to have a sound understanding of `Computational Theory` and the `Basics of Computer Science`.\nThis involves learning the fundamentals of programming languages (python), algorithms, and data structures. \nKnowing these topics will give you a strong foundation to build upon as you dive deeper into Machine Learning; you will also need to understand the mathematics behind `Machine Learning`-algorithms, such as linear algebra, statistics, calculus, and probability. \nAdditionally, you will need to be well-versed in the different `Machine Learning` / `ML` techniques and tools, such as neural networks, decision trees, support vector machines, and deep learning.\nFinally, you'll need to understand the various Machine Learning frameworks available, such as Keras, PyTorch, TensorFlow, and Scikit-Learn.\n\n### Information\n\nThis documentation is a `reference guide` to the vast realm of machine learning and artificial general intelligence with examples, concepts and libraries to help you get started!\nWe want to create this whole page as a one stop shop for all your mL needs xD!\nNote: This is an ever growing and evolving list of all `mL` / `ai` services, concepts and ideas that can be referenced for your experiences within the field.\n\n### AI\n  - Artificial intelligence is an umbrella phrase that encapsulates various fields within computer science, mathematics, philosophy and information with the goal to emulate natural intelligence display by humans and animals.\n\n### Scope\n  - The dream for many programmers, scientists, engineers and humans would be to create an entity that could scale past our natural intelligence. \n  - This is a task that would define the 21st century and push the upper limits on humanity, naturism and metaphysics into the next industrial intelligence revolution.\n\n* * *\n\n## Image Models\n\n### Stable Diffusion\n\nStable Diffusion is a python-based latent diffusion model that performs image generation through deep learning. \n\n- #### VOID-SD\n  - VOID-SD has direct API access to various forks of Stable Diffusion, including waifu-diffusion, hosted on a hybrid-cloud.\n\n- #### Waifu Diffusion\n  - The official Github repo for [Waifu-Diffusion](https://github.com/harubaru/waifu-diffusion).\n\n- #### Stable Diffusion WebUI\n  - The official repo for `AUTOMATIC1111` [Stable Diffusion WEB UI](https://github.com/AUTOMATIC1111/stable-diffusion-webui)\n\n### QQ\n\n- QQ has several interesting contributions within the AI/ML open source community, we will keep notes/references on these services for educational purposes only!\n\n- #### Different Dimension Me\n  - Official QQ Link for [Different Dimension Me](https://h5.tu.qq.com/web/ai-2d/cartoon/index)\n  - Just remember that you are visiting a Chinese site that comes across very `sus` , please take extra precautions when utilizing any `qq` services.\n\n\n* * *\n\n## Text Models\n\n### Text WebUI\n  - An easy gradio web user interface for running text transformers and large language models like LLaMA, llama.cpp, GPT-J, OPT, and GALACTICA.\n  - [Official Repo](https://github.com/oobabooga/text-generation-webui)\n\n### GPT\n  - GPT , currently known as GPT-3, stands for `Generative Pre-trained Transformer` with the number representing the generation via version control and is a neural network machine learning model\n\n  - #### GPT-Neo\n    - Official Github [Repo](https://github.com/EleutherAI/gpt-neo)\n      - We should note that the team, EleutherAI, are no longer maintaining the `gpt-neo` and their repo is currently in archive mode. However below is the `gpt-neox`, which is still being actively maintained as for Oct 2022.\n    - The `GPT-Neo` may have been an extension of `GPT2` but changes to the layering.\n  \n  - #### GPT-NeoX\n    - For GPU, we suggest GPT-NeoX, [Repo Here](https://github.com/EleutherAI/gpt-neox/)\n\n  - #### GPT4All\n    - What I enjoy about this software is that it is really easy to install and use, plus it requires very bare metal resources.\n    - WebUI for GPT4All written in Flask (Python) by Nomic AI, [Repo Here](https://github.com/nomic-ai/gpt4all-ui)\n    \n\n### LLaMa\n  - LLaMa, also known as, `Large Language Model Meta AI`, is actively being developed by Meta / Facebook and is a state-of-the-art foundational large language model that is designed to help researchers advance their work in natural language processing (NLP).\n\n### ChatGPT\n  - TLDR; ChatGPT is an extension of GPT3 / GPT3.5 and focuses on holding a `natural` conversation with the `client` / `User` by keeping track of the previous question(s) / responses.\n\nChatGPT is an artificial intelligence (AI) system developed by OpenAI that uses a text generation language model to understand and produce natural language text. \nFurthermore, it has been trained on a massive amount of text data from the internet and can create text that resembles how humans write and speak, based on a given input.\nFinally the software can answer questions, converse on a variety of topics, and generate creative writing pieces but beaware that it might provide false information.\nOpenAI based the ChatGPT architecture from the sibling model, InstructGPT, which is trained to follow an instruction in a prompt and provide a detailed response.\nChatGPT accomplishs this by its advance machine learning engine, built using a deep learning architecture called the `Text Transformer`, which enables it to learn patterns in language and generate text that is coherent and human-like. \nChatGPT is one of the most advanced chatbots in the world and has the potential to revolutionize the way we interact with computers and digital systems.\nWe will be providing examples of how to use prompt engineering to obtain positive feedback results from GPT software.\n\n\n- #### PyChatGPT\n  - [Official Repo](https://github.com/rawandahmad698/PyChatGPT). PyChatGPT is an on-going API written in `Python` to help scale and integrate `ChatGPT` to various applications / eco-systems via TLS.\n\n### Prompt Engineering\n\nPrompt engineering theory covers a wide range of different GPT concepts, including examples and short cuts to generate the right style of questions and content. \n\n- #### Roles\n\n  Common `role` examples for text transformers:\n\n  - `Act as a javascript console`\n  - `Act as an excel sheet`\n  - `Act as a HR interviewer`\n  - `Act as an advertiser`\n  - `Act as a publisher`\n  - `Act as a music teacher`\n  - `Act as a relationship coach`\n  - `Act as a World of Warcraft player and limit the response to 50 characters`\n  > *`Warning :`* Not all text transformers will let you assign roles, as it might create a security issue / risk.\n\n- #### Chaining\n  - Common Terms include: Chain-of-Thought, Chained Prompt \n\n* * *\n\n## Content Detection\n\nWhile using various text transformers \n\n- ### Writer.com\n  The [AI Content Detector](https://writer.com/ai-content-detector/) helps detect if the content was AI generated through an unique %-score rank.\n\n- ### CopyLeaks\n  Another content dection style software is offered by [CopyLeaks](https://copyleaks.com/ai-content-detector) but we have not yet tested how accurate it is.\n\n* * *\n\n## Journal\n\n*This is a collective journal with tasks, opinions and notes.*\n*They should not be taken as valid information and should be seen as mere unaudited thoughts of a wandering collection of souls.*\n\n- ### Log\n  \n  - #### 4/5/2023\n    - Merging the notes on prompt engineering with the mL notes because I believe they would fall into the same category.\n    - I will try to update the notes more often as the field keeps progressing and changing rapidly.\n    - Finally I believe we could add more videos as examples.\n\n  - #### 10/24/2022\n    - -> October 24th, 2022 -> \"Computational Learning\" as well as \"mL/AI\" -> two important concepts.\n    - We should say that `ai` is an umbrella phrase that includes various tools, concepts and data. If we could imagine data as crude oil then we can say `models` are refined oils, thus the functional aspect of refinement should be a pillar of machine training.\n    - It be like taking data from our `natural` world, filled with its random and chaos, is collected or drilled, then processed into abstract collections of meaningful and layered information, finally forming our computational models.\n    - There definitely is more to this but that should be a solid building path for where we can go.\n    - The speed at which this field is growing is also remarkable, its still insane to see how my laptop can generate art from just processing my vocals as I talk.\n","collection":"application","data":{"title":"Machine Learning","description":"mL/AI - The movement to emulate natural intelligence.\n","tags":["software","ml","ai","intelligence"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1620712943543-bcc4688e7485?fit=crop&w=1400&h=700&q=75"}}}