{"entry":{"id":"ryujinx.mdx","slug":"ryujinx","body":"\n## Information\n\nRyujinx is an open-source Nintendo Switch emulation software that can be used to play Switch games on Windows.\nTo set up `Ryujinx`, you will need to download the emulator from the Ryujinx website.\nOnce you have downloaded the emulator, you will need to extract the files to a location of your choice.\nAfter extracting the files, you can open Ryujinx and start playing your Switch games.\n\n## Install\n\nWe will break down the process of installation on various operating systems, but it should be noted that this is best used on Windows.\n\n### Choco\n\nInstalling RyuJinx through `choco` is the best option because it will keep the software up to date and make the install/removal very painless and easy!\nIf you do not have `choco` installed, then head over to our [choco documentation file](https://kbve.com/application/choco) for more information.\nThe official package repo for Ryujinx is located [here at Chocolatey](https://community.chocolatey.org/packages/ryujinx) if you need to verify or see their documentation.\n\nThe best way to install it would be to include the Desktop shortcut parameters!\nHere is the quick command to get it installed and running:\n\n```shell\nchoco install ryujinx --params \"/DesktopShortcut\"\n```\n\nThis will have the application installed and you can run it from your desktop! \nSee how easy this was! Makes it so much faster!\n\n### Windows\n\nWe really recommend that you install the software via `choco` as it will save you time, effort and energy! If you need help check, come to our Discord or IRC.\n\nHere are the steps you would take to setup and install RyuJinx directly for Windows:\n\n1.  Download the Ryujinx emulator from the Ryujinx website.\n\t1. (a) You can choose to download the software from the Github repo as well! \n\t2. (b) Make sure you have your drivers updated!\n2.  Extract the files to a location of your choice.\n3.  Open Ryujinx.\n4.  Click on the \"File\" menu and select \"Add Game.\"\n5.  Browse to the location of your Switch game files and select them.\n6.  Click on the \"Open\" button.\n7.  Your game will now start playing in Ryujinx.\n\nAfter you get the software installed, double check it by running it and seeing if there are any errors.\n\n### Mac\n\nWe do not have any notes yet on the Mac install for this time. I will have to spend some time setting that up on my `m1`, however I been told that it is a pain and is not really worth the amount of time to invest.\n\n--- \n\n## Setup\n\nAfter installing the software, you will have to look into setting up the `RyuJinx` and for that we recommend using `RyuSAK`, which can be found [here at the RyuSAK repo](https://github.com/Ecks1337/RyuSAK/release).","collection":"application","data":{"title":"RyuJinx","description":"This educational purpose only document is about the experimental software that was written in C#!","tags":["emulation","software","gaming"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1612036781124-847f8939b154?fit=crop&w=1400&h=700&q=75"}}}