[{"id":"mango-juice.mdx","slug":"mango-juice","body":"\n## Information\n \nIt would be really cool to test out the cooker-AI! I asked it to generate a mango juice recipe that would put a smile on anyone's face. \nThis recipe documentation is the merged-output from all of training data, merged into one unique and personal recipe collection. \nThe goal here is not to automatically generate an amazing recipe but rather use machine learning / artificial intelligence as a tool to help make the nectar of gods. \n\n## Mango\n\nWe could use about four different phases of mangos for the recipe; the first form would be the ripe mango, next its fibrous pulp form, then there is puree and finally the nectar.\n\n### Ripe\n\n### Pulp\n\nPulp is an important part of the fruit that has juice sacs and fibers, and it can gives the juice more body thus resulting in a nutrient rich thick texture.\nPulp also has some health benefits, such as providing fiber, polyphenols and antioxidants.\nThe fiber helps with digestion and prevents constipation, while the polyphenols and antioxidants are compounds that fight inflammation and cancer.\nBut wait! [What are polyphenols](https://kbve.com/theory/polyphenols/)?! and what kind do mangos contain?! \nWell the mango pulp is rich in polyphenols, especially gallotannins and gallic acid, which are found in the skin and membrane of the fruit cells.\nOther minor polyphenols in mango pulp include vanillic, protocatechuic, p-hydroxybenzoic acid, p-coumaric, ferulic, cinnamic, caffeic, chlorogenic acid, mangiferin, and quercetin derivatives.\nSource for the polyphenols within mangos come from this research paper, [Mango Mangifera indica L. Polyphenols: Anti-Inflammatory Intestinal Microbial Health Benefits, and Associated Mechanisms of Actions](https://www.mdpi.com/1420-3049/26/9/2732#)\n\n\nPulp is a hidden treasure in fruit juice that you should not miss.\nBut pulp can also cause some problems, such as sedimentation when mixed with whey or affecting the color, flavor and aroma of the juice.\nThis last part is important to keep in mind when making our juice recipe!\n\n\n### Puree\n\n### Nectar","collection":"recipe","data":{"title":"Mango Juice","layout":"../../layouts/theme/mdx.astro","description":"A healthy drink to start your day off! Mangos are definitely OP.","tags":["drinks","juice","fruits","mango"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1623065422902-30a2d299bbe4?fit=crop&w=1400&h=700&q=75"}}]