[{"id":"mango-juice.mdx","slug":"mango-juice","body":"import MDXLayer from \"@l/MDXLayer.astro\";\nimport Widget from \"@w/Widget.astro\";\nimport MDXJS from \"@w/MDXJS.astro\";\n\n<MDXLayer title={frontmatter.title} description={frontmatter.description}>\n<Widget img={frontmatter.img} skeleton={false}>\n<MDXJS>\n\n\n## Information\n \nIt would be really cool to test out the cooker-AI! I asked it to generate a mango juice recipe that would put a smile on anyone's face. \nThis recipe documentation is the merged-output from all of training data, merged into one unique and personal recipe collection. \nThe goal here is not to automatically generate an amazing recipe but rather use machine learning / artificial intelligence as a tool to help make the nectar of gods. \n\n## Mango\n\nWe could use about four different phases of mangos for the recipe; the first form would be the ripe mango, next its fibrous pulp form, then there is puree and finally the nectar.\n\n### Ripe\n\n### Pulp\n\nPulp is an important part of the fruit that has juice sacs and fibers, and it can gives the juice more body thus resulting in a nutrient rich thick texture.\nPulp also has some health benefits, such as providing fiber, polyphenols and antioxidants.\nThe fiber helps with digestion and prevents constipation, while the polyphenols and antioxidants are compounds that fight inflammation and cancer.\nBut wait! [What are polyphenols](https://kbve.com/theory/polyphenols/)?! and what kind do mangos contain?! \nWell the mango pulp is rich in polyphenols, especially gallotannins and gallic acid, which are found in the skin and membrane of the fruit cells.\nOther minor polyphenols in mango pulp include vanillic, protocatechuic, p-hydroxybenzoic acid, p-coumaric, ferulic, cinnamic, caffeic, chlorogenic acid, mangiferin, and quercetin derivatives.\nSource for the polyphenols within mangos come from this research paper, [Mango Mangifera indica L. Polyphenols: Anti-Inflammatory Intestinal Microbial Health Benefits, and Associated Mechanisms of Actions](https://www.mdpi.com/1420-3049/26/9/2732#)\n\n\nPulp is a hidden treasure in fruit juice that you should not miss.\nBut pulp can also cause some problems, such as sedimentation when mixed with whey or affecting the color, flavor and aroma of the juice.\nThis last part is important to keep in mind when making our juice recipe!\n\n\n### Puree\n\n### Nectar\n\n</MDXJS>\n</Widget>\n</MDXLayer>","collection":"recipe","data":{"title":"Mango Juice","description":"A healthy drink to start your day off! Mangos are definitely OP.","tags":["drinks","juice","fruits","mango"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1623065422902-30a2d299bbe4?fit=crop&w=1400&h=700&q=75"}},{"id":"mcconaughey-diet.mdx","slug":"mcconaughey-diet","body":"\nimport MDXLayer from \"@l/MDXLayer.astro\";\nimport Widget from \"@w/Widget.astro\";\nimport MDXJS from \"@w/MDXJS.astro\";\n\n<MDXLayer title={frontmatter.title} description={frontmatter.description}>\n<Widget img={frontmatter.img} skeleton={false}>\n<MDXJS>\n\n\n## McConaughey's Mediterranean Diet\n\n[Check out this Insider Post on the Matthew McConaughey's Diet for the Dallas Buyer's Club](https://www.insider.com/matthew-mcconaughey-lost-50lbs-for-dallas-buyers-club-on-diet-2020-10). Matthew McConaughey lost 50 pounds on the Mediterranean diet. Guess he wanted to be 'McCona-slim' instead of 'McCona-hey'! I guess he proved that 'abs'olutely anything is possible! McConaughey's diet also allowed him to eat cheese and yogurt in moderation. Talk about 'dairying' his way to a healthier lifestyle!\n\n### What is the Mediterranean Diet?\n\nThe Mediterranean diet is all about balance, like enjoying wine in moderation. It's like saying, 'I'll have a glass, but I won't whine!' It's all about fish and seafood. I guess it's a 'scale' of flavors for McConaughey! The Mediterranean diet is a way of eating based on the traditional cuisine of countries bordering the Mediterranean Sea. While there is no single definition of the Mediterranean diet, it is typically high in vegetables, fruits, whole grains, beans, nut and seeds, and olive oil. The Mediterranean diet emphasizes olive oil. No wonder McConaughey's weight loss plan was 'olive oil' smooth! With all those vegetables, fruits, and whole grains, the Mediterranean diet is like a 'sea' of healthy choices. McConaughey sailed through it!\nAnother big component to this particular diet is the consumption of fish and seafood at least a couple times a week. Poultry, eggs, cheese, and yogurt can be eaten in moderation. Meanwhile, red meat is eaten only occasionally.\nRed wine in moderation is recommended on the Mediterranean diet. It's like the diet's way of saying, 'Wine not?'\n\n### What kind of wine should I drink?\n\nThe Mediterranean diet typically allows red wine in moderation. Red wine is high in antioxidants and has been linked to a wide range of health benefits. However, keep in mind that drinking too much alcohol can have harmful effects.\nAccording to my buddy, [Malbec Wine](https://winefolly.com/deep-dive/what-is-malbec-wine/) pairs best with this diet. Looks like McConaughey found the 'red' path to weight loss! However, pairing a red wine with a meal is a very personal choice. If you're not a fan of Malbec, don't worry. You can still 'wine' and dine with a Cabernet Sauvignon or a Merlot. Choices, choices!\n\n</MDXJS>\n</Widget>\n</MDXLayer>","collection":"recipe","data":{"title":"McConaughey's Mediterranean Diet","description":"A healthy diet to lose weight with! Matthew McCongaughey's Mediterranean Diet is a great way to lose weight and stay healthy. It's also delicious!","tags":["diet","foods","vegetables","fish","eggs","wine"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1498837167922-ddd27525d352?fit=crop&w=1400&h=700&q=75"}}]