{"entry":{"id":"o.mdx","slug":"o","body":"\nimport Details from \"@w/Details.astro\";\nimport TradingView from \"@w/TradingView.astro\";\nimport TabMenu from \"@w/TabMenu.astro\";\nimport TabData from \"@w/TabData.astro\";\n\n\n## Information\n$O is the stock symbol for *Realty Income Corporation*, a real estate investment trust (REIT) that owns and operates over 6,500 commercial properties in the United States and Europe. \nThe company motto is \"The Monthly Dividend Company\" because it is known for paying monthly dividends to its shareholders and has increased its dividend for 109 consecutive quarters since its public listing in 1994.\n\n<TabMenu first=\"chart\" data={[\"intro\", \"options\", \"exchange\", \"reports\", \"notes\"]}>\n  <TabData tail=\"block\" data=\"chart\">\n    <TradingView data=\"NYSE:O\" />\n  </TabData>\n  <TabData data=\"intro\">\n\n## Intro\n\nIf you are looking for a reliable source of monthly income from your investments, you might want to consider Realty Income Corporation ($O), a real estate investment trust (REIT) that owns and operates over 6,500 commercial properties in the United States and Europe.\nRealty Income is known as \"The Monthly Dividend Company\" because it has paid dividends to its shareholders every month since its public listing in 1994. In fact, it has increased its dividend for 109 consecutive quarters, making it one of the few S&P 500 Dividend Aristocrats.\nRealty Income's properties are mostly single-tenant retail buildings leased to well-known tenants such as Walgreens, Dollar General, FedEx, and 7-Eleven. These tenants sign long-term leases with rent increases built in, providing stable and predictable cash flow for the company. Realty Income also diversifies its portfolio by geography, industry, and tenant to reduce risk and enhance growth opportunities.\nRealty Income's stock performance has been impressive over the years. It has delivered an average annual total return of 14.6% since 1994, outperforming the S&P 500 index. It also has a low correlation with the broader market, making it a good hedge against volatility. As of March 8, 2023, Realty Income's stock price was $59.27 per share and its dividend yield was 4.14%.\nIf you are interested in investing in Realty Income, you can buy its shares through any online brokerage platform that offers access to the NYSE. You can also learn more about the company by visiting its website at www.realtyincome.com.\nRealty Income is a great example of a REIT that provides consistent and growing income to its investors. By owning high-quality properties with long-term leases, it has built a solid reputation as one of the best dividend stocks in the market.\n\n</TabData>\n  <TabData data=\"options\">Options</TabData>\n  <TabData data=\"exchange\">Exchanges</TabData>\n  <TabData data=\"reports\">Reports</TabData>\n  <TabData data=\"notes\">\n\n## Notes\n\nThese are the collection of notes for the Reality Income MDX Document.\n\n### Log\n\n- [X] Add Charts for $O\n- [X] Add tabs with charts!\n- [ ] Need more information and data\n\n#### Journal\n\n<Details data=\"2023-04-14\">\nTesting the charts for O\n</Details>\n\n</TabData>\n</TabMenu>\n","collection":"stock","data":{"ticker":"O","title":"O","description":"Realty Income is a blue chip real estate investment trust that pays a monthly dividend.","exchange":"NYSE","tags":["reit","us","branding"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1486406146926-c627a92ad1ab?fit=crop&w=1400&h=700&q=75"}}}