{"entry":{"id":"disclaimer.mdx","slug":"disclaimer","body":"import MDXLayer from \"@l/MDXLayer.astro\";\nimport Widget from \"@w/Widget.astro\";\nimport MDXJS from \"@w/MDXJS.astro\";\n\n<MDXLayer title={frontmatter.title} description={frontmatter.description}>\n<Widget img={frontmatter.img} skeleton={false}>\n<MDXJS>\n\nWe are doing our best to prepare the content of this site. However, KBVE (and its associations and subsidiaries) cannot warranty the expressions\nand suggestions of the contents, as well as its accuracy. In addition, to\nthe extent permitted by the law, KBVE (assocations and subsidiaries) shall\nnot be responsible for any losses and/or damages due to the usage of the\ninformation on our website(s). KBVE (content, site, files) is for\ninformational and/or entertainment purposes only, you should not construe\nany such information or other material as legal, statutory, tax,\ninvestment, financial, or other advice. Nothing contained on KBVE\n(content, site, files ) constitutes a solicitation, recommendation,\nendorsement, or offer by KBVE or any third party service provider to buy\nor sell any securities or other financial instruments in this or in in any\nother jurisdiction in which such solicitation or offer would be unlawful\nunder the securities laws of such jurisdiction. By using our website\n(including content), you hereby consent to our disclaimer and agree to its\nterms. The links contained on our website may lead to external sites,\nwhich are provided for convenience only. Any information or statements\nthat appeared in these sites are not sponsored, endorsed, or otherwise\napproved by KBVE. For these external sites, KBVE cannot be held liable for\nthe availability of, or the content located on or through it. Plus, any\nlosses or damages occurred from using these contents or the internet\ngenerally.\n\n</MDXJS>\n</Widget>\n</MDXLayer>","collection":"legal","data":{"id":"disclaimer","title":"Disclaimer","description":"The Official KBVE Disclaimer","version":1,"tags":["legal","disclaimer"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1585909695677-2b0492f96e3b?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80","date":"12/13/2022","url":"https://kbve.com/legal/disclaimer/"}}}