{"entry":{"id":"discord-sh.mdx","slug":"discord-sh","body":"\nimport MDXLayer from \"@l/MDXLayer.astro\";\nimport Widget from \"@w/Widget.astro\";\nimport MDXJS from \"@w/MDXJS.astro\";\n\n<MDXLayer title={frontmatter.title} description={frontmatter.description}>\n<Widget img={frontmatter.img} skeleton={false}>\n<MDXJS>\n\n\n## Information\n\nDiscord.sh is our first KBVE service that aims to help build automated discord bots for private communities. \nI am currently testing various bots to see which would be the best as the base for us to use. \nWe are running application ID `1116505109061443614` on our current main server aka Melody the Music Bot.\nThe goal is to automate a decent chunk of the DX, which includes the management, deployment, panel, ect..\n\n### Scope\n\nThe general scope of the Discord.sh project will be to provide a private dashboard that lets the user launch and maintain their own discord bot.\n\nThe initial stages would be the generic, User register/login/profile.\n\nAfterwards would we would provide a simple panel that could handle a simple task of deploying a bot, adding the bot, ect...\n\nThey have to create the initial information for the Discord bot via the developerment panel, this could be handled by us but I think it be best to let them do that part.\n\nAfter they get the application id, public key, token, and other variables. \nThey save those to our panel and then our panel would deploy them via a cloud function.\n\nWe should focus initially on just this limited scope for now, at least in the bot development cycle.\n\nNow switching over to the other side, which would be the toplist / voting. I believe we could keep that simple.\n\nWe could start with a general object / interface for the Discord Server, itself. \n\nTitle -> String , limited to 64 characters aZ09 regex\nDescription -> String, limited to 300 characters aZ09 regex\nServer Code -> Number, limited to 16? characters, 09 regex, I have to double check this.\nServer Invite Code -> String, limited to 16? charaters, az09 regex, I have to double check this.\nVotes -> Number -> 0 , Read-only permission for the users.\n\nThen add a simple vote button, that would log the IP address and the time they voted, then increase the vote count for the server by 1.\n\nWe could then run a cron to reset the votes for each of the server every 30 days. \n\nI am thinking we could also migrate the \"votes\" out of the initial discord server object and move it over its own table, where it is:\n\nServer_Object_Id -> Hash -> Represents the general object / interface for the Discord Server.\nVote -> Number -> 0 , Read-only permission for the users.\n\n--- \n\n## Development\n\nThese are the short notes on the development cycle.\n\n### Red\n\nAfter some consideration, we were thinking that it would make the most sense to use Discord.red as the core of the bot.\nThis way we can focus on expanding the modules aka the cogs while having the perks of the open source python bot.\nExecution of the bot can be done in a python-only docker image or we could wrap the bot around NodeJS using NodePy.\n\n### Graph\n\n---\n\n## User\n\nThese will be the notes on the user interface and experience. \n\n---\n\n\n</MDXJS>\n</Widget>\n</MDXLayer>","collection":"project","data":{"id":5,"title":"Discord.sh","client":"Self","category":"Project","frontpage":true,"publishDate":"2021-10-02T00:00:00.000Z","img":"https://images.unsplash.com/photo-1614680376739-414d95ff43df?fit=crop&w=1400&h=700&q=75","description":"Discord.SH | A Discord Server List, Discord Topsite, Player Reward System and Bot Project.","tags":["design","dev","branding"]}}}