[{"id":"api.mdx","slug":"api","body":"import Github from \"@w/Github.astro\";\nexport const components = { github: Github };\n\n## Docs\n\n- Official documentation will be provided for the API, we are currently going to base the API off of Strapi.\n\n* * *\n\n## Install\n\n- To help scale the API backend, we are also currently developing the backend cluster of both the API and the database that stores the information (MariaDB).\n    - Current Docker Compose for ve2\n        <Github src=\"data/api/ve2/docker-compose.yml\" description=\"This is the current docker compose for a ve2 that runs our API.\" />\n\n* * * \n\n## Uptime\n- ![API Uptime Badge](https://api.checklyhq.com/v1/badges/checks/206925a6-0f7b-4669-a4fd-b61b3f5b70fc?style=for-the-badge&theme=default&responseTime=true)\n\n* * *\n\n\n## Auth\n- Auth Journal \n  - For the core of the API, we will use JWT as the `key` in between the $User and $API.\n- React JSX\n  - The first mod will be the core auth system between the client $User and server $API, which includes the register and login. While we build it out, we will include generic defensive components into the foundation, then re-visit and apply external security, such as limits and firewalls (some may operate outside of the API).\n    - Cookie Storage (of the JWT)\n      - Cookie - `token` - will store the client $User JWT.\n      - Cookie - `user` - will store the client $User data.\n      - Library: `react-cookie` will be used to help maintain the cookies.\n\n* * *\n\n### Goal\n\nThe API is an unique construct that extends outside of the norm.","collection":"project","data":{"id":4,"layout":"../../layouts/theme/mdx.astro","title":"API","client":"Self","frontpage":true,"publishDate":"2020-03-02T00:00:00.000Z","img":"https://images.unsplash.com/photo-1658874919865-35bb32505edc?fit=crop&w=1400&h=700&q=75","description":"KBVE API - Central API for KBVE Projects.","tags":["design","dev","branding"],"repo":"kbve/api.kbve.com"}},{"id":"ar.mdx","slug":"ar","body":"\n## TO:DO - \n\n## Glasses\n\n- Nreal Air AR Glasses + SDK Notes have to be added.","collection":"project","data":{"id":1,"layout":"../../layouts/theme/mdx.astro","title":"AR","client":"Self","category":"API","frontpage":true,"status":true,"publishDate":"2021-09-07T00:00:00.000Z","date":"11/11/2022","author":"h0lybyte","img":"https://images.unsplash.com/photo-1550052558-11de18b04282?fit=crop&w=1400&h=700&q=75","description":"AR Project for KBVE","tags":["design","dev","ar","vr"]}},{"id":"charles.mdx","slug":"charles","body":"\nimport Details from \"@w/Details.astro\"\n\n## Story\n\n<Details data=\"Short Story about Charles\">\n\nCharles the Cyber Monkey\n\nCharles was not like the other monkeys. \nThis cyber monkey had a metal arm and a glowing eye that could hack into any system. \nHe lived in a hidden base in the jungle, where he and his friends planned to overthrow the Matrix, the virtual reality that enslaved most of humanity.\n\nOne day, Charles received a message from Morpheus, the leader of the resistance. \nThe leader had a mission for him: to infiltrate the main power plant of the Matrix and destroy the wires that connected it to the rest of the world. \nCharles accepted the challenge and prepared his gear.\n\nHe took a hoverbike and flew across the sky, dodging the patrols of the Agents, the guardians of the Matrix. \nHe reached the power plant and landed on the roof. He used his metal arm to hack into the security system and opened a vent. \nHe crawled inside and made his way to the core.\n\nHe saw a huge chamber filled with wires that glowed with blue light. \nHe knew that each wire represented a human mind trapped in the Matrix. \nHe felt a pang of pity, but he also knew that this was the only way to free them. He took out a bomb and attached it to one of the wires. \nHe set the timer and ran back to the vent.\n\nHe heard an explosion behind him and saw sparks flying everywhere. \nHe smiled and thought that he had done it. \nHe had broken the wires within the Matrix. \nBut then he heard a voice in his head.\n\n\"Charles, wake up. You are still in the Matrix.\"\n\nHe felt a jolt of pain and realized that it was all a trap. \nHe had been tricked by the Agents into destroying a fake power plant. \nThey had used his cybernetic implants to manipulate his senses and make him believe that he was outside.\n\nHe opened his eyes and saw that he was lying on a table, surrounded by wires that connected him to a machine. \nHe saw an Agent standing over him, holding a gun.\n\n\"Goodbye, cyber monkey,\" the Agent said and pulled the trigger.\n\n</Details>\n\n## Information\n\n* * *\n\n## Machine\n\n\n\n* * *\n\n## Notes\n\nNotes on the birth of Charles \n\n### Log\n\n#### Journal\n\n\n\n<Details data=\"2023-04-10\">\n##### 04-10-2023\n@h0lybyte\nWe could go with a workstation? server rack? Hmm we have a couple options to pick from.\n</Details> ","collection":"project","data":{"id":8,"layout":"../../layouts/theme/mdx.astro","title":"Charles","client":"Self","category":"API","frontpage":true,"status":true,"publishDate":"2023-04-10T00:00:00.000Z","author":"Ziggy9263 h0lybyte","img":"https://images.unsplash.com/photo-1516563988150-3e50726d365c?fit=crop&w=1400&h=700&q=75","description":"Charles The Cyber Monkey that holds the wire within the fabric of the matrix.","tags":["design","dev","ml","ai"]}},{"id":"cityvote.mdx","slug":"cityvote","body":"\n## information\n\nThis a collection of various open source software that we will be utilizing for various projects.\n\n**Rewrite** This information is from Bard and Google.\n\nCities are complex systems that generate a vast amount of data. \nThis data can be used to improve the efficiency and effectiveness of city services, make better decisions about urban planning, and improve the quality of life for citizens.\n\nCity data mining is the process of extracting knowledge from this data.\nIt can be used to identify patterns, trends, and relationships that would not be visible to the naked eye. This knowledge can then be used to improve the way cities operate.\n\nCity information software is a type of software that is used to collect, store, and analyze city data. It can help cities to manage their data more effectively and to make better use of it.\n\nThere are many different types of city information software available. Some of the most common types include:\n\n- **Geographic information systems (GIS)**: GIS software is used to store and visualize spatial data. It can be used to create maps, analyze land use, and track changes to the environment.\n- **Sensor networks:** Sensor networks are made up of a large number of sensors that collect data about the environment. This data can be used to monitor things like traffic, air quality, and water levels.\n- **Big data analytics:** Big data analytics software is used to analyze large datasets. This software can be used to identify patterns and trends that would not be visible to the naked eye.\n\nCity data mining and city information software are powerful tools that can be used to improve the way cities operate. By using these tools, cities can make better decisions about urban planning, improve the efficiency and effectiveness of city services, and improve the quality of life for citizens.\n\nHere are some examples of how city data mining and city information software are being used to improve cities:\n\n-   **Traffic management:** City data mining is being used to improve traffic management. By analyzing data from traffic sensors, cities can identify congested areas and make changes to traffic signals to improve flow.\n-   **Public safety:** City data mining is being used to improve public safety. By analyzing data from crime reports, cities can identify crime hotspots and deploy resources more effectively.\n-   **Waste management:** City data mining is being used to improve waste management. By analyzing data from trash cans, cities can identify areas where waste is accumulating and make changes to collection schedules.\n-   **Parking management:** City data mining is being used to improve parking management. By analyzing data from parking meters, cities can identify areas where parking is scarce and make changes to pricing or availability.\n-   **Public transportation:** City data mining is being used to improve public transportation. By analyzing data from ridership, cities can identify areas where service is needed and make changes to routes or schedules.\n\nThese are just a few examples of how city data mining and city information software are being used to improve cities. As these technologies continue to develop, we can expect to see even more innovative ways to use them to make our cities better places to live.\n\n---\n\nRepo URL:\n","collection":"project","data":{"id":10,"layout":"../../layouts/theme/mdx.astro","title":"CityVote","client":"Self","category":"API","frontpage":true,"status":true,"publishDate":"2023-05-21T00:00:00.000Z","author":"h0ly and Mansa","img":"https://images.unsplash.com/photo-1477959858617-67f85cf4f1df?fit=crop&w=1400&h=700&q=75","description":"Open source collection of software for private projects.","repo":"https://github.com/KBVE/cityvote-scrapper","tags":["design","search","concept"]}},{"id":"discord-sh.mdx","slug":"discord-sh","body":"\n## Discord.sh\n\nDiscord.sh is our first KBVE service that aims to help","collection":"project","data":{"id":5,"layout":"../../layouts/theme/mdx.astro","title":"Discord.sh","client":"Self","category":"Project","frontpage":true,"publishDate":"2021-10-02T00:00:00.000Z","img":"https://images.unsplash.com/photo-1614680376739-414d95ff43df?fit=crop&w=1400&h=700&q=75","description":"Discord.SH | A Discord Server List, Discord Topsite, Player Reward System and Bot Project.","tags":["design","dev","branding"]}},{"id":"galaxia.mdx","slug":"galaxia","body":"import Github from \"@w/Github.astro\";\nexport const components = { github: Github };\n\n## Information\n\n- Our current project is Galaxia, which will be an open source cluster-ready API that extends out to various projects. When working on Discord.sh, we decided that it would make sense to build an all-in-one / hyper scalable API.\n\n\n## Micro\n\n- This is a general write-up on the micro-services within Galaxia. We should isolate parts of the `API` into small entities that can help us scale faster at a production level. Before entering into a development phase, it would be wise to get a general sense of how we would want to implement the services and their isolation.\n\n- ### Profile\n\n  - The module of `user` should consist of three components, `register`, `login` and `profile`.\n  - Entity : Register - This entity would function to take `{$username}`, `{$email}`, `{$password}` and create a data block for the user.\n    - The encryption for the `{$password}` would be a hash, most likely a b_crypt.\n  - Entity : Login - This entity would function to verify , log the user in and return a JWT token that would represent the user.\n  - Entity : Profile - Verify the JWT token is valid and then return the generic user information. Part of this function would be to expand on what exact information should be returned.\n\n- ### Dev\n\n  - There will be a splinter approach to resolving this profile concept, with a multi pipeline approach. We will continuously make sure our module(s) work at a `production` level and expand its usage within multiple languages (Javascript, Flutter, Rust, C#) but also improve the underlying methodology. The goal is that we want the `$client` to operate at the `user` level throughout various applications, website, apps, games. Further more we want to look for ways to improve the performance and security of on the various applications.\n\n- ### Map\n\n  - Core: `https://{$component}.{$module}.{$domain}.{$tld}`\n    - POC: `https://register.user.kbve.com` - Would be the official front-facing digital location for action of registering.\n  - User Mod\n    - Register: `https://register.user.kbve.com/`\n      - Short Hand URL: `https://r.u.kbve.com/`\n    - Login: `https://login.user.kbve.com/`\n      - Short Hand URL: `https://l.u.kbve.com/`\n    - Profile: `https://profile.user.kbve.com/`\n      - Short Hand URL: `https://p.u.kbve.com/`\n    - SSO: `https://sso.user.kbve.com`\n      - Short Hand URL: `https://s.u.kbve.com/`\n    - JWT: `https://jwt.user.kbve.com`\n      - Short Hand URL: `https://j.u.kbve.com/`\n    - WebSocket: `https://ws.u.kbve.com/`\n    - Net: `https://net.u.kbve.com/`\n    - DNS: `https://dns.u.kbve.com/`\n\n\n## Install\n- Install using the docker compose.\n  -  <Github src=\"data/galaxia/docker-compose.yml\" description=\"This is the current docker compose for Galaxia\" />\n\n## Notes\n\nWe migrated out of Galaxia and into Appwrite for the current time being, this was to save us time developing out our own personal API. While making our own API was an interesting adventure, the concept was not worth the amount of time to invest.","collection":"project","data":{"id":2,"layout":"../../layouts/theme/mdx.astro","title":"Galaxia","client":"Self","category":"API","frontpage":true,"status":true,"publishDate":"2021-09-07T00:00:00.000Z","date":"10/1/2022","author":"h0lybyte","img":"https://images.unsplash.com/photo-1444703686981-a3abbc4d4fe3?fit=crop&w=1400&h=700&q=75","description":"Galaxia is an open source cluster-ready api.","tags":["design","dev","api"]}},{"id":"roguejester.mdx","slug":"roguejester","body":"\n## Information\n\nWe are currently testing the Git LFS and the CI/CD for the Steam release.\nWe definitely think the dark and darker style but set in the cyberpunk future is the best way to describe the path the game will take.\n\n---\n\n## Ideas\n\n- Get Unity Assets for Robots NPC Bosses etc `low poly`\n- Add more levels to the game\n- Creating Levels - need ideas what kinda of levels and what assets to use\n- Borderlands is the TO-GO game\n- Improving AI - adding new state machines to the game so enemies are more interesting\n- Boss Fights\n- Game is in space We use Space SkyBox\n- Leveling Up System - MAX HP increases when player levels up\n- Talent Tree - TBD\n- Add MiniMap - UI\n- Upgrade System - Upgrade Weapons\n- New Weapons Added\n- New Classes Added - Each class got unique ability\n- SFX GunShots - `NO BGX`\n\n---\n\n## Errors\n\nCurrent errors for Rogue Jester that we need to resolve:\n\n### Build Error\n\nThese are the active build errors for the RJ application or CI/CD for the project.\n\n#### Build Error 1:\n\n```\n\n[error] Error: unrecognized project! Please check your app configuration - if this is a Unity application, We expect your \"Project Subdirectory\" to be set to the path which directly contains the ProjectSettings and Assets directories. For a native app, this should be set to the path which directly contains the project file (.xcodeproj, project.properties, etc).\n\n```\n\n\n### Application Error\n\nApplication Error 1:\n\n```\n\nError: Only Capsule and Sphere Colliders are supported by the Lean ability.\nUnityEngine.Debug:LogError (object)\nOpsive.UltimateCharacterController.FirstPersonController.Character.Abilities.Lean:Awake () (at Assets/Opsive/UltimateCharacterController/Scripts/FirstPersonController/Character/Abilities/Lean.cs:78)\nOpsive.UltimateCharacterController.Character.UltimateCharacterLocomotion:InitializeAbilities () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/UltimateCharacterLocomotion.cs:340)\nOpsive.UltimateCharacterController.Character.UltimateCharacterLocomotion:AwakeInternal () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/UltimateCharacterLocomotion.cs:301)\nOpsive.UltimateCharacterController.Character.CharacterLocomotion:Awake () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/CharacterLocomotion.cs:310)\n\n```\n\n\nError 2:\n\n```\n\nError: Only Capsule and Sphere Colliders are supported by the Item Pullback ability.\nUnityEngine.Debug:LogError (object)\nOpsive.UltimateCharacterController.ThirdPersonController.Character.Abilities.Items.ItemPullback:Awake () (at Assets/Opsive/UltimateCharacterController/Scripts/ThirdPersonController/Character/Abilities/ItemAbilities/ItemPullback.cs:54)\nOpsive.UltimateCharacterController.Character.UltimateCharacterLocomotion:InitializeItemAbilities () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/UltimateCharacterLocomotion.cs:366)\nOpsive.UltimateCharacterController.Character.UltimateCharacterLocomotion:AwakeInternal () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/UltimateCharacterLocomotion.cs:302)\nOpsive.UltimateCharacterController.Character.CharacterLocomotion:Awake () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/CharacterLocomotion.cs:310)\n\n```\n\nError 3:\n\n```\n\nUnassignedReferenceException: The variable m_AvailableModels of ModelManager has not been assigned.\nYou probably need to assign the m_AvailableModels variable of the ModelManager script in the inspector.\nOpsive.UltimateCharacterController.Character.ModelManager.Start () (at Assets/Opsive/UltimateCharacterController/Scripts/Character/ModelManager.cs:62)\n\n```\n\nError 4:\n\n```\n\nNullReferenceException: Object reference not set to an instance of an object\nOpsive.UltimateInventorySystem.UI.Currency.MultiCurrencyView.DrawCurrency (Opsive.UltimateInventorySystem.Exchange.CurrencyCollection currencyCollection) (at Assets/Opsive/UltimateInventorySystem/Scripts/UI/Currency/MultiCurrencyView.cs:62)\nOpsive.UltimateInventorySystem.UI.Monitors.CurrencyOwnerMonitor.CurrencyUpdate (Opsive.UltimateInventorySystem.Exchange.CurrencyOwnerBase currencyOwner) (at Assets/Opsive/UltimateInventorySystem/Scripts/UI/Monitors/CurrencyOwnerMonitor.cs:86)\nOpsive.UltimateInventorySystem.UI.Monitors.CurrencyOwnerMonitor.Initialize () (at Assets/Opsive/UltimateInventorySystem/Scripts/UI/Monitors/CurrencyOwnerMonitor.cs:63)\nOpsive.UltimateInventorySystem.UI.Monitors.CurrencyOwnerMonitor.Start () (at Assets/Opsive/UltimateInventorySystem/Scripts/UI/Monitors/CurrencyOwnerMonitor.cs:38)\n\n```\n\n### Closed\n\nThe issues and errors that have been closed.\n\n#### Unity Cloud Error 1\n\n`Unity Cloud Error 1` was the failure of the Unity DevOps / Build tools to automatically detect the current version of Unity that our project sent.\n\n```\nSomething went wrong when submitting your build(s)\nCould not auto Default Windows desktop 64-bit detect unity version. Failed to parse Unity Version from ProjectSettings/ProjectVersion.txt. Reason: The specified revision was not found serverpath:/ProjectSettings/ProjectVersion.txt#br:main@roguejester@KBVE@cloud\n\n```\n\n\n\n---\n\n## Integration\n\nServices and concepts that we would like to integrate `RJ` with.\n\n### Steam\n\nThese are the official Steam Tasks\n\n- [ ] Library Capsule\n\nLibrary Capsule \\*600px wide x 900px tall\n\n- `Design`: This should be graphically-centric and give the user some sense of the experience. Please use the key art that is being used for any retail boxes or marketing as well as the name of your game, ideally using the same logo / title as printed on any retail or marketing. Do not include quotes, marketing copy, or other strings of text beyond the title of your application. The art should depict something important about your product. The logo should be easily legible against the background.\n- `Usage`: This image is primarily used in the library overview and collection views\n- `Sizes`: 600px x 900px (an additional half-size 300px x 450px PNG will be auto-generated from larger file)\n\n- [ ] Library Hero\n\nLibrary Hero \\*3840px wide x 1240px tall\nThe hero graphic and logo are layered and move independently when the page is scrolled, creating a subtle parallax effect. Consider how the product logo will be placed on top of the hero image (left bottom corner or centered). You'll want to ensure the logo is both visible and legible against the background.\n\n- `Design`:\n  This should be a visually rich image that is easily recognizable. For best results, please use the key art that is used for any retail boxes or marketing. Do not include quotes or other strings of text.\n\nAt the center of the template is a \"safe area\" of 860px x 380px. This area will remain uncropped across scaling and resizing of the Steam client window. Artwork should extend across the entire template, but critical content should be within the safe area. For ex: a main character's face should be entirely in the safe area or risk being cropped.\n\n- `Usage`:\n  Appears at the top of a user's library details page for this product.\n\n- `Sizes`:\n  3840px x 1240px (an additional half-size 1920px x 620px PNG will be auto-generated from larger file)\n\n- [ ] Library Logo\n\nLibrary Logo \\*1280px wide x 720px tall\n\nAfter upload, you can use the preview tool to select the logo's position. Options include: left bottom corner, centered top, centered middle, and centered bottom.\n\nNote: If a hero graphic and logo are not uploaded, the hero area will display a screenshot from the store, with the application name in text overlaid in the bottom left corner.\n\n- `Design`:\n  For best results, use the logo that is being used for any retail boxes or marketing. You’ll want to ensure the logo is both visible and legible against the hero graphic background, sometimes a drop shadow can help. The PNG image should have a transparent background.\n\n- `Usage`:\n  Appears at the top of a user's library details page for this product, placed on top of the hero graphic.\n\n- `Sizes`:\n  1280px x 720px (an additional half-size 640 x 360px PNG will be auto-generated from larger file) Ensure that the logo extends the full width of the PNG, without extra padding.\n\n- [ ] Placement Tool\n\nThe four green anchor points relate to the four possible positions your logo can be pinned. Bottom-left, top center, mid-center, and bottom-center.\n\nIn most cases, the bottom-left position should be used.\n\nYou may want a centered logo if...\n\nYour logo is symmetrical or close to symmetrical or a logo that's contained in a circle.\nYour background header image has more of the interesting parts on the outside edges and the center has areas of rest.\nYour background header image is symmetrically balanced and positioning the logo in the bottom-left throws the balance off.\nOnce you have determined your logo position, use the blue logo box to size your logo appropriately. The blue box acts as a bounding box for the logo, it will not scale outside this box. The right edge of the blue box determines the maximum proportion the logo will scale to compared to the background hero graphic (this is useful if there is background art you don’t want the logo to overlap.) The top edge of the blue box determines the maximum size the logo will scale to (this is useful if you are finding the logo is too big when the window has been scaled up.)\n\nTypically you can take the top edge and leave it higher than the bounds of the logo. Play around with it and try scaling your window to get a sense for how your logo will adjust as the window scale changes.\n\nOnce you are happy with your logo position, proportion, and scale, hit the save button to commit your changes.\n\n### TODO\n\n- [x] ~Create `Concept` Issue Ticket~\n- [x] ~RogueJester - (init) - Start the initialization of RogueJester~\n- [x] ~Map out the ideas~\n- [x] Update SkyBox\n- [ ] h0lybyte: Integrate the React with Unity\n- [x] Player Level Up System(max level TBD)\n- [x] HP Getting Upgraded on Level\n- [x] Added Currency inside game(killed enemies drop currency)\n- [x] Currency is saved trought out scene\n- [ ] Added + 2 more levels(total levels 4)\n- [x] User Interface all the values are displayed on the screen or in the menu\n- [x] Main Menu (Modern Menu Designed)much more fun to interact with!\n- [x] LoginSceneDesign\n- [x] MainSceneDesign\n- [x] InGameMenu design and functionality\n- [x] Scaling UI in game for all devices\n- [x] Level SelectionScene and Functionality\n- [x] SceneFlow\n- [ ] Enemy Ai Improved\n- [ ] Upgrade System\n- [ ] Boss Fight\n- [ ] When player drops down he doesent die. Game needs to reset.\n- [ ] Mobile Controls movement adopted for android\n- [ ] Re-design Menu(so responsive for more platforms)\n- [ ] Move Gameplay Actions into Button for android usage\n- [ ] Displaying Stats in the game panel (TBD)\n- [ ] Inventory System\n- [ ] When player dies he loses items that he bring with him\n- [ ] Main Menu Inventory(player select what items to bring for the next level)\n- [ ] Inventory data values stored in JSON\n- [ ] New vfx for weapons\n- [ ] InventoryDisplaying in Menu\n\n### Boundary\n\n- h0lybyte: Level3\n- ZaneRage: Everything Else\n\n- Should create a header!\n\n### Theme Song\n\n- [Original Ticket for the Theme Song Idea](https://github.com/KBVE/kbve.com/issues/43)\n\nThe game will have one exclusive theme song, which we will refer to as `Going to Work`\n\nDescribe the music topic\nMusic Theory: \"Going to work\"\n\n00:00 : 00:30 - Intro Lofi Punk\n00:29 - 01:00 - Verse1 from PeacefulFire\n01:00 - 01:25 - Longer Chorus Phuck Work\n01:15 - 01:30 - Verse2 from PeacefulFire\n\nSample [1](https://www.youtube.com/watch?v=Wqb39YhgTgs)\n\nPeacefulFire\n\n```\n#I'm here for the company\n#Not here for the capital\n#Been agitate lately\n#Actually Anti-affable, maybe\n\n```\n\n---\n\n### Journal\n\n- Collective thoughts, concepts and ideas for the RogueJester FPS.\n- Ideas How to Convert 1. System.Text.Json namespace to convert C# objects to JSON and vice-versa.\n- Explained in this [link](https://www.tutorialsteacher.com/articles/convert-object-to-json-in-csharp#:~:text=The.NET%205%20framework%20provides%20the%20built-in%20JsonSerializer%20class,built-in%20JsonSerializer%20class%20that%20converts%20objects%20to%20JSON)\n- Thus, convert the JSON string to class object in C# using the `JsonSerializer.Deserialize () method`.\n\n## Steamworks\n\nI was looking through the notes and they recommend that we use SteaMworks SDK 1.53 aka Release 20.1.0\n\nFrom SteamWorks Github IO [Install](https://steamworks.github.io/installation/#unity-instructions)\n\nThey stated three options, A, B and C. I think we should go with Option A?\n\nOption A: `.unitypackage`\nDownload the .unitypackage from the Releases page on GitHub.\nImport everything into your project\n[Release](https://github.com/rlabrecque/Steamworks.NET/releases)\n\nSo I will grab the unitypackage and then proceed to import it.\n\nI wonder if I will need to apply to the Steam store to get an API key? Hmm.\n\nAs we wait, I will update the pipeline for the Windows build.\n\nSteam Store [Docs](https://partner.steamgames.com/doc/store)\n\nAfter reviewing the scopes that they provide, we are building the `demo` , just need to confirm that with external people.\n\n## Player Global Values\n\nOriginal as of 1.2.x\n\n```c#\nusing System.Collections;\nusing System.Collections.Generic;\nusing Unity.FPS.Game;\nusing UnityEngine;\n\npublic class GlobalValue : MonoBehaviour\n{\n    public static int PickPlayerID {\n        get { return PlayerPrefs.GetInt(\"PickPlayerID\", 0); }\n        set { PlayerPrefs.SetInt(\"PickPlayerID\", value); }\n    }\n\n    public static int SavedCoins\n    {\n        get { return PlayerPrefs.GetInt(\"Coins\", 0); }\n        set\n        {\n            PlayerPrefs.SetInt(\"Coins\", value);\n        }\n    }\n\n    public static float SavedCurrentExp\n    {\n        get { return PlayerPrefs.GetFloat(\"CurrentEXP\", 10); }\n        set\n        {\n            PlayerPrefs.SetFloat(\"CurrentEXP\", value);\n        }\n    }\n\n    public static int PlayerLevel\n    {\n        get { return PlayerPrefs.GetInt(\"PlayerLevel\", 1); }\n        set\n        {\n            PlayerPrefs.SetInt(\"PlayerLevel\", value);\n        }\n    }\n\n    public static float MaxHp\n    {\n        get { return PlayerPrefs.GetFloat(\"PlayerMaxHp\", 100); }\n        set\n        {\n            PlayerPrefs.SetFloat(\"PlayerMaxHp\", value);\n        }\n    }\n\n}\n```\n\nI am thinking we can add these to the PlayerPrefs\n\n```c#\n\n    public static string PlayerName {\n        get {   return PlayerPrefs.GetString(\"PlayerName\", \"Guest\");   }\n        set {   PlayerPrefs.SetString(\"PlayerName\", value);   }\n    }\n\n```\n\nCan you do nested functions?\n\n```c#\n\n    public static string _pN {\n        get { return PlayerName(); }\n        set { PlayerName(); }\n    }\n\n```\n\nI will test case these tonight, when I get a chance to mess around with after the main branch builds.\n\nOkay so I went ahead and added a couple more things to the `GlobalValue.cs` file:\n\nLets start with the PlayerName, PlayerJWT and PlayerEmail\n\n```c#\n    public static string PlayerName {\n        get {   return PlayerPrefs.GetString(\"PlayerName\", \"Guest\");   }\n        set {   PlayerPrefs.SetString(\"PlayerName\", value);   }\n    }\n\n    public static string PlayerJWT {\n        get {   return PlayerPrefs.GetString(\"PlayerJWT\", \"Guest\");   }\n        set {   PlayerPrefs.SetString(\"PlayerJWT\", value);   }\n    }\n\n    public static string PlayerEmail {\n        get {   return PlayerPrefs.GetString(\"PlayerEmail\", \"Guest\");   }\n        set {   PlayerPrefs.SetString(\"PlayerEmail\", value);   }\n    }\n```\n\nSo would we call them like this?\n\n```c#\n\n//1\nGlobalValue.PlayerJWT.Set(\"JWTHere\");\n\n//2\nGlobalValue.PlayerJWT = \"JWTHere\";\n\n//3\nGlobalValue.PlayerJWT.set(\"JWTHere?\");\n\n```\n\nNow I am thinking it might be `//2` based upon what the other references to GlobalValue, so I suppose we could try.\n\nI will also change the `PlayerName`\n\nfunction to PlayerUsername , to keep within the naming flow.\n\nAlso do we need to call PlayerPrefs.Save();\n\n? Does GlobalValue already do that?\n\n## J7\n\nWe decided to remove almost all of the Unity MicroFPS codebase and introduced Opsive controller / inventory system.\n\nThe reason we decided to switch over is because it will speed up development and resolve some of the cosmetic / physics / animation / logic issues that we are currently facing.\n\nI believe majority of this week will be spent on focusing on integrating both Opsive plugins into the game. Thus all of Patch 1.2.x will be towards getting everything for the player done.\n\n## Error inside the GameManager\n\nSo we were working on the pipeline, durning the development hell that is Unity, and ran into a \"Build\" success but a \"Build and Run\" failure.\nWe spent some time re-merging the base, switching branches, thinking it might be a cluster of different issues.\nSilver comes in clutch and finds out that there was a `duplicate on GameManager Prefab Replacer , 2 of the same script on same object`.\n\n## J6\n\n- Had an issue with the basing earlier in the day. We will split the branches further, to avoid conflicts and issues when rebasing / merging branches.\n- When migrating from the public to private repo, there were some issues with `secrets` and CI/CD, these issues are still open and should be resolved this week.\n\n## J5\n\n- 11/15/2022\n- Had an issue with the basing earlier in the day. We will split the branches further, to avoid conflicts and issues when rebasing / merging branches.\n- When migrating from the public to private repo, there were some issues with `secrets` and CI/CD, these issues are still open and should be resolved this week.\n\n## J4\n\n- 11/14/2022\n  - Improving the UI/UX\n  - Expanding Character Stats\n\n## Patch 1.2.x\n\n- 11/13/2022\n  - Start expanding the assets inside the game and work with some core logic.\n\n## Patch 1.1\n\n- 11/12/2022\n  - ZaneRage and h0lybyte did the basics the idea / concept.\n  - New asset models for the 3D robot soldiers.\n  - Added several more assets to the game!\n\n## First Official Entry\n\nWe should make it so that the Unity pulls this information and displays it onto the Menu -> Patch.\n\n### Scene\n\n0. LoginMenu\n1. IntroMenu\n2. WInScene\n3. LoseScene\n4. MainScene\n5. SecondaryScene\n6. LevelSelection\n\n### Assets\n\n- This is a full breakdown of the assets that we are using in RogueJester FPS. We will keep the credits and a semi-active list of all the components that we are using.\n\n#### SkyBox\n\n- SkyBox provides us with a visual background.\n- Asset: [SkyBox Vol 2](https://assetstore.unity.com/packages/2d/textures-materials/sky/skybox-volume-2-nebula-3392)\n  ZaneRage: Adding the Asset\n\n#### Search\n\n- Quick [Search](https://assetstore.unity.com/?category=3d%2Fcharacters%2Frobots&free=true&orderBy=1) on the Unity Assets page for FREE\\* 3D Characters -> Robots\n\n#### 3D Robot Solider\n\n- Official [Link](https://assetstore.unity.com/packages/3d/characters/robots/robot-soldier-142438)\n- ZaneRage: those are soo cool for enemies\n- h0lybyte: Okay, I will grab and commit them for Patch 1.2.x\n\n#### UAV Trident\n\n- Official [Link](https://assetstore.unity.com/packages/3d/vehicles/space/uav-trident-46128)\n\n#### Combat Drone\n\n- Official [Link](https://assetstore.unity.com/packages/3d/low-poly-combat-drone-82234)\n\n#### Spider Orange\n\n- Official [Link](https://assetstore.unity.com/packages/3d/characters/robots/spider-orange-181154)\n\n#### Robot Metallic Humanoid\n\n- Official [Link](https://assetstore.unity.com/packages/3d/characters/robots/robot-metallic-humanoid-171295)\n\n#### Sentry 3D Robot\n\n- Official [Link](https://assetstore.unity.com/packages/3d/characters/robots/sentry-robot-222899)\n\n#### Robot 3D Sphere\n\n- Official [Link](https://assetstore.unity.com/packages/3d/characters/robots/robot-sphere-136226)\n","collection":"project","data":{"id":6,"layout":"../../layouts/theme/mdx.astro","title":"Rogue Jester","client":"Self","publishDate":"2020-03-04T00:00:00.000Z","status":true,"img":"https://images.unsplash.com/photo-1603994236406-bf7f71dc361e?fit=crop&w=1400&h=700&q=75","description":"Rogue Jester is a Rogue-like FPS that we are building to learn more about Unity.","tags":["unity","unity-webgl","gaming","fps","roguejester"]}},{"id":"rsps.mdx","slug":"rsps","body":"\nimport Details from \"@w/Details.astro\";\nimport TabMenu from \"@w/TabMenu.astro\";\nimport TabData from \"@w/TabData.astro\";\nimport N from \"@n/N.astro\";\n\n<TabMenu first=\"general\" data={[\"guides\",\"shop\", \"media\", \"notes\"]}>\n\n<TabData tail=\"block\" data=\"general\">\n\n## RSPS Information\n\nAs a RSPS lover, you may be familiar with bot farming or the use of automated software to play the game for you, without needing to lift a finger.\nSo how does it work? The bot follows a set of instructions or scripts that tell it what to do and how to react to different situations.\nThis means that you can leave your computer running while the bot performs various tasks in the game, such as mining, fishing, combat, or questing with the goal of earning passive gold.\n_But holy, is bot farming worth it?_\nWhat are the risks and benefits of botting?\nAnd how do companies detect and ban bots?\nIn this MDX documentation, we will explore the world of RSPS bot farming and give you some tips and tricks on how to do it safely and effectively.\n\n### Goal\n\nThe ultimate aim or TLDR of this RSPS project is to create a sophisticated bot farm that produces virtual in-game currency, converts it to [crypto assets](https://kbve.com/asset/crypto/), then swaps for [KBVE Community Credits](https://kbve.com/c/) and finally invests in monthly dividend [stocks](https://kbve.com/asset/stock/).\nIt appears rather uncomplicated, don’t ya think?\nBut boy has it been a colossal undertaking, with a hefty initial investment in funds and numerous dreadful blunders in the process.\n\n### Rates\n\nXE, or virtual gold exchange rate, is an estimated rate at which bulk amounts of virtual gold can be exchanged for another.\n\nThe rates below were last updated: 03/2023.\n\n- The base of 1m is 24K to 34K Credits.\n- Ikov up to 20m per 1B.\n- SpawnPk up to 18m per 1T.\n- RuneWild up to 5m per 1B.\n- RoatPkz up to 5m per 100k.\n- Lunite up to 150m per 1B.\n- Xeros up to 15m per 1B.\n- Zaros up to 70m per 1B.\n- Runex up to 3m per 1B.\n- PkHonor up to 1m per 1B.\n\nWe can gladly help automate your gold clearing process at a fee of around 10-20%, contact our support for more information.\n\n### MM\n\nMiddleman services are escrow services that provide an intermediary in a transaction or distribution chain who facilitates interaction between the involved parties.\nThey specialize in performing crucial activities involved in the purchase and sale of goods in their flow from producers to the ultimate buyers.\nFor example, if you want to buy or sell a digital account, you can use a middleman service to ensure that the transaction is safe and secure.\nThe middleman will hold the item or account until the payment is made and then deliver it to the buyer.\nFurthermore, a MM service can perform some generic tasks, such as making sure the account has a clean history, combine offers from different services and help automate certain actions.\nA fee or commission may apply when you use a middleman service to facilitate your transaction and/or contract.\nKBVE (as an escrow/MM) has different fee structures, speak with the support staff to find the daily rate.\n\n---\n\n## Software\n\nThis is a collection of the latest automation software that can be used in a MMRORPG / RSPS farm.\n\n### Operations\n\nThink of the operations as the general op-sec within our farm, including the break down of backing up your bots, automation software, \n\n#### Operational Template\n\nThe operational template will be a proxmox ready template that will allow us to auto-scale deployment, including allowing the usage of Terraform and Ansible; the base of the template will be Windows 11 with Python and Java installed through the Choco package manager.\n\n#### Template Download\n\nIn order to avoid legal issues, we can not offer the template with Windows, so we will have to do the setup done through Powershell. The up-to-date Powershell script will be in our VIP room and hosted in private repo.\n\n#### Template Security\n\nWe recommend that you clone the first template and spin containers using the cloned QEMU virtual machine. As for saving the instance, we recommend that you take a snapshot of the instance once it is ready for production, make sure to include the RAM.\n\n### Client\n\nA botting client is a software that runs the game and executes the scripts that you choose.\nWe included a couple popular ones below, with information / help installing and configuring them!\nOur goal is to create a docker image and/or a kubernetes helm for each of them.\n\n> More information on [Docker](https://kbve.com/application/docker) and [Kubernetes](https://kbve.com/application/kubernetes/)\n\nChoosing the right botting client for your needs can be tricky. \nWhen selecting the right client(s), it is important to take into account aspects like security, performance, reliability, updates, support and script quality.\nYou should also read reviews and feedback from other users before downloading any botting client. \nRemember to always use a VPN or proxy when botting to protect your IP address and avoid detection by Jagex.\n\nAutomation can be fun and rewarding, but it also requires caution and responsibility. \nIf you decide to try it out, make sure you follow the rules and guidelines of the game and the botting client. \nHappy Automating!\n\n#### SCAR\n\n#### Parabot\n\n#### Squire\n\n#### DreamBot\n\n#### RuneMate\n\n---\n\n## Account\n\nThere are a couple types of accounts your project will need, including a couple main(s), mule(s), suci(s) and rando(s).\nThe main account will be the one that you store all your extra gold on, in some cases, we recommend storing bonds over the gold.\n\n### Account Errors\n\nThere will be various account errors that you will run into when operating a large scale account farm, we will try to make it easier for you to understand the common issues that we run into.\n\n#### Too many login attempts\n\nThis can become a common error when playing with a VPN or a high traffic / suspect IP address. There are the [official runescape](https://support.runescape.com/hc/en-gb/articles/360002267798-Too-many-login-attempts-from-your-address) guide for help resolving the problem.\n\n---\n\n## RS\n\nThese are notes on RS specific information, including skills, mini-games and items.\nMinigames are small games within Runescape that have a specific objective and often reward players with items or experience.\nSome minigames are safe, meaning you don’t lose any items if you die, while others are dangerous, meaning you do lose items if you die.\nWhen designing the automation, it is wise to remember that minigames may involve combat, some involve skilling, and others involve both.\n\n---\n\n### Skills\n\nThe primary focus of the game is to level up your skills to level 99.\nSkills are abilities that can be trained by performing various actions related to the skill.\nFor example, you can train your Fishing skill by catching fish, or your Magic skill by casting spells.\nSome skills are free to play, meaning anyone can access them, while others are members only, meaning you need to pay a subscription fee to train, level up or utilize them.\n\n---\n\n#### Combat\n\nFor combat training, we recommend with starting off at level 1 Chickens, level 2 Cows and level 3-10 Goblins, until the character reaches a total combat level of >20.\n\n---\n\n#### Fishing\n\nFishing is a core skill that the accounts have to build, as it provides a fast and cheap form of food, income and total levels. The skill is AFK friendly, allowing multiple instances to train without a risk of death or logging out.\n\n##### Fishing lvl 1 to 20\n\nThe current path for fishing is level 1-20 Shrimps at Draynor and then fly fishing from 20 to 70 at the barbarian village; the village is located west of Varrock and east of Falador, following the main road.\n\n---\n\n#### Cooking\n\n---\n\n## IP\n\nThe `IP address` for each account/session/instance is very important as to avoid chain bans and have a stable networking.\n\n### Proxy\n\n### Mobile\n\nOne of the methods that we will be looking into would be using a mobile provider to help with the obfuscation. There are two ways that you could utilize your mobile data plan, the first would be to download the mobile application (iOS/Android) directly and log in. The second way would be to setup a mobile hotspot and then remotely\n\n### VPN\n\nVPN networks help obfuscate/hide the local IP address, thus allowing you to run multiple accounts on the same server.\n\n#### NordVPN\n\nNordVPN lets you have 6 active sessions on their service for around $14.00 a month.\n\n---\n\n## Tools\n\n### Account Ban\n\nOkay this tool would automatically check our accounts every 12 hours, to see if they were ban?\n\n---\n\n## Notes\n\nThis section will be for note taking and keeping track of anything else that we would want to add into the project. I think we could build an automated system that could grab the accounts and then check if there were any bans?\n\n## Staff\n\nWe could include links to what the staff have done to fight/handle the automation problem. Example of this would be https://www.youtube.com/watch?v=4ELRFROUf64\n\n---\n\n</TabData>\n\n<TabData data=\"guides\">\n\n## Guides\n\n</TabData>\n\n<TabData data=\"shop\">\n\n## Shop\n\n## Account Order\n\nKBVE Account order form is a quick and easy way to place an order through our system. There are a total of 23 skills, with 15 Free To Play/F2P skills and 8 Pay To Play / P2P skills.\n\n### Account Order Format\n\n```javascript\nvar HP = 10;\nvar ATTACK = 1;\nvar STRENGTH = 1;\nvar DEFENSE = 1;\nvar RANGE = 1;\nvar PRAYER = 1;\nvar MAGIC = 1;\nvar RUNECRAFT = 1;\nvar CRAFT = 1;\nvar MINING = 1;\nvar SMITHING = 1;\nvar FISHING = 1;\nvar COOKING = 1;\nvar FIREMAKING = 1;\nvar WOODCUTTING = 1;\n\nvar CONSTRUCTION = 1;\nvar AGILITY = 1;\nvar HERBLORE = 1;\nvar THIEVING = 1;\nvar FLETCH = 1;\nvar SLAYER = 1;\nvar HUNTER = 1;\nvar FARMING = 1;\n```\n\n### Quest Order Format\n\n```javascript\n\n```\n\n</TabData>\n\n<TabData data=\"media\">\n\n## Media\n\n</TabData>\n\n\n---\n<TabData data=\"notes\">\n\n## Notes\n\nThese are the collection of notes for the RSPS MDX Document.\n\n### Log\n\n- [ ] Add unban guide / tutorial.\n- [ ] Add Order button for accounts.\n\n#### Journal\n\n<Details data=\"2023-04-14\">\nUpdating the RSPS MDX to include a bit more information.\n</Details>\n\n### License\n\n</TabData>\n</TabMenu>","collection":"project","data":{"id":7,"layout":"../../layouts/theme/mdx.astro","title":"RSPS","client":"Self","frontpage":true,"publishDate":"2020-03-02T00:00:00.000Z","img":"https://images.unsplash.com/photo-1662072628456-325410cf83dc?fit=crop&w=1400&h=700&q=75","description":"Project RSPS is a cluster of different projects with the objective to make a MMORPG bot farm.","tags":["mmorpg","automation","gaming"]}},{"id":"search-engine.mdx","slug":"search-engine","body":"\n## information\n\nThe search engine project or [/search/](https://kbve.com/search/) was meant to be a small but unique collection of search engines that I could easily utilize!\nI am getting a bit tired of switching amoung GPT-based and data-mine based search engines, i.e going from You's GPT to Google to Bard for searching. \nSo the solution that I am thinking was to create a general but search engine experience at the core and then extend it out with unique features.\nThe premise of this document was to keep a direct source for information related to the project that we could reference and keep up-to-date notes. \n\n\n## GPT\n\nThe GPT \n\n---\n\n## Notes\n\nThese are the notes for the search engine project by KBVE and the community. \n\n### Log\n\n- [X] Fix up CSS for the core search\n- [ ] Remove and restructure the tabs + unique search components. \n\n#### Journal\n\n##### 2023-05-19\n\nWe started to fix up the terrible generic Google CSS and started to overide some of the results. \n\n###### 2023-05-21\n\nMinor tweaks to the mobile and general dark mode of the search engine.\n\n### License\n\nThe license for the search project would be a bit tough because we are using several different search engines and license bases.\nI believe it would be a combination of the MIT and Apache but also copyright license / releases from each of the Engine that we use?\nI suppose this will have to be a future issue once we get a bit more complete and up to date. ","collection":"project","data":{"id":9,"layout":"../../layouts/theme/mdx.astro","title":"Search Engine Project","client":"Self","category":"API","frontpage":true,"status":true,"publishDate":"2023-05-21T00:00:00.000Z","author":"h0lybyte","img":"https://images.unsplash.com/photo-1616469829718-0faf16324280?fit=crop&w=1400&h=700&q=75","description":"Search Engine Project from the KBVE Community!","tags":["design","search","concept"]}}]