{"entry":{"id":"rareicon.mdx","slug":"rareicon","body":"\n## Information\n\nThe general information for the RI aka RareIcon project.\nI will try to update these notes a bit more throughout the day, including a couple sessions of just dedicated time towards this project.\n\n---\n\n## Development\n\nThese are the development notes for RareIcon.com and they are subject to be changed!\n\n### Stack\n\nThis section of the notes will break down the tech-stack that we will be using for RareIcon and the future CDN.\n- [The init template NextJS](https://github.com/ixartz/Next-JS-Landing-Page-Starter-Template)\n\n### CID\n\nThe Continous Integrated Deployment will be through Github Actions via WorkFlows.\n\n### API\n\nThe API for RareIcon is `https://api.rareicon.com` and it is a CNAME to the KBVE Appwrite.\n\n---\n\n## Example\n\nThis section would be for example projects and/or concepts that we can integrate into our project.\nSome of these examples might have some conflict of interests with RareIcon, so we have to be careful not to over extend or over reference.\n\n### Flippa\n\nThese were active websites that were for sale on Flippa and can be seen as a way to evaluate the RareIcon project.\n\n#### Flippa UI UI Marketplace\n\n> What does the business do?\n> This 10-year-old marketplace offers over 6.8K curated UI design templates. It generates revenue by selling individual products and subscription plans.\n\n> How does the business perform?\n> Monthly Profit: $131K\n> Annual Revenue: $2.2M\n> Monthly Page Views: 176.4K\n\n> What do we like?\n> The business has gained a massive amount of recognition on popular designer networks, and acquires most new customers organically, with less than $1K ad spend per month.\n> It counts 99% organic traffic, has an established social media presence and comes complete with a loyal customer base. \n\n---","collection":"project","data":{"id":4,"layout":"../../layouts/theme/mdx.astro","title":"RareIcon","client":"Self","category":"API","frontpage":true,"status":true,"publishDate":"2023-06-15T23:43:00.000Z","date":"6/15/2022","author":"KBVE","img":"https://images.unsplash.com/photo-1522071820081-009f0129c71c?fit=crop&w=1400&h=700&q=75","description":"RareIcon - Marketplace for UX/UI","tags":["business","design","service"]}}}