{"entry":{"id":"rsps.mdx","slug":"rsps","body":"\nimport Details from \"@w/Details.astro\";\nimport TabMenu from \"@w/TabMenu.astro\";\nimport TabData from \"@w/TabData.astro\";\nimport N from \"@n/N.astro\";\n\n<TabMenu first=\"general\" data={[\"guides\",\"shop\", \"media\", \"notes\"]}>\n\n<TabData tail=\"block\" data=\"general\">\n\n## RSPS Information\n\nAs a RSPS lover, you may be familiar with bot farming or the use of automated software to play the game for you, without needing to lift a finger.\nSo how does it work? The bot follows a set of instructions or scripts that tell it what to do and how to react to different situations.\nThis means that you can leave your computer running while the bot performs various tasks in the game, such as mining, fishing, combat, or questing with the goal of earning passive gold.\n_But holy, is bot farming worth it?_\nWhat are the risks and benefits of botting?\nAnd how do companies detect and ban bots?\nIn this MDX documentation, we will explore the world of RSPS bot farming and give you some tips and tricks on how to do it safely and effectively.\n\n### Goal\n\nThe ultimate aim or TLDR of this RSPS project is to create a sophisticated bot farm that produces virtual in-game currency, converts it to [crypto assets](https://kbve.com/asset/crypto/), then swaps for [KBVE Community Credits](https://kbve.com/c/) and finally invests in monthly dividend [stocks](https://kbve.com/asset/stock/).\nIt appears rather uncomplicated, don’t ya think?\nBut boy has it been a colossal undertaking, with a hefty initial investment in funds and numerous dreadful blunders in the process.\n\n### Rates\n\nXE, or virtual gold exchange rate, is an estimated rate at which bulk amounts of virtual gold can be exchanged for another.\n\nThe rates below were last updated: 03/2023.\n\n- The base of 1m is 24K to 34K Credits.\n- Ikov up to 20m per 1B.\n- SpawnPk up to 18m per 1T.\n- RuneWild up to 5m per 1B.\n- RoatPkz up to 5m per 100k.\n- Lunite up to 150m per 1B.\n- Xeros up to 15m per 1B.\n- Zaros up to 70m per 1B.\n- Runex up to 3m per 1B.\n- PkHonor up to 1m per 1B.\n\nWe can gladly help automate your gold clearing process at a fee of around 10-20%, contact our support for more information.\n\n### MM\n\nMiddleman services are escrow services that provide an intermediary in a transaction or distribution chain who facilitates interaction between the involved parties.\nThey specialize in performing crucial activities involved in the purchase and sale of goods in their flow from producers to the ultimate buyers.\nFor example, if you want to buy or sell a digital account, you can use a middleman service to ensure that the transaction is safe and secure.\nThe middleman will hold the item or account until the payment is made and then deliver it to the buyer.\nFurthermore, a MM service can perform some generic tasks, such as making sure the account has a clean history, combine offers from different services and help automate certain actions.\nA fee or commission may apply when you use a middleman service to facilitate your transaction and/or contract.\nKBVE (as an escrow/MM) has different fee structures, speak with the support staff to find the daily rate.\n\n---\n\n## Software\n\nThis is a collection of the latest automation software that can be used in a MMRORPG / RSPS farm.\n\n### Operations\n\nThink of the operations as the general op-sec within our farm, including the break down of backing up your bots, automation software, \n\n#### Operational Template\n\nThe operational template will be a proxmox ready template that will allow us to auto-scale deployment, including allowing the usage of Terraform and Ansible; the base of the template will be Windows 11 with Python and Java installed through the Choco package manager.\n\n#### Template Download\n\nIn order to avoid legal issues, we can not offer the template with Windows, so we will have to do the setup done through Powershell. The up-to-date Powershell script will be in our VIP room and hosted in private repo.\n\n#### Template Security\n\nWe recommend that you clone the first template and spin containers using the cloned QEMU virtual machine. As for saving the instance, we recommend that you take a snapshot of the instance once it is ready for production, make sure to include the RAM.\n\n### Client\n\nA botting client is a software that runs the game and executes the scripts that you choose.\nWe included a couple popular ones below, with information / help installing and configuring them!\nOur goal is to create a docker image and/or a kubernetes helm for each of them.\n\n> More information on [Docker](https://kbve.com/application/docker) and [Kubernetes](https://kbve.com/application/kubernetes/)\n\nChoosing the right botting client for your needs can be tricky. \nWhen selecting the right client(s), it is important to take into account aspects like security, performance, reliability, updates, support and script quality.\nYou should also read reviews and feedback from other users before downloading any botting client. \nRemember to always use a VPN or proxy when botting to protect your IP address and avoid detection by Jagex.\n\nAutomation can be fun and rewarding, but it also requires caution and responsibility. \nIf you decide to try it out, make sure you follow the rules and guidelines of the game and the botting client. \nHappy Automating!\n\n#### SCAR\n\n#### Parabot\n\n#### Squire\n\n#### DreamBot\n\n#### RuneMate\n\n---\n\n## Account\n\nThere are a couple types of accounts your project will need, including a couple main(s), mule(s), suci(s) and rando(s).\nThe main account will be the one that you store all your extra gold on, in some cases, we recommend storing bonds over the gold.\n\n### Account Errors\n\nThere will be various account errors that you will run into when operating a large scale account farm, we will try to make it easier for you to understand the common issues that we run into.\n\n#### Too many login attempts\n\nThis can become a common error when playing with a VPN or a high traffic / suspect IP address. There are the [official runescape](https://support.runescape.com/hc/en-gb/articles/360002267798-Too-many-login-attempts-from-your-address) guide for help resolving the problem.\n\n---\n\n## RS\n\nThese are notes on RS specific information, including skills, mini-games and items.\nMinigames are small games within Runescape that have a specific objective and often reward players with items or experience.\nSome minigames are safe, meaning you don’t lose any items if you die, while others are dangerous, meaning you do lose items if you die.\nWhen designing the automation, it is wise to remember that minigames may involve combat, some involve skilling, and others involve both.\n\n---\n\n### Skills\n\nThe primary focus of the game is to level up your skills to level 99.\nSkills are abilities that can be trained by performing various actions related to the skill.\nFor example, you can train your Fishing skill by catching fish, or your Magic skill by casting spells.\nSome skills are free to play, meaning anyone can access them, while others are members only, meaning you need to pay a subscription fee to train, level up or utilize them.\n\n---\n\n#### Combat\n\nFor combat training, we recommend with starting off at level 1 Chickens, level 2 Cows and level 3-10 Goblins, until the character reaches a total combat level of >20.\n\n---\n\n#### Fishing\n\nFishing is a core skill that the accounts have to build, as it provides a fast and cheap form of food, income and total levels. The skill is AFK friendly, allowing multiple instances to train without a risk of death or logging out.\n\n##### Fishing lvl 1 to 20\n\nThe current path for fishing is level 1-20 Shrimps at Draynor and then fly fishing from 20 to 70 at the barbarian village; the village is located west of Varrock and east of Falador, following the main road.\n\n---\n\n#### Cooking\n\n---\n\n## IP\n\nThe `IP address` for each account/session/instance is very important as to avoid chain bans and have a stable networking.\n\n### Proxy\n\n### Mobile\n\nOne of the methods that we will be looking into would be using a mobile provider to help with the obfuscation. There are two ways that you could utilize your mobile data plan, the first would be to download the mobile application (iOS/Android) directly and log in. The second way would be to setup a mobile hotspot and then remotely\n\n### VPN\n\nVPN networks help obfuscate/hide the local IP address, thus allowing you to run multiple accounts on the same server.\n\n#### NordVPN\n\nNordVPN lets you have 6 active sessions on their service for around $14.00 a month.\n\n---\n\n## Tools\n\n### Account Ban\n\nOkay this tool would automatically check our accounts every 12 hours, to see if they were ban?\n\n---\n\n## Notes\n\nThis section will be for note taking and keeping track of anything else that we would want to add into the project. I think we could build an automated system that could grab the accounts and then check if there were any bans?\n\n## Staff\n\nWe could include links to what the staff have done to fight/handle the automation problem. Example of this would be https://www.youtube.com/watch?v=4ELRFROUf64\n\n---\n\n</TabData>\n\n<TabData data=\"guides\">\n\n## Guides\n\n</TabData>\n\n<TabData data=\"shop\">\n\n## Shop\n\n## Account Order\n\nKBVE Account order form is a quick and easy way to place an order through our system. There are a total of 23 skills, with 15 Free To Play/F2P skills and 8 Pay To Play / P2P skills.\n\n### Account Order Format\n\n```javascript\nvar HP = 10;\nvar ATTACK = 1;\nvar STRENGTH = 1;\nvar DEFENSE = 1;\nvar RANGE = 1;\nvar PRAYER = 1;\nvar MAGIC = 1;\nvar RUNECRAFT = 1;\nvar CRAFT = 1;\nvar MINING = 1;\nvar SMITHING = 1;\nvar FISHING = 1;\nvar COOKING = 1;\nvar FIREMAKING = 1;\nvar WOODCUTTING = 1;\n\nvar CONSTRUCTION = 1;\nvar AGILITY = 1;\nvar HERBLORE = 1;\nvar THIEVING = 1;\nvar FLETCH = 1;\nvar SLAYER = 1;\nvar HUNTER = 1;\nvar FARMING = 1;\n```\n\n### Quest Order Format\n\n```javascript\n\n```\n\n</TabData>\n\n<TabData data=\"media\">\n\n## Media\n\n</TabData>\n\n\n---\n<TabData data=\"notes\">\n\n## Notes\n\nThese are the collection of notes for the RSPS MDX Document.\n\n### Log\n\n- [ ] Add unban guide / tutorial.\n- [ ] Add Order button for accounts.\n\n#### Journal\n\n<Details data=\"2023-04-14\">\nUpdating the RSPS MDX to include a bit more information.\n</Details>\n\n### License\n\n</TabData>\n</TabMenu>","collection":"project","data":{"id":7,"layout":"../../layouts/theme/mdx.astro","title":"RSPS","client":"Self","frontpage":true,"publishDate":"2020-03-02T00:00:00.000Z","img":"https://images.unsplash.com/photo-1662072628456-325410cf83dc?fit=crop&w=1400&h=700&q=75","description":"Project RSPS is a cluster of different projects with the objective to make a MMORPG bot farm.","tags":["mmorpg","automation","gaming"]}}}