{"entry":{"id":"04-28.md","slug":"04-28","body":"\n## Notes\n\n- Currently integrating Svelte into AstroJS, but running into some development problems with Astro v2.3.1? or v2.3.2?. Vite is throwing some errors here and there within the rollUp, so I am currently in the process of debugging that. Afterwards, I aim to integrate AppWrite into Svelte, so that it can execute a bit faster than the current React setup. While React is able to get the basics done, there is a bit of a delay between each action, around ~600ms because it has to communicate with the API (from AppWrites end), I am trying to see if I can resolve that , or at least make it less noticeable via the UX/UI end. One of the aspects I was thinking of was to store the user information locally after login, to have an almost instant load WHILE only having `update` and `delete` require a connection/load.\n- `Something went wrong installing the \"sharp\" module` - Sometimes I hate the sharp module with a passion, I am going to wipe the local installation clean and start fresh from the dev branch. \n- Next issue was that Search via the MDX page was throwing some weird errors and honestly I am a bit too tired to figure out why it was giving a pain. I am assuming its because I forgot something to render or messed up the JSX / react syntax, but to make it easier, I decided to migrate it out of the MDX concept and make it its own .astro page. While I wanted to make it all uniformed via MDX template, certain areas might not be worth the time. Furthermore, I disabled the bing / you searches because they were giving errors of CORS on certain browsers.\n- I would say this is a bit of a major update to the website, as I begin to migrate + add more into the framework.\n- Under search, I expanded the options and included `reddit.com` and `stackoverflow.com`. The results are not within the iframe but instead they open in new a window/tab; I will gladly add more options/parameters down the line, including expanding into images and GPT/LLVM.\n- 8:37pm - It seems that my idea of having a general namespace and then running a custom templating system out of that is just a bit too much. I will go with a more simple widget style and just import the widgets directly, instead of having them all over the place. I just get confused and there just so many options and ways to do things... that it just too much. Sometimes I over-engineer everything and it might not be the best, BUT it was dope to have emoji-style templating, even if it was a complete waste of time, rip 50+ hours I spent lmfao. I did learn and gain so much knowledge from the experience, so it might not have been a total waste.\n- 8:40pm - Just saw a dude on a bike get nailed by a tuktuk / rickshaw, he was okay but was driving in the wrong direction and going a bit too fast. Duck the traffic here in India is insane.\n\n## Quote\n\n> No man is free who is not master of himself.\n> — <cite>Epictetus</cite>\n\n---\n\n## Tasks\n\n- [x] Svelte Integration - Including dev / build / vite rollup test case.\n- [x] Migrating Search to its own independent page.\n- [x] Updating Astro to latest v2.3.1/v2.3.2.","collection":"journal","data":{"title":"Daily Friday : 2023-04-28","description":"Daily Log for 2023-04-28","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680466350960-f06d9950e69f?fit=crop&q=85&w=1400&h=700","date":"2023-04-28T00:00:00.000Z"}}}