{"entry":{"id":"04-30.md","slug":"04-30","body":"\n## Notes\n\n- The material, NiTiTol, from this [Veritasium video](https://www.youtube.com/watch?v=vSNtifE0Z2Q), through me into a deep research/wiki-loop on material engineering this whole morning.\n- Also another cool video, The Galactic Menagerie, Star Wars by Wes Anderson Trailer https://www.youtube.com/watch?v=d-8DT5Q8kzI\n- Going to update the Strapi API to the latest version, v4.10.1 because it seems to address the yarn build bug that was giving me issues the last time that I tried to upgrade/update. \n- 6:00pm - I started the process of updating the API, it was pretty straight forward with upgrading the packages and then deploying the version v4.10.1. There were no major database migrations but I backed up everything to be safe. \n- Next mission is to upgrade AppWrite from 1.3.1 to 1.3.3 , which I am doing right now. There are some issues that I need to address between the AW and Strapi API, including the unique keys/index. The update seem to work out well and the database migration did not throw any issues.\n- 7:00pm - Refactoring the KBVE.com codebase by removing old / dead astro files that are no longer required. This is to help improve performance and to clean up the workspace, so that others can easily navigate through and not have any issues. There are instances where certain files get referenced twice, once via the Namespace and then again directly via import. \n- I have to restructure the name convention and I believe that keeping it extremely basic will be better in the long term. Thus I think it would make sense to use the term, `Widget` , and place all the `Element` / `Action` into that area and the migrate them out again in v2 of KBVE.com. Mapping out each widget seems to be a waste of time right now, as I keep rotating different file names and file types without keeping something straight forward.\n- Another interesting error that I am having is with the email(s) going into spam. The issue is actually not on my end but rather that our advertisement platform, \"Ezoic\", throwing errors ecause it is unable to proxy the CNAME from our email provider, \"SendGrid\". It has been almost two weeks and currently still waiting for them to resolve it. :/\n- Had to grab a quick meal earlier in the day, so I decided to try the local KFC at the InOrbit mall! While I am not a big fan of having fast food, the tandoori chicken was delicious and not too expensive! The legs were not too greasy, chicken was cooked almost near perfectly and the blend of spices were on point! These guys are making a huge mistake not bringing this dish into the US because it would become an instant hit across North America.\n- 11:00pm - I am about to start winding down, going to grab some mineral water and a salt paan before getting ready to sleep. \n## Quote\n\n> Happiness mainly comes from our own attitude, rather than from external factors.\n> — <cite>Dalai Lama</cite>\n\n---\n\n## Tasks\n\n- [x] Strapi Update.\n- [x] Pay Credit Cards.\n- [x] AppWrite Update.","collection":"journal","data":{"title":"Daily Sunday : 2023-04-30","description":"Daily Log for 2023-04-30","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681238339140-7fa1654fb6ad?fit=crop&q=85&w=1400&h=700","date":"2023-04-30T00:00:00.000Z"}}}