{"entry":{"id":"05-08.md","slug":"05-08","body":"\n## Notes\n\n- 9:30am - Dropping by the local Lenskart and asking my uncle to make two quick pair of aviator glasses for @sean and @ziggy9263. I have given this shop close to 20 pairs so far, I am definitely their customer of the month, may even become their customer of the year.  \n- 11:00am - Final visit the dentist to get some quick teeth cleaning! Through all of this, it seems that our dear friend, Fudster put me onto a quick quest. It is always interesting to be drugged up by a dentist and then open a bunch of unix terminals to setup a virtual machine. I enjoyed being in the dentist chair, half baked, typing away linux commands. If this was in the US, I am pretty sure the dentist would have violated several ethical boundaries for what I was doing haha.\n- 12:30pm - Going to look over the current backend setup and see what needs to be updated. Overall the system looks healthy with no massive errors in any area. The main operating systems are still up to date, I looked over the unattended update logs and everything seems fine on that end. \n- 5:00pm - Looking at tiles for remodeling the home and bathroom in India! It was interesting to see that electronic upgrades are more costly than doing general service to the house. I suppose it makes sense because labor costs in India are extremely cheap, as there is a large pool of workers. Yet the tech market within India is extremely inflated and it comes mainly from the excessive tariffs that are imposed on imports. \n- 7:00pm - I think its time for me start researching into VCs/Venture again, just going to do some core / basic data gathering. I realized that I could add up to a million contacts onto the HubSpot CRM, so I am going to go through my older emails and reach out to some VC funds and build up an initial cold list. There are two main issues within the VC field that I am seeing, the first is the insane amount of capital going into machine learning / A.I-based startups and the second issue is that the rising interest rates is squeezing and limiting the general funds that they are willing to risk / invest. In addition to the rising rates, the recent bank collapses have also decreased the amount of risk that funds are willing to take.\n- 7:30pm - Going to start a developer environment with a new hybrid cloud setup. I was looking at some of the recent changes with vCluster and I think its right about the best time to do a couple edge test cases from scratch. There will be two phases for this, the first will be doing everything manually and keeping track of the scripts, configurations, ect.. and the second phase will be to use Ansible-Tower to automate the deployment of the whole setup. I do not expect any of this to be successful but I am down to see where I hit failure, last time it was with the storage.\n\n## Quote\n\n> Courage is what it takes to stand up and speak; courage is also what it takes to sit down and listen.\n> — <cite>Winston Churchill</cite>\n\n---\n\n## Tasks\n\n- [x] Finalize materials for the house.\n- [x] Migrate rupees from bank balance to fix deposits.","collection":"journal","data":{"title":"Daily Monday : 2023-05-08","description":"Daily Log for 2023-05-08","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1664202526602-08cbc96c4b3c?fit=crop&q=85&w=1400&h=700","date":"2023-05-08T00:00:00.000Z"}}}