{"entry":{"id":"05-04.md","slug":"05-04","body":"\n## Notes\n\n- 12:00pm - Review the notes on the iOS / Flutter. I will have to transfer them over to this knowledge bank later this week. There are two core pillars that I have to make sure that I get right for deploying future iOS applications. The first will be getting flutter to actually build and sign the application, so for that I will run `flutter doctor -v` and see what it requires for the iOS / iPhone build. It seems that I will need xCode and CocaPods, it was pretty straight forward for getting the xCode, as I was able to grab it from app store.\n- The CocaPods aka a Swift package manager that Flutter uses for iOS development was easy to install, just had to run `sudo gem install cocoapods` and then agree to the xCode license.\n- The next pillar is the development and pipeline, currently I am able to build the iOS application within the development eco-system. However I will have to figure out how to setup the CI/CD for the application, ideally making it so that once the commit is made on the `main` branch, it will automatically deploy the application to the Apple App store.\n- 3:00pm - Going to prepare to pack up my luggage! It seems that my grandparents have some older suitcases, so I am thinking of letting them have mine, while I go grab some new ones. I am going to travel to either the `CromAs` or `InOrbit` mall and pickup two new suitcases. The total cost was around 15000 Rupees and they were pretty solid hardshell cases, they look and feel like a CSGO crate haha.\n- \n\n## Quote\n\n> If you want your life to be more rewarding, you have to change the way you think.\n> — <cite>Oprah Winfrey</cite>\n\n---\n\n## Tasks\n\n- [x] Install and update xCode / CocoPods.","collection":"journal","data":{"title":"Daily Thursday : 2023-05-04","description":"Daily Log for 2023-05-04","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1661948746536-14df44b0ad43?fit=crop&q=85&w=1400&h=700","date":"2023-05-04T00:00:00.000Z"}}}