{"entry":{"id":"05-15.md","slug":"05-15","body":"\n## Notes\n\n- 10:00am - Ah! I was assigned to a put call over the weekend and did not realize that I was forced to purchase SPY for $415.00 a share. There might have been in a mistake in the automated hedgefund or a bug because of the timezone change since I came back from India. This means that I will have to go back and go through the codebase to see where I made the mistake. I believe that I might have hardcoded the timezone change, rather than making it a function. I suppose one of the solutions would be to grab the program's IP address, figure out the location from that information and then convert the said location to the right timezone. In addition, have a default config variable for the timezone where the application is running, incase it is under a VPN. \n- 12:00pm - Sent most of the morning doing basic chores and fixing up the MDX files. I think we also spent a couple hours playing a bit too much league but the binge of One Piece totally made up for everything. Luffy is da King!\n- 2:00pm - One of the issues that I been having was figuring out how to handle the UX/UI for the MDX entry files. \n- 4:00pm - Finally got the Obsidian package to work on Windows again. It seems that I have not opened the application in such a long time that the whole vault crashes during the cache period. The solution to the problem was to create a secondary vault, next close the broken cache* vault, then delete the broken cache* vault and finally create a new vault from the location of the broken cache*. I am not too sure if this is a common bug to address, but if it happens again then I guess I will have to make a tutorial about it.\n- 5:00pm - Going through the `Manga` notes right now and there are some issues that I already see on rendering them within Flutter and Astro. Going forward I might have to combine the md and mdx files, however it feels so backwards to do so.\n\n## Quote\n\n> Once we accept our limits, we go beyond them.\n> — <cite>Albert Einstein</cite>\n\n---\n\n## Tasks\n\n- [x] Sync Obsidian on Windows with the Github Vault.\n- [x] Improve the UX/UI on the MDX files that are being rendered by Astro.","collection":"journal","data":{"title":"Daily Monday : 2023-05-15","description":"Daily Log for 2023-05-15","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681511854055-edcb84a3e21d?fit=crop&q=85&w=1400&h=700","date":"2023-05-15T00:00:00.000Z"}}}