{"entry":{"id":"05-19.md","slug":"05-19","body":"\n## Notes\n\n- 9:00am - Woke up to a great day for a non-rebecca Friday! Going to clean up the car and do some generic house work for most of the day.\n- 11:00am - Going to do a deep dive into the `MINA Protocol` and see what the hype is around it. In between the research, I will look further into the CSS for the search on KBVE. \n- 4:00pm - Okay, I will break down the search into two areas with the first being the generic CSS flow and the 2nd being the additional variables that help us switch between `Dark` and `Light` mode through TailWindCSS. We were able to override the default CSS that google provided using the `@important` in our `gsc-control.css` but we were not able to extend it out into the advertisement area of the Google search results because those adverts are rendered through an `iframe`. Furthermore, we were able to use the `var(--color-primary)` and a couple other variables as a replacement for some of the key CSS classes. By using the variables, we can then use the light/dark mode feature to switch the theme without having too much of an issue. The initial route we were going to take was to just find hex colors that would suit both themes, but this ended up being the better result. \n- 7:00pm - Now for the `MINA` aspect, I am still looking through all their source / codebase but I found their ability to keep the blockchain at 22KB to be brilliant but I still did not understand how they were able to do so. I get the concept but the core fundamentals are a bit tricky for me right now, I might need to print it out, hike onto a mountain, puff some snoop and read through it all within the calmness of nature. \n\n## Quote\n\n> Whenever you have eliminated the impossible, whatever remains, however improbable, must be the truth.\n> — <cite>Arthur Conan Doyle</cite>\n\n---\n\n## Tasks\n\n- [x] Fix the CSS for Search","collection":"journal","data":{"title":"Daily Friday : 2023-05-19","description":"Daily Log for 2023-05-19","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683782852452-a97468c83617?fit=crop&q=85&w=1400&h=700","date":"2023-05-19T00:00:00.000Z"}}}