{"entry":{"id":"05-28.md","slug":"05-28","body":"\n## Notes\n\n- 9:00am - Organizing my personal kanban will be the main goal for the day. I am a bit sad that I wasted so much time not updating and keeping it organizing. I might have to set aside around 15mins a day moving forward to maintain the board or it will fall into a huge mess!\n- 11:00am - I set aside a couple main goals for this week, I am thinking of making sure that I expand the tool library on KBVE, with the goal of having over 100+ tools within the next 3 years. After around 20-30 tools, I will go back and organize the tool page to be a bit more straight forward, including categories for developers, webmasters, gamers and memers.\n- 1:00pm - Expanded the Coolify and Portainer storage on the main dedicated server because we were running out of space, I am so grateful for the [LVM](https://kbve.com/application/lvm) notes for reminding me how easy it is. The next step might be to create an ansible script that will automatically check the file size for each instance and then make a judgement call to expand the storage. \n- 8:00pm - Listening to Fudster is exactly like injecting cancer cells into my brain. The more you listen, the faster the stages evolve. \n- 9:00pm - Finally got the shiv updated and I have all of the puppeteer running under an asynchronous factory. Now I am going to add JWT authentication and then we should be good to go with building out a basic SaaS-style tool! I will initially make the tool free for users and then add a credit system later down the line. The balance of free tools and paid advance usage will be an art form of human behavior. \n\n## Quote\n\n> Laughter is not at all a bad beginning for a friendship, and it is far the best ending for one.\n> — <cite>Oscar Wilde</cite>\n\n---\n\n## Tasks\n\n- [x] Update the storage on production containers\n- [x] Improve the City Vote Scrapper","collection":"journal","data":{"title":"May : 28","description":"Daily Log for May, 28 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682083682866-a2f99abea268?fit=crop&q=85&w=1400&h=700","date":"2023-05-28T00:00:00.000Z"}}}