{"entry":{"id":"05-21.md","slug":"05-21","body":"\n## Notes\n\n- 1:00pm - I woke up late today :C\n- 1:30pm - After getting my thoughts and mind ready, I hoped onto fixing up the CSS a bit more for the search. I was able to grab the Iframe but have yet to apply the custom CSS into that frame but from my understanding that I will not be able to do it because of security issues, i.e the external server is a different domain (since its on Google.com) and the results are on KBVE.com, which would mean cross origin errors. The only other solution I could think of was to just replace the whole search engine when switching from dark / light mode? We could do that within the Search.jsx file and by checking the localStorage for the current skin settings. This might be the only optimal path or finding a color scheme that would match both the dark and light mode theme. I do like the idea of not having the ads blend too much into the search content, but rather make it known that these X ,Y and Zed results are a form of Advertisement. As for the usage of the engine? We are already hitting around 100-200 pageviews/searches per day as of right now but I am sure as we add more features and concepts, it could grow into something a bit more unique for a certain type of people. One of the extensions within the search that I been looking into was trying to remove the bias weights that google assigns to each user when conducting a search. The goal of that concept was to aim at having similar results across different accounts within the same region. \n- 2:50pm - Need to prepare myself to do some lawn care, so I think it be wise to take a quick break from the general flow of programming and get some generic exercise. I might even wash the cars really quick too, damn I am starting to get those `father` vibes, next thing I know, I will be complaining more about my old age. I low key still want to be a crazy old grandpa, yelling at random people, it is truly my meme spirit animal.\n- 3:00pm - The integration of GPT based search engines would be great but I am bit lost on how I should do it from both the backend and the frontend. I think the best approach would be to slowly add a couple generic GPT engines from 3rd parties as the backend before focusing on our own version. At the same time, we could then look at the UX/UI from the front end?\n\n## Quote\n\n> Let the future tell the truth and evaluate each one according to his work and accomplishments. The present is theirs; the future, for which I have really worked, is mine.\n> — <cite>Nikola Tesla</cite>\n\n---\n\n## Tasks\n\n- [ ] Minor tweaks to the CSS.","collection":"journal","data":{"title":"Daily Sunday : 2023-05-21","description":"Daily Log for 2023-05-21","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681027104552-a45dc1cbe616?fit=crop&q=85&w=1400&h=700","date":"2023-05-21T00:00:00.000Z"}}}