{"entry":{"id":"05-22.md","slug":"05-22","body":"\n## Notes\n\n- 9:00am - Getting ready for the markets to open and going to sell some weekly calls. I am currently looking to get rid of my [$SPY](https://kbve.com/stock/spy) at $415 and a couple hundred TSLA for around $200 this week. The premium for it all was around $1000 that I will collect for this trade, which I do not need right now, so I am going to put them all into $O, which ended up being around 16 shares. Those 16 shares will now make about $4.08? a month in dividends and if I include the cover on the $[O](https://kbve.com/stock/o) shares, then its closer to around $4.25 a month. My goal for this year is to get $O to make around $1000 a month in dividends, afterwards I will try to get $[STAG](https://kbve.com/stock/stag) past $1000 a month in dividends. \n- 11:00am - I am currently rebuilding the [Portainer](https://kbve.com/application/portainer/) eco-system and having all my laptops and desktops connected to its edge system. The goal will then be to deploy web scrappers onto those edge containers as a test case.\n- 12:00pm - I had to rewrite the City Vote scrapper a couple times to get the hang of constructors, specifically those that operate within the scope of A sync inside of JavaScript. I am a bit rough in the Nodejs department, so I think its time to do some practices.\n- 4:00pm - Looks like my $SPY are going to get assigned today for $415 a share, which is fine because I will then write a $415 put and collect another premium tomorrow.\n- 5:00pm - My docker eco-system on Windows has been running issues after a recent update and it seems to be because I also had rancher desktop installed. The rancher desktop had changed my default WSL settings to its own ubuntu instance, which had caused issues when docker was looking for its own instance. The solution was to remove rancher and all instances of WSL, then re-install [docker](https://kbve.com/application/docker) again.\n- 6:00pm - It looks like coolify does not automatically deploy the newest updates, thus I will have to find a way to setup an automated deployment or see if there is a custom plugin out there that could do it for me. \n- 9:00pm - Taking a break, playing some league and watching Barry! The final season of the show is amazing, the plot thickens and overall its been an amazing show. NoNo Hank has been absolutely brilliant!\n\n## Quote\n\n> Think as a wise man but communicate in the language of the people.\n> — <cite>William Butler Yeats</cite>\n\n---\n\n## Tasks\n\n- [x] Updating Portainer Eco-System\n- [x] Capital Refactoring for Q4 2023","collection":"journal","data":{"title":"Daily Monday : 2023-05-22","description":"Daily Log for 2023-05-22","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683450393696-e6f9e8bd785f?fit=crop&q=85&w=1400&h=700","date":"2023-05-23T00:00:00.000Z"}}}