{"entry":{"id":"06-08.md","slug":"06-08","body":"\n## Notes\n\n- 8:00am - No morning work out today, I feel a bit tired and burnt out from the vast amount of smoke coming from the wild fire. I made the terrible mistake of leaving my windows open with a cross breeze and slowly my room has the faint smell of BBQ! The whole situation with their wildfire seems to be intense, these type of situations remind me to be grateful for what we have and have to understand that we could loose it all within a blink of an eye.\n- 11:00am - Coffee and mocha whey are the best combination. The combination of the protein and the caffeine make holy a proud boy. WAIT! That might have came out wrong....  \n- 12:30pm - Going to clean up my room and re-organize some of the electronics. I think its time to take a break from software development and go deep into some hardware development. I am going to spend a couple hours looking into setting up a dev board and a small raspberry p, with the hopes to setup a fast enough cloud function to invoke it. I could rebuild a small car with camera and then let the cloud functions control the application? The only downside that I could see with the car would be the charging, as I would run into issues with the battery draining too fast. \n- 4:00pm - Hope that TSLA does not stay above $230 a share or I will have to perform some spicy memes magic to get over that bump. The price point per share seems to be a bit too much for my type of budget but we shall see as the markets have been eating up all the good news. War? Inflation? Memes? We shall see tomorrow how far the rally will go!\n- 4:15pm - Going to grab some more coffee, caffeine and switch over to some programming!\n- 5:20pm - Okay we got some feedback on the conch shell, there are a couple things we could do to improve it, including adding a button that is an action to `ask` the shell, incase they can not click the shell itself. \n- 5:39pm - Watching Ziggy play shadow of the colossus gave me some old school flash backs! This was such an amazing game back in the day, definitely up there with Zelda, at least for my childhood memories.\n- 6:00pm - Okay I really need to play some music and the fact that I can not find a solid music bot that plays YouTube videos is getting a bit annoying. So it might be time for me to build one really quick to get the job done!\n- 6:30pm - Updated Appwrite to the latest version 1.3.7 and did a basic migration to make sure that everything is okay.\n- 8:00pm - Time to fork over this music bot written in Go and quickly spin up a YT ready bot for Discord. \n- 11:59pm - EoD - Will push some tasks out for tomorrow, learning the different Go aspects was cool but will just end up using Python.\n## Quote\n\n> Imagination is more important than knowledge. For while knowledge defines all we currently know and understand, imagination points to all we might yet discover and create.\n> — <cite>Albert Einstein</cite>\n\n---\n\n## Tasks\n\n- [x] Assemble Mock IoT.\n- [x] Clean up the electrical components.\n- [x] Music Bot to Play YT videos through Discord.\n- [x] Unity Async Loader. Pushed for tomorrow.\n- [x] React Form Update. Pushed for tomorrow.\n- [x] Unity Login Migration. Pushed for tomorrow.","collection":"journal","data":{"title":"June : 08","description":"Daily Log for June, 08 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1685334467005-ccd47b955315?fit=crop&q=85&w=1400&h=700","date":"2023-06-08T00:00:00.000Z"}}}