{"entry":{"id":"06-07.md","slug":"06-07","body":"\n## Notes\n\n- 8:00am - The blueberries are slowly coming out! I currently have a couple plants but I am excited to see them survive through the winter and can not wait to have even more in the future. My plan might be to turn all the edges into blueberry and blackberry bushes but getting the right plant genetics is still a bit out of my scope. Maybe I could ask GPT?\n- 11:00am - Before getting back into the deep end of programming, I need to do my monthly budgeting and balance sheet. By staying with India for almost two months, I was able to save over a couple thousand dollars! Furthermore, the general market value for all my portfolios have increased across the board, it seems some have made intense gains after recovering. I am looking at those $NVDA shares and I think it might be a good time to exit my position for a while. \n- 2:00pm - I am almost ready to pull the trigger on replacing the lottie files on the website with rive! There were a couple of areas that I wanted to read further into but having that cute bear animation for my login form is a definite must! I am not too sure how I feel about going from an open source animation library to something that feels a bit closed off. I might actually just keep both and refine them into a larger library. `Library/Animation/` and then add `Lottie.astro` and `Rive.astro` as the core astro files that I should call.\n- 11:00pm - Currently extending out my grandpa's visa for India. I have not yet uploaded a couple days worth of Journals, I will make sure to update them tonight before I go to sleep. The documents searching has taken already a hour or more, I am a bit stressed out in data fetching, going deep into the depths of my storage.\n- 11:30pm - The information that India requires for extending out the visa is a bit intense, I can not wait for my grandpa to get his OCI finished, because this is definitely a huge waste of time and resources.\n- 11:45pm - I should sync all the notes on my macbook as the battery is slowly dying off, its been on for over 30 hours!\n- 11:55pm - Future information regarding the extension of the VISA in India, you will need the proof of visa, passport-size photo, scan documents of passport, proof of residence and the reason for extending the stay. In this situation, I am extending my grandpa's visa because he recently got some medical work done and is not really suited for travel yet. In my request for the extension, I included the most recent medical report and a couple professional-style letters requesting for an extension, including one from a doctor here in the US and a doctor that is from a popular local hospital in India. I figured if I could reference enough people and have a surplus of documents, they would have a bit harder time declining his extension. The goal would be to do this while getting his OCI resolved, so that we will never have to do this visa meme stuff again. \n\n## Quote\n\n> In all chaos there is a cosmos, in all disorder a secret order.\n> — <cite>Carl Jung</cite>\n\n---\n\n## Tasks\n\n- [x] Finish Balance Sheet for June and July 2023.\n- [x] Finish Grandpa's VISA extension.","collection":"journal","data":{"title":"June : 07","description":"Daily Log for June, 07 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684770683649-9b2d74fa5554?fit=crop&q=85&w=1400&h=700","date":"2023-06-07T00:00:00.000Z"}}}