{"entry":{"id":"06-04.md","slug":"06-04","body":"\n## Notes\n\n- 8:00am - This morning the main focus was updating and cleaning up the Tibi repo so that I could run commands directly from the robot and have it output the answers. A couple of problems during this stage were that the SDK for the robot was a bit outdated and the software on the robot was also a bit too old. I am thinking the better solution would be to see if I could build a web application that took in voice commands, instead of having to build something through java. \n- 11:00am - Looking at getting quick quotes to fix my rear windshield for my Tesla, but it seems that most companies near me refuse to handle window damage for the car. I had to email Tesla to get a quote and they take forever to give me a date! I suppose I am just ranting about a truly first world problem but damn it is a shame how terrible their service can be.\n- 4:00pm - We will be having our first RJ meeting since the the half a year break from active development. There has not been any major plans for the meeting, but rather a general gathering to build out the scope.\n- 9:00pm - Looking at the current storage solutions for the resume. I am thinking that I might try deepMaps from Nanostores but it seems that there are some issues with using the store within react. I will create the variable of `resumeMeta` inside of the resume.ts file and see if we can call it from there. I am going to test case the useStore with the deepMap tomorrow, hopefully I do not run into any crazy issues.\n- 11:00pm? Late - Updating my internal notes for Portainer and removing Rancher from most of my development eco-system. While the application, Rancher, was great at helping me resolve some of my storage issues, it seems that I will not be using them in production, as they seem to be causing conflicts with Portainer and Docker Swarm. Furthermore, even in the Development cycle, it seems to mess up my WSL settings. It seems that the extra headache of getting them to work is not worth the effort.\n\n## Quote\n\n> Never mistake activity for achievement.\n> — <cite>John Wooden</cite>\n\n---\n\n## Tasks\n\n- [X] - Migration of Conch Widget to KBVE.com Repo.\n- [X] - Update CV with Data/Storage. - This will be pushed forward tomorrow.","collection":"journal","data":{"title":"June : 04","description":"Daily Log for June, 04 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684134219110-6d18efc08205?fit=crop&q=85&w=1400&h=700","date":"2023-06-04T00:00:00.000Z"}}}