{"entry":{"id":"06-12.md","slug":"06-12","body":"\n## Notes\n\n### 2023\n- 11:00am - Waiting to transfer out a couple hundred grand from the recent sale of tesla stocks. I ended up exiting 600 shares and plan to transfer the move to another brokerage. \n- 5:00pm - It seems that my grandpa's visa for India has some issues, so I shall try and resolve the issue as fast as I can. The documents requested are as following:\n\t- Medical Certificate\n\t- Request Letter\n\t- Undertaking Letter\n\t- Travel Document\n\t- Certificate\n\t- Minor Document\n\t- Visa\n\t- Others*\n- 5:45pm - I should further breakdown the different components but there are some additional steps that need to be done.\n\t- `Photo and Document(s) upload are mandatory`.\n\t\t- There are a couple file formats that they support, it seems to be mainly PDF and JPEG.\n\t- `Applicant must upload the photo before proceeding for appointment. `\n\t\t- We will schedule the appoint within the city of Vadodara\n\t- `Size of PDF document must be less than 200KB`\n\t- `Photo Requirements:` which extends into `Format - JPEG, Size: Minimum 10 KB and Maximum 1 MB.` They go further into detail about how the photo should be a passport photo with a  `white background` with no cropping / shadows.\n- 5:55pm - Quickly made a salad before I start to dive deeper into the full requirements. I will start with the `Medical Certificate`, which we already have, its in PDF format and is a total collection of all my grandpa's recent hospital checkups and doctor feedback. I think this collection should be enough under this requirement. \n- 6:00pm - Next, I will tackle both of the letters, `Request` and `Undertaking`, by quickly looking up examples from the Internet. It is a shame that the Reddit blackouts are making it a bit more painful to search through, I had to resort to looking at the cache / older screenshots, but I suppose that means their protest method is definitely working. I was able to find this amazing website, [Indian E Visa](https://indiaevisas.org/indian-visa-extension-online-application/) that provides the perfect set of examples and samples to help navigate through this process. \n- 6:15pm - Example of the Undertaking letter that I written:\n\t- `**I, Mr. Holy Byte, grandson of, Mr. Grandpa Byte, want to inform you about my grandfather holding passport No: 420696969. I am taking full responsibility for my father while he is recovering in India because of his current medical status. Thus, I am requesting immigration of India to approve his Indian entry tourist visa for 6 months.**`\n\t- I kept it straight forward and simple for now, as I do not think this will require much information/detail.\n- 6:30pm - Next requirement was the `Travel Document`, which might be a bit confusing for me. I am under the impression that it is the Passport and/or plane ticket. I will email one of the tourist companies that I know and see what they say. Maybe it might be under the Form C? I guess I will have to look further into that area as well, I filled out this form earlier last week but I will do it again just to be safe.\n- 6:40pm - Following that requirement is the Certificate, which I am going to assume falls under the Medical request / documents, in our situation, thus I will skip this as well as the minor document request. Finally the last remaining seems to be Visa and Others, thus it might be best to include any additional documents that I have within that relation. The specific office that we would be reporting to is the FRRO Ahmedabad, which is located `- Barrack No. 2, First Floor, Govt. Polytechnic Campus, Ambawadi, Ahmedabad,Gujarat-380015`. I never thought I would have to tell someone to visit a barrack within the polytechnic campus in real life but here we are.\n- 9:50pm - Added an additional undertaking letter from my uncle. Hopefully these are enough documents to get this process going. I already emailed the Embassy and reached out to a local tourism agency for further support. \n- 10:00pm - I forgot that someone, *cough*, made a script that automatically enters into class action lawsuits. Anyhow, that script is still running and someone may have gotten a recent check from that script. that person should make it into a weird side project / script for the future reference. Regardless there was a check from the `Celsius Class Action Settlement` and it was for an amazing total of $0.94! WoW!\n- 10:25pm - The new windows server is up and running but there are a couple issues that I am already running into. The first being that docker is extremely slow and I am not too sure why! I really do not want to spend the time to figure out, it might be something to do with the drivers but the amount of time that I would have to spend is starting to look a bit tiring. Damn I am getting old.\n## Quote\n\n> In the end we retain from our studies only that which we practically apply.\n> — <cite>Johann Wolfgang von Goethe</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"June : 12","description":"Daily Log for June, 12 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1685985081360-1d6021f77bc7?fit=crop&q=85&w=1400&h=700","date":"2023-06-12T00:00:00.000Z"}}}