{"entry":{"id":"06-20.md","slug":"06-20","body":"\n## Notes\n\n### 2023\n- 11:00am - Woke up a bit late today! :C\n- 2:50pm - Getting ready to open up my midgame office hours! I started to update some of the unity projects and just did my first plastic merge. It was a bit scary, as I hate when I accidently do a rebase or something terrible lol. There were a couple issues that I ran into when merging the main branch into my dev branch. I believe I should have went the other direction but in the future we want to make sure that the main branch is functional before we put any changes onto it. We should also limit the off branch changes to a couple days, so that we are not stuck in a huge problem where the branch forks are really offset. \n- 4:20pm - Making quick plans for dinner! The craving for El Portal is real, I am dreaming about the Mexican restaurant! If you are ever in North Jersey, this is one of the best places to grab food, even if you are vegan. \n- 4:30pm - Updated Gena but it looks like the Unity main branch has a couple broken files. The HealthManager seems to be causing the project to load into Safe Mode. I will take a day break from Unity and switch back over to the main website, I am opening up the Postboy and Manga side projects for the website. I also noticed that the webmaster tools needs to be updated. The best option that I am seeing right now might be to just convert the older code base into the general tailwindcss and then migrate the typewriter effect into the react library, where I can reference it from there.\n\n## Quote\n\n> If I know what love is, it is because of you.\n> — <cite>Hermann Hesse</cite>\n\n---\n\n## Tasks\n\n- [x] Update Taxes, including the Annual Forms.\n- [ ] Start Mother-in-Law Construction Research\n- [ ] Start Living Trust Research","collection":"journal","data":{"title":"June : 20","description":"Daily Log for June, 20 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1685052386750-902a081b99da?fit=crop&q=85&w=1400&h=700","date":"2023-06-20T00:00:00.000Z"}}}