{"entry":{"id":"08-10.md","slug":"08-10","body":"\n## Notes\n\n- 4:30am - The premarket is looking rough but I am going to get ready this early morning to do some general checks around the house .\n- 5:15am - I need to look over my current workout, my body is not getting sore and I think that is because my workouts are too isolated and are not yet pushing it to the limits. I should add on more reps and maybe go till failure more often.\n- 6:05am - Morning trip to get some breakfast! Today will be a great day, the air is filled with peaceful vibes.\n- 9:00am - I am doing a bit of whiteboard style mapping for the Supabase migration, I call this part of my tri-force structure, with that being said, I still need to update the public Strapi docker image and maybe migrate the name to something along the lines of a Logging API or something within that nature? Our holy trinity stack is Strapi, Appwrite and Supabase for now! This feels like a bit overkill within certain scopes but I have isolated each of the elements to be more specific to their purpose. We will be using Supabase as the core authentication for the user management, Strapi to handle the log system and general moderation and finally Appwrite to handle all our edge functions and their abstractions. While Supabase does provide some unique instances of edge functions, definitely within the AI eco-system, I found that having complete control over that eco-system to be a bit more impactful and allows a bit more freedom when building out those micro-services.\n- 3:00pm - Lunch time! Break time. I am going to make myself some quick and dirty ramen. I definitely should add more veggies into my diet doe. \n- 6:15pm - I should migrate over the next patch for development, as well as avoid any larger pushes that might hurt the base. \n- 7:00pm - To stay on schedule, I will push through this daily patch and wrap up some of the storage mechanisms that I wanted to deploy. \n- 8:19pm - Started the Login setup for Supabase! I decided that I would try to build it out in Svelte instead of React, just to see how it would work out!\n\n## Quote\n\n> You have to believe in yourself.\n> — <cite>Sun Tzu</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"August : 10","description":"Daily Log for August, 10 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1689708946189-97ff3112df3a?fit=crop&q=85&w=1400&h=700","date":"2023-08-10T00:00:00.000Z"}}}