{"entry":{"id":"09-02.md","slug":"09-02","body":"\n## Notes\n### 2023\n- 5:30am - Spinned up an instance of Weaviate sandbox! Lets goo! We will use this instance to test case any of the issues that we might have with batching on weaviate and then migrate over to any additional concepts that we could use. \n- 6:38am - I need to send out a couple text messages and plan out my morning the best way possible. I sure want to grab some breakfast but I also want to make sure that I get all the parts for Charles and have it operational by the end of the day. We could split up the hard drives for the project ahead of time, maybe place the operating system on a completely different mount / drive and then use another SSD for machine learning operations?\n- 7:11am - Let me sync the repo and this patch with the main website! This way I am all caught up on my different laptops and phones.\n- 10:15am - Getting ready to pickup the parts for Charles! I believe I have some spare parts that I can integrated into this special PC!\n- 2:15pm - Okay this pc structure was a bit more than what I was expecting to build, there are a couple parts that I was not too sure that I would understand, even putting together the heatsink was a bit extra.\n- 5:45pm - Taking a bit of break from setting up the PC and chilling out.\n- 10:15pm - Going to get some sleep and prepare for tomorrow morning, tonight was interesting, definitely the multiple trips to the electronic store, definitely was not what I was expecting. \n\n## Quote\n\n> Sometimes your joy is the source of your smile, but sometimes your smile can be the source of your joy.\n> — <cite>Thích Nhất Hạnh</cite>\n\n---\n\n## Tasks\n\n- [x] - Gather parts for Charles.\n- [x] - Research the assembly of Charles.","collection":"journal","data":{"title":"September : 02","description":"Daily Log for September, 02 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1692806511236-a142a098ec9e?fit=crop&q=85&w=1400&h=700","date":"2023-09-02T00:00:00.000Z"}}}