{"entry":{"id":"09-08.md","slug":"09-08","body":"\n## Notes\n### 2023\n- 6:03am - Currently going through the process of setting up the decentralized file storage but I am not too sure how I should go about handling the meta data engine. I am debating if I should just use the cloudflare egress or maybe switch over to another type of meta storage. \n- 11:15am - I am thinking that it might make sense to create a global redis instance that we could call from any point? There are a couple different ways that I wanted to approach this concept, one being a bit similar to how I was planning to handle the Rust+Redis build / layout. Okay so we could have two instances in this structure, one being the meta and the other just being a general redis? Hmm, I suppose one would be `meta.kbve.com`, the next being `engine.kbve.com` and finally `redis.kbve.com`? This would be the first move before building out the decentralized hybrid swarm. \n- 11:27am - Pushed through some minor updates to the general KBVE repo, now I am currently looking over the appwrite upgrade to v1.4.2, including setting up the clustering! There should not be any major issues that I should face as of right now, but this is going to be an interesting experiment, none the less. Let me see if I could update the existing documentation as well. \n- 11:38am - I believe the first engine that I want to deploy would be the meta, which can then be used by a meta-engine for the storage of the general key-values that will be then used by the scaling redis clusters. The meta engine will be like an index that will reference different data blobs spread across all our containers, virtual machines and emulators! The best option for this engine would be to use the Amazon Elastic Redis instance, yet I am not too sure if we would need to do that as of right now, since one of the goals would be to keep the cost bases as low as possible?  \n\n## Quote\n\n> Adversity causes some men to break, others to break records.\n> — <cite>William Arthur Ward</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"September : 08","description":"Daily Log for September, 08 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1691183336426-10e4a01f19ec?fit=crop&q=85&w=1400&h=700","date":"2023-09-08T00:00:00.000Z"}}}