{"entry":{"id":"09-13.md","slug":"09-13","body":"\n## Notes\n### 2023\n- 8:34am - The mornings need to be a bit better, I might have to start sleeping early again or maybe finding a way to still program without having to be in-front of a screen. It could be the blue light or just the brain drain that comes with the amount of thinking that would be involved. There is something to be said about how fast things are moving in the machine learning eco-system, its moving too fast and my brain is unable to keep up with all the movement. \n- 9:45am - Good to see the markets performing well, I am going to have to push my calls further up for the week and hopefully my TSLA puts expire in the money! While I am not in debt, the current cash reserves are dropping really low, I am currently sitting with only $29,500, which has been the lowest cash balance in years and I am not too sure how I feel about it. I have made extreme budget cuts but there might be not be other options other than moving forward with increasing income. I will have to pivot a certain part of my calendar with more blocks towards generating an increased amount of profits.\n- 2:05pm - Within the scope of the Appwrite's storage, I am thinking that JuicyFS would be the best move to stress test this weekend! I will have to see how it performs with I/O and net speeds between the datacenter and my local Charles. \n- 7:53pm - The whole unity engine drama seems to be getting worse! I am extremely sadden with how they are handling all of this and honestly their engine is not even worth this type of drama! The idea that they will get better revenue in the short term is not worth their long term growth because unreal is already leaps ahead in terms of rendering, ugh, even typing this out makes me sad. \n\n## Quote\n\n> Give whatever you are doing and whoever you are with the gift of your attention.\n> — <cite>Jim Rohn</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"September : 13","description":"Daily Log for September, 13 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1691427954002-688e16d6cfc3?fit=crop&q=85&w=1400&h=700","date":"2023-09-13T00:00:00.000Z"}}}