{"entry":{"id":"09-29.md","slug":"09-29","body":"\n## Notes\n### 2023\n- 5:53am - Freaky Friday! Today this going to be a heavy hitter type of day, I want to bang out a ton of my backlogs and maybe try to create about 50-60 more issue tickets, bringing my total far past the 100 mark. \n- 6:37am - The first object that I want to place into the YoRHa UI will be the `Drill` item object, located [here](https://i.imgur.com/ddKIcQu.png) and it will serve as the `tool` to repair the ship, robots and will have an energy requirement. I am not too sure how I will go about handling it all, but I am thinking of just placing the object onto the map and then seeing where I can go from there. The other task would be making sure that the player can register and login? All three of these missions will help me towards the backend migration. I am thinking of creating just one function for the game and then assigning paths for the different actions? It would be a bit rough to just make a function for EACH event, as that might be a bit too much isolation and a bit reparative. So placing the tool , then shifting towards a bit of the backend for the game, that will be the main focus for the day! We also have the autoGPT to look into, but that should be later on the day.\n- 4:40pm - There are a couple interesting things going on with the AutoGPT hackathon but I shall see how I feel about it later through out the day.\n- 1:01am - It seems that the best course of action will be to delete the existing AutoGPT repo and then make a new one for the event. The older one that I had some issues and was flooding my grafana with useless logs, skyrocketing the size of my logs from a couple hundred megabytes to almost several gigs. The errors were just a bit too much for my cup of tea.\n\n## Quote\n\n> Happiness is a perfume you cannot pour on others without getting a few drops on yourself.\n> — <cite>Ralph Waldo Emerson</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"September : 29","description":"Daily Log for September, 29 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1695068546359-1ce69078361a?fit=crop&q=85&w=1400&h=700","date":"2023-09-29T00:00:00.000Z"}}}