{"entry":{"id":"2023-05-07.md","slug":"2023-05-07","body":"\n## Notes\n\n- 9:00am - I was thinking it might be interesting to gamify some of the boring morning tasks? Granted this was a shower thought but it would be interesting to develop an AI-based mentor / digital character that would reward for completing certain tasks on time? This could be combined with different pre-built personality language models, so you could have your pet digital monster become aggressive and berate you for not doing pushups? I am just writing my thoughts, hoping that I do not forget them later down the line. The idea is not have a companion that drains your mental health, but rather let you customize it based on your own personal motivational factor(s). I might not find a devil daemon calling me a fat slob for skipping 10 pushups haha but I would not want to impose that onto a younger child, if it were a gamified application.\n- 10:30am - Traveling to the local temple for the last time before I head back to the states, I actually enjoy coming here in the morning because some of the stray dogs come in and its cute to watch them engage with the locals, including them getting treats for being awesome. \n- 12:30pm - Sync the notes. It looks like the pass tool is currently broken, so I am going to try and figure out what I can do to fix it again. I believe the issue might be the way that I am handling the javascript within AstroJS, I will go through some guess and checks and see if I could resolve it that way. It works in `dev` mode but after the SSG, the `generate()` function seems to be missing or broken, so lets see what the issue could be.\n- Error @ 12:30pm: \n  ```javascript\n  (index):166 Uncaught ReferenceError: generate is not defined\n    at HTMLButtonElement.onclick \n```\n- Going to try and push the pipe through `alpha` and then test case it via the Netlify build.\n\n## Quote\n\n> Minds, like bodies, will often fall into a pimpled, ill-conditioned state from mere excess of comfort.\n> — <cite>Charles Dickens</cite>\n\n---\n\n## Tasks\n\n- [ ] Upgrade AppWrite to 1.3.4","collection":"journal","data":{"title":"Daily Sunday : 2023-05-07","description":"Daily Log for 2023-05-07","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680798790227-57f763866b5e?fit=crop&q=85&w=1400&h=700","date":"2023-05-07T00:00:00.000Z"}}}