[{"id":"04-17.md","slug":"04-17","body":"\n## Notes\n\n- I am running into weird issues with Astro 2.3.0, going to delay the upgrade until I can resolve them.\n\n- Started to make a Windows 11 template for the RSPS Project,  but damn it seems to be a pain to get it all optimized and secure.\n\n- Should we keep raw daily notes? Or would it be too much information? Hmmm.\n\n- While I am in India, I just finished setting up my NR accounts, it feels interesting being a dual citizen. The idea that I can be on the other side of the world and live a completely different life style.\n\n- It was a bumper to see Starship flight get scrubbed.\n\n- Damn really had to put quotes on the title to avoid the YAML error.\n\nThe error is here:\n\n```ini\n7:18:30 PM: [astro:content-imports] can not read a block mapping entry; a multiline key may not be an implicit key\n7:18:30 PM: file: /opt/build/repo/src/content/_bin/_daily.md?astroContent=true:4:4\n7:18:30 PM:  error   can not read a block mapping entry; a multiline key may not be an implicit key\n7:18:30 PM:   File:\n7:18:30 PM:     /opt/build/repo/src/content/_bin/_daily.md?astroContent=true:4:4\n7:18:30 PM:   Code:\n7:18:30 PM:     3 | title: {{date:YYYY-MM-DD}}-Daily\n7:18:30 PM:     > 4 | date: {{date:YYYY-MM-DD}}\n7:18:30 PM:         |    ^\n7:18:30 PM:       5 | category: Daily\n7:18:30 PM:       6 | client: Self\n```\n\nI had to wrap the title inside quotes to help with the mapping. >.>\n\n## Quote\n\n> You were not born a winner, and you were not born a loser. You are what you make yourself be.\n> — <cite>Lou Holtz</cite>\n\n\n---\n\n## Tasks\n\n- [x] Fixed Obsidian\n- [x] Added MDX again into Obsidian\n- [x] Need to add a template system for the daily notes.","collection":"journal","data":{"title":"Daily Monday : 2023-04-17","description":"Daily Log for 2023-04-17","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681066471130-5e02ee1e0026?crop=entropy&cs=srgb&fm=jpg&ixid=MnwzNjM5Nzd8MHwxfHJhbmRvbXx8fHx8fHx8fDE2ODE3NDg2ODY&ixlib=rb-4.0.3&q=85","date":"2023-04-17T00:00:00.000Z"}},{"id":"04-18.md","slug":"04-18","body":"\n## Notes\n\n- Went to the hospital for my yearly check up and it was an interesting system. So I pay around 1000R and get a \"full body\" checkup, from almost every major medical branch. It was a bit time consuming, about less than 2 hours in total but it was definitely better than having to schedule a bunch of different doctors. Furthermore, since they all work in the same hospital, they could give secondary reviews and be able to cross-pin among different areas of a concern. I will try to make a quick reference about this for anyone that might want to do medical tourism within Gujarat, India.\n\n- After the hopsital trip, I did a casual photo shoot at Sonia Studio and it was magical. First time experiencing the depth that a photographer goes to get the best shot of a person, besides just the angles, lights and timing. Will I ever want to do modeling again in the future? Nah. Was it fun? Yup and for many other reasons as well.\n\n- Now its about 1pm and I decided to meet up with a local and chill at his work. He basically runs a safety & maintainece company for a buddy of his\n\n## Quote\n\n> Love does not consist of gazing at each other, but in looking together in the same direction.\n> — <cite>Antoine de Saint-Exupéry</cite>\n\n---\n\n## Tasks\n\n- [X] Finish yearly medical check.\n- [X] Check prices on electric tuk tuk / rickshaws / ricksha.\n- [x] Scope out local tailor for pants.\n- [x] Ant Spray for the house in India.","collection":"journal","data":{"title":"Daily Tuesday : 2023-04-18","description":"Daily Log for 2023-04-18","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1679597454485-d1d04f88b78a?fit=crop&q=85&w=1400&h=700","date":"2023-04-18T00:00:00.000Z"}},{"id":"04-19.md","slug":"04-19","body":"\n## Notes\n\n- Visiting the inner city this morning and it was wild! The food smells amazing but the crowd is mind numbing and the traffic is insane, damn I almost got hit by a tuk tuk / rickshaw at least 3 times. \n- Currently trying to fix the issues with SendGrid and Ezoic. It seems that Ezoic's DNS is replacing the SendGrid CNAME by dropping it. When trying to place the CNAME inside of the Ezoic DNS panel, it seems to say that it can not proxy it. I rasied a community ticket on their forum, hopefully they can get it resolved but if they can not then we might use a 3rd party domain. \n- Upgrading Coolify to v3.12.31. Before upgrading, I am going to execute an AWX backup stack. This is another test case for a full scale backup, including the SQL database but excluding snapshots.\n- Integration of Portainer and Coolify still has some issues, including volume and network management. I will rise an issue after doing more R&D between both applications.\n- Starting the AppWrite Register for Astro.\n\n## Quote\n\n> Many men go fishing all of their lives without knowing that it is not fish they are after.\n> — <cite>Henry David Thoreau</cite>\n\n---\n\n## Tasks\n\n- [x] Upgrade Coolify to v3.12.31.\n- [x] R&D for automated RAW image conversion.\n- [x] Rollback Astro upgrade because of errors.\n- [x] Pay off any additional CC debt(s) for the month.\n- [x] Leverage 100 shares of $SPY again for the week.\n- [x] AppWrite -> Register -> https://github.com/KBVE/kbve.com/issues/122\n- [x] Scope out local tailor for pants.\n- [x] Ant Spray for the house in India.","collection":"journal","data":{"title":"Daily Wednesday : 2023-04-19","description":"Daily Log for 2023-04-19","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1663838352752-0f77210c04d5?fit=crop&q=85&w=1400&h=700","date":"2023-04-19T00:00:00.000Z"}},{"id":"04-20.md","slug":"04-20","body":"\n## Notes\n\n- I spent most of the day running around the main city, looking for new clothes, belts and shawls!\n- Starship ... well update. it went rip.\n\n## Quote\n\n> To be what we are, and to become what we are capable of becoming, is the only end of life.\n> — <cite>Robert Louis Stevenson</cite>\n\n---\n\n## Tasks\n\n- [x] Rocketship Watch Party","collection":"journal","data":{"title":"Daily Thursday : 2023-04-20","description":"Daily Log for 2023-04-20","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681111957389-ea67d854d70f?fit=crop&q=85&w=1400&h=700","date":"2023-04-20T00:00:00.000Z"}},{"id":"04-21.md","slug":"04-21","body":"\n## Notes\n\n- I spent most of the day eating and relaxing.\n- The next phase will be setting up AppWrite register, login and profile.\n\n## Quote\n\n> The most certain sign of wisdom is cheerfulness.\n> — <cite>Michel de Montaigne</cite>\n\n---\n\n## Tasks\n\n- [x] No major tasks left.","collection":"journal","data":{"title":"Daily Friday : 2023-04-21","description":"Daily Log for 2023-04-21","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1679939099475-384a2ff77e90?fit=crop&q=85&w=1400&h=700","date":"2023-04-21T00:00:00.000Z"}},{"id":"04-22.md","slug":"04-22","body":"\n## Notes\n\n- Finished getting my PAN number in India and all my accounts are open! Time to plan and start to generate `Rupees`. I can generate about 5 Lakhs or 500,000 rupees tax free each year, so I guess that will be the current goal. Furthermore, UPI seems to come to US / International numbers at the end of this month. \n- Currently looking over the Astro repo on AppWrite, which is located here, `https://github.com/appwrite/demos-for-astro/` and the specific file of interest is in their lib folder, `appwrite.ts`.\n- I went ahead and added their AppWrite.ts file into the KBVE repo and going through it. The concept seems pretty straight forward and we have not ran into any major issues so far.\n- Following up on this story from @Fudster, [Colorado Accepts Crypto for State Taxes](https://abcnews.go.com/ABCNews/colorado-state-accept-cryptocurrency-payment-taxes/story?id=83066842) It is nice to see the organic growth of crypto from the gov. entity side. Accroding to their website, they accept crypto payments through `PayPal Cryptocurrencies Hub` and the official guidelines can be seen on their [payment portal](https://www.colorado.gov/revenueonline/_/#1).\n- Back on the AppWrite integration, I believe their might be CORS issues between the API/AP (https://ap.kbve.com/) and the main website, https://kbve.com/. The first move would be to get the user management resolved, including the\n\n## Quote\n\n> Constant kindness can accomplish much. As the sun makes ice melt, kindness causes misunderstanding, mistrust, and hostility to evaporate.\n> — <cite>Albert Schweitzer</cite>\n\n---\n\n## Tasks\n\n- [x] Schedule cleaning services.","collection":"journal","data":{"title":"Daily Saturday : 2023-04-22","description":"Daily Log for 2023-04-22","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1679537241464-f4f2cba721dc?fit=crop&q=85&w=1400&h=700","date":"2023-04-22T00:00:00.000Z"}},{"id":"04-23.md","slug":"04-23","body":"\n## Notes\n\n- Damn! 17 days left in India for this vacation! I definitely will miss this place, the internal clock is already ticking. The next time I am around India, I might make plans to visit the Himalayas and also expand around Asia, definitely need to put Japan on the list.\n- I am currently debating how I should setup the AppWrite Register. I am thinking I will do the classical way first and then maybe create a widget, `react-appwrite-widget` , to handle the Register? Hmm. \n- I decided to stick with a simple register / login / account flow for now but will expand it later on once I find more usage for it. The three are under tasks.\n- Expanding the user profile via its own astro component, I have to be careful not to hit the API too much while building out the basics. We could store the basic user information into another nanoStore, so we do not have to pull from the API all the time. The issue is related to https://github.com/KBVE/kbve.com/issues/183\n\n## Quote\n\n> Do you know what my favorite part of the game is? The opportunity to play.\n> — <cite>Mike Singletary (basketball)</cite>\n\n---\n\n## Tasks\n\n- [x] Connect AppWrite with /account/register/\n- [x] Connect AppWrite with /account/index aka Profile?\n- [x] Connect AppWrite with /account/login/\n- [x] Prepare weekly 0days.","collection":"journal","data":{"title":"Daily Sunday : 2023-04-23","description":"Daily Log for 2023-04-23","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680675805063-3aa8b3607b0a?fit=crop&q=85&w=1400&h=700","date":"2023-04-23T00:00:00.000Z"}},{"id":"04-24.md","slug":"04-24","body":"\n## Notes\n\n- The day has been crazy! The heat is a killer. :O\n- The main focus would be to get the GraphQL to work across the whole KBVE main page and then extend it to various applications.\n- It seems that we will have to use a mixture of GraphQL and REST, as there seems to be some areas where REST is faster.\n\n## Quote\n\n> Just be patient. Let the game come to you. Don't rush. Be quick, but don't hurry.\n> — <cite>Earl Monroe</cite>\n\n---\n\n## Tasks\n\n- [x] Register, Login and Profile via GraphQL.\n- [x] Register WISE account.","collection":"journal","data":{"title":"Daily Monday : 2023-04-24","description":"Daily Log for 2023-04-24","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681933859581-55594c9a09a0?fit=crop&q=85&w=1400&h=700","date":"2023-04-24T00:00:00.000Z"}},{"id":"04-25.md","slug":"04-25","body":"\n## Notes\n\n- Astro <=> React <=> GraphQL/REST <=> Appwrite <=> Strapi\n- The chain of command might seem a bit too much but I think it should help wrap up most of our front-end journies. Afterwards, I will clean up and prepare for May dev logs.\n\n## Quote\n\n> Winners never quit and quitters never win.\n> — <cite>Vince Lombardi</cite>\n\n---\n\n## Tasks\n\n- [ ] Double check all credit cards.","collection":"journal","data":{"title":"Daily Tuesday : 2023-04-25","description":"Daily Log for 2023-04-25","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1679938792137-ead97be96ea6?fit=crop&q=85&w=1400&h=700","date":"2023-04-25T00:00:00.000Z"}},{"id":"04-26.md","slug":"04-26","body":"\n## Notes\n\n- Learning GraphQL. Okay we got the basics of the AppWrite integration, i.e login, signup and user profile but there is no subscribe yet.\n- The newest restaurant that I enjoyed was `Indian Spices 4U, Manjalpur, Vadodara` , and it was damn amazing. They have an all you can eat / lunch special, so starve yourself for the whole day and then binge out on amazing egg dishes. I recommend asking for boiled eggs on the side, with no salt/pepper and then dropping them crushed into the curry gravy.\n\n## Quote\n\n> It is one of the blessings of old friends that you can afford to be stupid with them.\n> — <cite>Ralph Waldo Emerson</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"Daily Wednesday : 2023-04-26","description":"Daily Log for 2023-04-26","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1674035036549-67b8ad6d0be3?fit=crop&q=85&w=1400&h=700","date":"2023-04-26T00:00:00.000Z"}},{"id":"04-27.md","slug":"04-27","body":"\n## Notes\n\n- Spent most of the day cleaning up and preparing my luggage for the trip back to India.\n- Parker sent me this open source lawn mower, [Open Mower](https://github.com/ClemensElflein/OpenMower) and it really seems like a great idea down the line to look into. Imagine launching a landscaping business where you use robots to manage all the lawn care for your clients!\n- AppWrite integration test casing is probably where I will spend most of my time today on. I ran into some issues with the GraphQL and sending out verification emails. It seems that Ezoic keeps removing our SendGrid CNAME / information, thus putting our emails back into the spam folder.\n\n## Quote\n\n> The world makes way for the man who knows where he is going.\n> — <cite>Ralph Waldo Emerson</cite>\n\n---\n\n## Tasks\n\n- [ ] AppWrite Svelte","collection":"journal","data":{"title":"Daily Thursday : 2023-04-27","description":"Daily Log for 2023-04-27","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682256781111-9d20db9ca5a0?fit=crop&q=85&w=1400&h=700","date":"2023-04-27T00:00:00.000Z"}},{"id":"04-28.md","slug":"04-28","body":"\n## Notes\n\n- Currently integrating Svelte into AstroJS, but running into some development problems with Astro v2.3.1? or v2.3.2?. Vite is throwing some errors here and there within the rollUp, so I am currently in the process of debugging that. Afterwards, I aim to integrate AppWrite into Svelte, so that it can execute a bit faster than the current React setup. While React is able to get the basics done, there is a bit of a delay between each action, around ~600ms because it has to communicate with the API (from AppWrites end), I am trying to see if I can resolve that , or at least make it less noticeable via the UX/UI end. One of the aspects I was thinking of was to store the user information locally after login, to have an almost instant load WHILE only having `update` and `delete` require a connection/load.\n- `Something went wrong installing the \"sharp\" module` - Sometimes I hate the sharp module with a passion, I am going to wipe the local installation clean and start fresh from the dev branch. \n- Next issue was that Search via the MDX page was throwing some weird errors and honestly I am a bit too tired to figure out why it was giving a pain. I am assuming its because I forgot something to render or messed up the JSX / react syntax, but to make it easier, I decided to migrate it out of the MDX concept and make it its own .astro page. While I wanted to make it all uniformed via MDX template, certain areas might not be worth the time. Furthermore, I disabled the bing / you searches because they were giving errors of CORS on certain browsers.\n- I would say this is a bit of a major update to the website, as I begin to migrate + add more into the framework.\n- Under search, I expanded the options and included `reddit.com` and `stackoverflow.com`. The results are not within the iframe but instead they open in new a window/tab; I will gladly add more options/parameters down the line, including expanding into images and GPT/LLVM.\n- 8:37pm - It seems that my idea of having a general namespace and then running a custom templating system out of that is just a bit too much. I will go with a more simple widget style and just import the widgets directly, instead of having them all over the place. I just get confused and there just so many options and ways to do things... that it just too much. Sometimes I over-engineer everything and it might not be the best, BUT it was dope to have emoji-style templating, even if it was a complete waste of time, rip 50+ hours I spent lmfao. I did learn and gain so much knowledge from the experience, so it might not have been a total waste.\n- 8:40pm - Just saw a dude on a bike get nailed by a tuktuk / rickshaw, he was okay but was driving in the wrong direction and going a bit too fast. Duck the traffic here in India is insane.\n\n## Quote\n\n> No man is free who is not master of himself.\n> — <cite>Epictetus</cite>\n\n---\n\n## Tasks\n\n- [x] Svelte Integration - Including dev / build / vite rollup test case.\n- [x] Migrating Search to its own independent page.\n- [x] Updating Astro to latest v2.3.1/v2.3.2.","collection":"journal","data":{"title":"Daily Friday : 2023-04-28","description":"Daily Log for 2023-04-28","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680466350960-f06d9950e69f?fit=crop&q=85&w=1400&h=700","date":"2023-04-28T00:00:00.000Z"}},{"id":"04-29.md","slug":"04-29","body":"\n## Notes\n\n- Pre Launch has been pushed back over and over! While it sucks to have to delay the MVP, it is great to see the backend and frontend stack evolve and become more mature. I think Astro still has a long way to go but so far I have been impressed and amazed with how fast it has grown. \n\n## Quote\n\n> Sometimes being a friend means mastering the art of timing. There is a time for silence. A time to let go and allow people to hurl themselves into their own destiny. And a time to prepare to pick up the pieces when it's all over.\n> — <cite>Octavia E. Butler</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"Daily Saturday : 2023-04-29","description":"Daily Log for 2023-04-29","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680817706923-68ea17be3345?fit=crop&q=85&w=1400&h=700","date":"2023-04-29T00:00:00.000Z"}},{"id":"04-30.md","slug":"04-30","body":"\n## Notes\n\n- The material, NiTiTol, from this [Veritasium video](https://www.youtube.com/watch?v=vSNtifE0Z2Q), through me into a deep research/wiki-loop on material engineering this whole morning.\n- Also another cool video, The Galactic Menagerie, Star Wars by Wes Anderson Trailer https://www.youtube.com/watch?v=d-8DT5Q8kzI\n- Going to update the Strapi API to the latest version, v4.10.1 because it seems to address the yarn build bug that was giving me issues the last time that I tried to upgrade/update. \n- 6:00pm - I started the process of updating the API, it was pretty straight forward with upgrading the packages and then deploying the version v4.10.1. There were no major database migrations but I backed up everything to be safe. \n- Next mission is to upgrade AppWrite from 1.3.1 to 1.3.3 , which I am doing right now. There are some issues that I need to address between the AW and Strapi API, including the unique keys/index. The update seem to work out well and the database migration did not throw any issues.\n- 7:00pm - Refactoring the KBVE.com codebase by removing old / dead astro files that are no longer required. This is to help improve performance and to clean up the workspace, so that others can easily navigate through and not have any issues. There are instances where certain files get referenced twice, once via the Namespace and then again directly via import. \n- I have to restructure the name convention and I believe that keeping it extremely basic will be better in the long term. Thus I think it would make sense to use the term, `Widget` , and place all the `Element` / `Action` into that area and the migrate them out again in v2 of KBVE.com. Mapping out each widget seems to be a waste of time right now, as I keep rotating different file names and file types without keeping something straight forward.\n- Another interesting error that I am having is with the email(s) going into spam. The issue is actually not on my end but rather that our advertisement platform, \"Ezoic\", throwing errors ecause it is unable to proxy the CNAME from our email provider, \"SendGrid\". It has been almost two weeks and currently still waiting for them to resolve it. :/\n- Had to grab a quick meal earlier in the day, so I decided to try the local KFC at the InOrbit mall! While I am not a big fan of having fast food, the tandoori chicken was delicious and not too expensive! The legs were not too greasy, chicken was cooked almost near perfectly and the blend of spices were on point! These guys are making a huge mistake not bringing this dish into the US because it would become an instant hit across North America.\n- 11:00pm - I am about to start winding down, going to grab some mineral water and a salt paan before getting ready to sleep. \n## Quote\n\n> Happiness mainly comes from our own attitude, rather than from external factors.\n> — <cite>Dalai Lama</cite>\n\n---\n\n## Tasks\n\n- [x] Strapi Update.\n- [x] Pay Credit Cards.\n- [x] AppWrite Update.","collection":"journal","data":{"title":"Daily Sunday : 2023-04-30","description":"Daily Log for 2023-04-30","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681238339140-7fa1654fb6ad?fit=crop&q=85&w=1400&h=700","date":"2023-04-30T00:00:00.000Z"}},{"id":"05-01.md","slug":"05-01","body":"\n## Notes\n\n- 8:00am - My new alarm for the morning is this [Electric Speed](https://www.youtube.com/watch?v=1PV55o9AsTg) song and it has to be the best song to get you up out of bed. Do not use it for anything but as your alarm, so you can Pavlov yourself out of bed.\n- 10:00am - Got ready, did a couple set of squats and pushups, now about to venture into the main city and do some site seeing.\n- 12:15pm - After a couple hours of walking around and getting into the flow, now I am about to sit at my favorite cafe , jam out and do some programming sessions.\n- 1:00pm - Restructuring the media section of the knowledge garden and will start to include content that I found to be interesting and entertaining. One of my future plans was to summarize podcasts into short 3-5min DOC LOFI songs but that is definitely later down the line as the AI-generated music scene is still a bit rough.\n- 3:00pm - Took a quick break and toured around an university art show but they would not allow photographs, which makes sense because the artwork could is copyrighted. \n- 4:00pm - Came back to the cafe and now looking through the flutter docs and need to sync the `kbve.com` repo with my online IDE. I am looking over flutter again and I might need to take a break from Astro and update the Flutter application to the latest before launching. Let me begin the quest of fluttering my brain cells into a cyclone of psychological fallacies. \n\n## Quote\n\n> To follow, without halt, one aim: There is the secret of success.\n> — <cite>Anna Pavlova</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"Daily Monday : 2023-05-01","description":"Daily Log for 2023-05-01","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680118534066-849f48822ece?fit=crop&q=85&w=1400&h=700","date":"2023-05-01T00:00:00.000Z"}},{"id":"05-02.md","slug":"05-02","body":"\n## Notes\n\n- I spent a sold amount of time getting the hang of Flutter again. The amount of times I have seen the word widget has driven me insane.\n- Morning ? Mid : Spent some time walking around a small park and finally had a `frankie` and it was okay, not as hot as I had hoped but the flavor made up for it. \n- Mid Day: Ezoic just fixed the email server issue! w00t! I can finally send emails without them going into spam xD!\n- 5:15pm - I am chilling at the local library and trying to integrate a client-side database inside of Flutter. Part of me enjoys the abusive relationship because it feels great to resolve the bugs but at the same time, it slowly feeds into my Sith viewpoint of Google. They really have an amazing framework but damn, they really know how to drop the ball in certain areas. If it were not for some of the cool people that I have met through my fluffy flutter adventures, I would have definitely just jump ship and head over to react native or just skip straight to Unity.\n\n## Quote\n\n> You give before you get.\n> — <cite>Napoleon Hill</cite>\n\n---\n\n## Tasks\n\n- [ ] Get AstroJS <-> Flutter SAPI Working.","collection":"journal","data":{"title":"Daily Tuesday : 2023-05-02","description":"Daily Log for 2023-05-02","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1679848148238-5ebc18399015?fit=crop&q=85&w=1400&h=700","date":"2023-05-02T00:00:00.000Z"}},{"id":"05-03.md","slug":"05-03","body":"\n## Notes\n\n- 10:00am - Going to prepare myself to visit a local temple, which includes climbing a kilometer flight of stairs. The workout and stress from all that walking is definitely going to be terrible! However the views are going to be amazing and can not wait to be in the sky.\n- 5:00pm - That was an intense trip, my feet are sore as hell. I am going to take a short rest and fix up some of the codebase, eat a small meal and get some rest.\n\n## Quote\n\n> In three words I can sum up everything I've learned about life: it goes on.\n> — <cite>Robert Frost</cite>\n\n---\n\n## Tasks\n\n- [x] Climb to the top of a temple.","collection":"journal","data":{"title":"Daily Wednesday : 2023-05-03","description":"Daily Log for 2023-05-03","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681135395961-48705bf9bebf?fit=crop&q=85&w=1400&h=700","date":"2023-05-03T00:00:00.000Z"}},{"id":"05-04.md","slug":"05-04","body":"\n## Notes\n\n- 12:00pm - Review the notes on the iOS / Flutter. I will have to transfer them over to this knowledge bank later this week. There are two core pillars that I have to make sure that I get right for deploying future iOS applications. The first will be getting flutter to actually build and sign the application, so for that I will run `flutter doctor -v` and see what it requires for the iOS / iPhone build. It seems that I will need xCode and CocaPods, it was pretty straight forward for getting the xCode, as I was able to grab it from app store.\n- The CocaPods aka a Swift package manager that Flutter uses for iOS development was easy to install, just had to run `sudo gem install cocoapods` and then agree to the xCode license.\n- The next pillar is the development and pipeline, currently I am able to build the iOS application within the development eco-system. However I will have to figure out how to setup the CI/CD for the application, ideally making it so that once the commit is made on the `main` branch, it will automatically deploy the application to the Apple App store.\n- 3:00pm - Going to prepare to pack up my luggage! It seems that my grandparents have some older suitcases, so I am thinking of letting them have mine, while I go grab some new ones. I am going to travel to either the `CromAs` or `InOrbit` mall and pickup two new suitcases. The total cost was around 15000 Rupees and they were pretty solid hardshell cases, they look and feel like a CSGO crate haha.\n- \n\n## Quote\n\n> If you want your life to be more rewarding, you have to change the way you think.\n> — <cite>Oprah Winfrey</cite>\n\n---\n\n## Tasks\n\n- [x] Install and update xCode / CocoPods.","collection":"journal","data":{"title":"Daily Thursday : 2023-05-04","description":"Daily Log for 2023-05-04","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1661948746536-14df44b0ad43?fit=crop&q=85&w=1400&h=700","date":"2023-05-04T00:00:00.000Z"}},{"id":"05-05.md","slug":"05-05","body":"\n## Notes\n\n- 9:30am - Woke up a bit earlier today, got ready and headed out to the border part of Vadodara, known as Gotri. I asked a fellow friend to bring me some Goldbond lotion from America, which my grandparents love and its a bit hard to find here in India. \n- 11:15am - Looking over the `kbve.com` repo and noticed that there needs to be some updates that I have to do for the day. \n- 11:25am - Quick break from travel / coding and going to relax, watch some game trailers and sip some coffee. The Unreal 5 game engine demos have been crazy! I can not wait to test out Unreal when I get back into the states, I will not be diving too deep into that engine, as I am still learning how to master Unity. \n- 12:30pm - I am looking over the CI/CD for the Android deployment. Its been a couple years since I messed around with this, I remember doing it before in Jenkins and again in Gitlab, so I am sure it will be even easier with Github / Git Actions. Later down the line, I will look into doing hybrid deployments, including a combination of private and public repos, to avoid any future issues of licensing / conflict of interests. (i.e if I am using a paid Flutter theme and want to include it inside an open source project! We would host the paid theme inside a private repo and let the open source project pull the code during the build / deploy phase.) Here is an interesting article that goes over what I am looking to [setup](https://dev.to/matijanovosel/deploying-flutter-applications-to-google-play-using-github-actions-j8a).\n- For the releasing, I am going to use the actions from this developer, [Subosito Actions](https://github.com/subosito/flutter-action) , and the two specific ones that I am interested in are the `android` and the `ios`. \n- 2:15pm - I really hate the breaking changes in Flutter! Okay to grab the parameters from the path, you have to call `state.pathParameters['pathId'];` with pathId being the variable that you pass through. In our situation we will only be passing one pathId through-out most of the application. The user-information will be stored inside of the HiveDB for now and I will have it make the net request after pulling the information from HiveDB. So in the case of looking up the stock asset, it will check the local instance of the asset and if it does not find it, then it will make a net request for the updated json from the static kbve.com api. I am thinking if there is no internet, then have the application perform the best it can using the local storage data. Side note, the local storage for the mobile applications will be in their default documents folder or downloads folder.\n- 6:00pm - Okay I am going to remove the deep nest and keep everything at max depth of 1, so that I can streamline everything else into a simple and easy flow. So instead of `asset/stock`, it will be just `stock` or `crypto`. This will be with all content and mainly so that I can keep everything type-safe and organized later down the line without having too many constraints and dead code to deal with. There might be some SEO/SEM impact from the link structure change, but I think its safe to do it right now rather than later down the line. \n\n## Quote\n\n> Trust your hunches. They're usually based on facts filed away just below the conscious level.\n> — <cite>Joyce Brothers</cite>\n\n---\n\n## Tasks\n\n- [ ] - Check out 3 new cafes within the day.\n- [x] - Update Astro on KBVE.com repo to the latest version.","collection":"journal","data":{"title":"Daily Friday : 2023-05-05","description":"Daily Log for 2023-05-05","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681237266731-3c5867e1e9ad?fit=crop&q=85&w=1400&h=700","date":"2023-05-05T00:00:00.000Z"}},{"id":"05-06.md","slug":"05-06","body":"\n## Notes\n\n- 9:00am - Going to miss this amazing breakfast place, for under $3 or 200 Rupees, I get nearly a full course meal. It keeps me fed throughout the day but damn them eggs do produce some deadly methane gas xD\n- 9:30am - Restoring the `asset.astro` and the `media.astro` paths to avoid some broken links when navigating through the menu on the main website.\n- 10:30am - Read this great article from [SemiAnalysis No Moat](https://www.semianalysis.com/p/google-we-have-no-moat-and-neither) that goes over the lack of a moat from Google / OpenAI within the eco-system of Ai/mL, yet this can have some issues further down the line, including investment and capital markets, whom bet on companies being able to `secure` a moat. I believe that a hybrid source movement will remain the best course of action as of right now.\n- 11:00am - Currently looking up the works of `Ursula K. Le Guin` and her universe of `Hainish Cycle` because she coined the term `Ansible`. The first piece of her work that I am going to read while taking this rickshaw is `Winter's King`. \n- 3:00pm - Currently on my last interview for a new job that I might start in June! I am excited but I might also decline because the amount of pay is not worth the amount of work that they might demand. We shall see, I usually enjoy working for startups but seeing how they conduct their interviews and testing has been very off-putting. I might also not get the job because I did decline to sign any NDAs until I felt more confident with the company.\n- 9:00pm - Going to start to integrate Rive into the Flutter application! I have had great experience with Lottie but I been finding that they have a bit too limited animations for my taste and I do not feel like integrating React into Flutter at this time. If everything works out as planned, then I will remove Lottie from the `kbve.com` source and replace it with Rive as well.\n\n## Quote\n\n> Kindness in words creates confidence. Kindness in thinking creates profoundness. Kindness in giving creates love.\n> — <cite>Laozi</cite>\n\n---\n\n## Tasks\n\n- [ ] Double check AirIndia tickets.\n- [ ] Dentist checkup.\n- [ ] Tiles for the new bathroom.\n- [ ] Adding Jio sim card for UPI.\n- [ ] Bulk ordering glasses.","collection":"journal","data":{"title":"Daily Saturday : 2023-05-06","description":"Daily Log for 2023-05-06","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680871148780-7774a789a369?fit=crop&q=85&w=1400&h=700","date":"2023-05-06T00:00:00.000Z"}},{"id":"05-07.md","slug":"05-07","body":"\n## Notes\n\n- 9:00am - I was thinking it might be interesting to gamify some of the boring morning tasks? Granted this was a shower thought but it would be interesting to develop an AI-based mentor / digital character that would reward for completing certain tasks on time? This could be combined with different pre-built personality language models, so you could have your pet digital monster become aggressive and berate you for not doing pushups? I am just writing my thoughts, hoping that I do not forget them later down the line. The idea is not have a companion that drains your mental health, but rather let you customize it based on your own personal motivational factor(s). I might not find a devil daemon calling me a fat slob for skipping 10 pushups haha but I would not want to impose that onto a younger child, if it were a gamified application.\n- 10:30am - Traveling to the local temple for the last time before I head back to the states, I actually enjoy coming here in the morning because some of the stray dogs come in and its cute to watch them engage with the locals, including them getting treats for being awesome. \n- 12:30pm - Sync the notes. It looks like the pass tool is currently broken, so I am going to try and figure out what I can do to fix it again. I believe the issue might be the way that I am handling the javascript within AstroJS, I will go through some guess and checks and see if I could resolve it that way. It works in `dev` mode but after the SSG, the `generate()` function seems to be missing or broken, so lets see what the issue could be.\n- Error @ 12:30pm: \n  ```javascript\n  (index):166 Uncaught ReferenceError: generate is not defined\n    at HTMLButtonElement.onclick \n```\n- Going to try and push the pipe through `alpha` and then test case it via the Netlify build. Okay, looks like that resolved that issue. I was missing the `is:inline` when calling the 3rd party external scripts, okay going to move back to updating the AppWrite.\n- 1:15pm - Updated AppWrite to 1.3.4, then did a quick database migration! I am wondering if there might be a way to do an update without taking the whole API down but I noticed that it could cause corrupted shards, so I suppose it might be best to keep it the way it is right now. \n- 2:45pm - Getting ready to go shopping around a local mall district. I got over 30kg worth of free space in my luggage, so lets see if I can find anything interesting to buy. Before I head out, I think I will test case some of the local pipelines that I been building, including one that is known as `cook-ai`, which is a small mL model that helps you make amazing recipes! \n- 4:00pm - Looking over all my blueprints that I have written for KBVE and starting to parse through them and organize them into something a bit more meaningful and structured. \n- 5:45pm - Great background video, [The Micro Education Business Model - How To Monetize Your Knowledge](https://www.youtube.com/watch?v=XgAMayF-JZY)! This would be great material for a lofi mix :D\n- 11:15pm - Doing some speed tests, I noticed some issues here and there but I think I could hit 90s+ across each metric if I address some of the problems from PageSpeed. \n- Last Test was https://pagespeed.web.dev/analysis/https-kbve-com/j7ervvivzh?form_factor=desktop \n\t  - 99 Desktop , 84 Accessibility, 75 Best Practices and 100 SEO.\n\t  - 85 Mobile, 77 Acc, 75 Best Practices and 100 SEO.\n- Let us see if these recent updates will boost us up to 90s+\n## Quote\n\n> Minds, like bodies, will often fall into a pimpled, ill-conditioned state from mere excess of comfort.\n> — <cite>Charles Dickens</cite>\n\n---\n\n## Tasks\n\n- [x] Upgrade AppWrite to 1.3.4\n- [x] Fix the Tools -> Pass\n- [ ] Review all the blueprints and being to shift them into private documents.\n- [ ] Review MDX plugins and write a plan for steps to resolve known and future issues.","collection":"journal","data":{"title":"Daily Sunday : 2023-05-07","description":"Daily Log for 2023-05-07","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1680798790227-57f763866b5e?fit=crop&q=85&w=1400&h=700","date":"2023-05-07T00:00:00.000Z"}},{"id":"05-08.md","slug":"05-08","body":"\n## Notes\n\n- 9:30am - Dropping by the local Lenskart and asking my uncle to make two quick pair of aviator glasses for @sean and @ziggy9263. I have given this shop close to 20 pairs so far, I am definitely their customer of the month, may even become their customer of the year.  \n- 11:00am - Final visit the dentist to get some quick teeth cleaning! Through all of this, it seems that our dear friend, Fudster put me onto a quick quest. It is always interesting to be drugged up by a dentist and then open a bunch of unix terminals to setup a virtual machine. I enjoyed being in the dentist chair, half baked, typing away linux commands. If this was in the US, I am pretty sure the dentist would have violated several ethical boundaries for what I was doing haha.\n- 12:30pm - Going to look over the current backend setup and see what needs to be updated. Overall the system looks healthy with no massive errors in any area. The main operating systems are still up to date, I looked over the unattended update logs and everything seems fine on that end. \n- 5:00pm - Looking at tiles for remodeling the home and bathroom in India! It was interesting to see that electronic upgrades are more costly than doing general service to the house. I suppose it makes sense because labor costs in India are extremely cheap, as there is a large pool of workers. Yet the tech market within India is extremely inflated and it comes mainly from the excessive tariffs that are imposed on imports. \n- 7:00pm - I think its time for me start researching into VCs/Venture again, just going to do some core / basic data gathering. I realized that I could add up to a million contacts onto the HubSpot CRM, so I am going to go through my older emails and reach out to some VC funds and build up an initial cold list. There are two main issues within the VC field that I am seeing, the first is the insane amount of capital going into machine learning / A.I-based startups and the second issue is that the rising interest rates is squeezing and limiting the general funds that they are willing to risk / invest. In addition to the rising rates, the recent bank collapses have also decreased the amount of risk that funds are willing to take.\n- 7:30pm - Going to start a developer environment with a new hybrid cloud setup. I was looking at some of the recent changes with vCluster and I think its right about the best time to do a couple edge test cases from scratch. There will be two phases for this, the first will be doing everything manually and keeping track of the scripts, configurations, ect.. and the second phase will be to use Ansible-Tower to automate the deployment of the whole setup. I do not expect any of this to be successful but I am down to see where I hit failure, last time it was with the storage.\n\n## Quote\n\n> Courage is what it takes to stand up and speak; courage is also what it takes to sit down and listen.\n> — <cite>Winston Churchill</cite>\n\n---\n\n## Tasks\n\n- [x] Finalize materials for the house.\n- [x] Migrate rupees from bank balance to fix deposits.","collection":"journal","data":{"title":"Daily Monday : 2023-05-08","description":"Daily Log for 2023-05-08","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1664202526602-08cbc96c4b3c?fit=crop&q=85&w=1400&h=700","date":"2023-05-08T00:00:00.000Z"}},{"id":"05-09.md","slug":"05-09","body":"\n## Notes\n\n- 10:00am - Just had 500mL of cold brewed coffee that was aged in whisky and rum barrels! It might have been a bit too much caffeine to start the day, I feel like my heart trying to escape my body. Besides the overload of energy, the taste was amazing, the hints of whisky and rum notes are noticeable through initial taste and near the end. It blends so well that the exiting bitterness that comes with normal brews is almost gone! Overall it was nice to meet the creators of the brew, however they are still in the experimental stage and have not yet done any social / digital work. I was kindly given some concentrated powder to take back to the US with me, think of it like instant coffee? They said they would reach out if they need any digital work done, but I know that my costs might be too high for them.   \n- 12:30pm - Weighing out both bags, it looks like I have about 20kg of free space, thus I am going to go H.A.M and buy a bunch of shawls and then maybe use the remaining left over weight to grab rare spices that are a bit tough to find in the US.\n- 2:30pm - Went shopping to grab shawls and ended up going to the shop owner's home, we had tea and he talked about his past and how his kids have all moved to the UK/Canada. How I went from buying items at his shop to some how going to his home was probably the weirdest adventure lmao. I needed around 15 shawls and the type that he had in his store were the lighter material, which makes sense because its the warmer season here in India. He told me his winter stock is currently in storage at his home, so we decided it would better if I head over there and look through his inventory. When I got to his home, I was amazed with the amount of stock that he had, the dude could run his own department store from his house! His wife and her family have been hand making some of the styles but lately its been hard for them to stay afloat because of the market has been flooded with cheaper and machine made scarves. I ended up buying a couple hundred dollars worth from him, he was super excited because I basically gave him a couple weeks worth of business in less than two hours. When I am back in the states, I will try to take some cool pictures with them!\n- 5:00pm - Going to take a break from the heat and relax at a new local cafe, man there are a ton of them here, almost every street has a new cafe popping up with their own twists to coffee and tea. This makes sense because the population density is high and there are no major companies that control the sector, i.e think more mom & pop cafe shops and less Starbucks / DD.\n- 6:00pm - Researching on ways to improve the page load of KBVE.com and looking at why some aspects of the website seem to score so low. I might have to remove some of the bulk images that are being loading from UnSplash and remove some of the extra javascript code that we are not using. \n- 6:30pm - Okay it looks like our spell book seems to be causing a painful first page load. I am thinking that might be worth removing the splash component and then seeing how the site performs. The splash is cool but it might not be worth it in the long term, as it might be annoying and a bit of a waste to then scroll down. Speaking of which, I do need to start thinking about how I will handle the content that should be displayed on the front page. We could also remove some of the wait listing and shrink the footer to be more compressed and clean. Overall the changes could easily decrease the total size of KBVE by 10%, across the board.\n\n## Quote\n\n> It does not matter how slowly you go as long as you do not stop.\n> — <cite>Confucius</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"Daily Tuesday : 2023-05-09","description":"Daily Log for 2023-05-09","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682684112265-e2aa4de8ddc8?fit=crop&q=85&w=1400&h=700","date":"2023-05-09T00:00:00.000Z"}},{"id":"05-10.md","slug":"05-10","body":"\n## Notes\n\n- 10:00am - SSS - *Shiitake, Shower and shave* and out the door! My last official day in India and its giving me the feels. I am going to miss this place for the time being, the society, the flow and the memories. I suppose I will not miss the random cow dung, monkeys throwing dung and the historic slums but the light and darkness create a vibrant eco-system that I can only define as karma. \n- 12:00pm - Going through the general updates for the website, I can not seem to get a basic or static result from the pagespeed tests, they keep throwing me into a random loop of scores. Sometimes I am hitting high 90s and then several sessions later, I am hitting low 60s? I can not tell if its Google or Ezoic (which is displaying Google ads?) or Cloudflare or something that I messed up within my UI/UX. The best course of action might be to just disable everything and then slowly add back content that helps with the flow. Okay lets remove the splash and the general advertisement above the fold! Maybe that might help with the flow of the website and the content. \n- 1:00pm - I removed the splash page, the floating buttons and added aria-labels to the footer buttons. I am going to go through the code base for the main page again and see if I can remove anything else that I will not need for the time being. I will have to update the Oracle component as well and have all the images load at an extremely lazy method, as they are taking a bunch of resources and data up that we do not need to offer. I suppose we could just remove all of the background images for the specific listing and place more gradient style backgrounds with slow loading images upon the hover? We could also swap the idea of a light/dark mode with a slim and heavy mode? Where the website loads with a simple bases and then if they press the heavy, it then takes them to the app. The concept we are going for might be to keep the astro layout as simple and fast as possible! With the visual aesthetics and heavy performance inside of the flutter application. \n- 1:30pm - Upgrading Astro to 2.4.4, Appwrite's Pink library to 0.0.6 RC-12. and the Astro sitemap to 1.3.1. While I am able to upgrade the components and the general website, the cache for the website does not seem to update. I will have to create a new action within Github to clear the Ezoic cache. I could have the cache get cleared via n8n or through AppWrite but I feel like having it done via Github actions would make the most sense. The idea being that we want to put the least amount of stress on our own private systems and offload as much and as many tasks to 3rd party tools and/or applications. The trade off is worth it in the long term, as we expand our collection of websites, we can make sure that the scaling will not hold back our system.\n- 2:00pm - I am trying the cache system again from Ezoic and it seems to be a bit more annoying than I remember. Furthermore, I am having a bit of a tough time clearing the cache, so I will have to look further into how they are handling it. Upon doing some more deep diving, it looks like there might be a conflict with Cloudflare's cache settings and those by Ezoic. We could have a situation where there is a double cache going on, which might make it a bit more painful for the website to be a bit more `live`, as updates might take upwards of 48 hours to dispatch. One solution would be to have some of the more active pages be limited in the cache to just under one hour? Maybe even disable all cache for news and the front page? If we put back up the chat and forum, we could also look into disabling that? These are some thoughts I will go over while I walk around the city before departing. The good news is that there are no issues within flutter, which makes sense because its just a monolithic javascript file aka dart.js that loads everything.  \n- 2:30pm - A great read on how [Unsplash](https://unsplash.com/blog/the-service-powering-unsplashs-beautiful-imagery/) handles their backend stack! I love how they organized themselves into a small but productive team, something that I think a lot of startups should take note of. You do not need a massive team to get the job done, just a strong and core collective with simple mission and structure. Granted the initial look at their infrastructure map might seem a bit perplexing but its really simple at the heart. You have an extremely large data set of images and then make it fast enough for the whole world through caching and optimization. I like their take on the newer technological stacks and honestly sometimes it just might not be worth the energy at the time. Why switch your whole database from Postgres to some random new database to only save 10% of speed while breaking all your tools!? It would make more sense to focus the time on growing your business and then going back to re-tool down the line or outsourcing it to battle-proven operations.\n- Ah! Got a new amazing... high, ugh low?... score of 58 on PageSpeed! I guess it might be time to ask the Ezoic team what the fish is going on.\n- 6:00pm - We were able to figure it out! It was a Google advertisement issue that caused multiple issues then stack on top of each other. Actually it was worse but we wont throw them under the bus, because they will never care and honestly its just a shitty and sand thing overall. \n\n## Quote\n\n> Silence is the sleep that nourishes wisdom.\n> — <cite>Francis Bacon</cite>\n\n---\n\n## Tasks\n\n- [ ] Get onto a plane.\n- [ ] Tom Hanking around the Terminal.","collection":"journal","data":{"title":"Daily Wednesday : 2023-05-10","description":"Daily Log for 2023-05-10","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682553064442-272b63b5a541?fit=crop&q=85&w=1400&h=700","date":"2023-05-10T00:00:00.000Z"}},{"id":"05-15.md","slug":"05-15","body":"\n## Notes\n\n- 10:00am - Ah! I was assigned to a put call over the weekend and did not realize that I was forced to purchase SPY for $415.00 a share. There might have been in a mistake in the automated hedgefund or a bug because of the timezone change since I came back from India. This means that I will have to go back and go through the codebase to see where I made the mistake. I believe that I might have hardcoded the timezone change, rather than making it a function. I suppose one of the solutions would be to grab the program's IP address, figure out the location from that information and then convert the said location to the right timezone. In addition, have a default config variable for the timezone where the application is running, incase it is under a VPN. \n- 12:00pm - Sent most of the morning doing basic chores and fixing up the MDX files. I think we also spent a couple hours playing a bit too much league but the binge of One Piece totally made up for everything. Luffy is da King!\n- 2:00pm - One of the issues that I been having was figuring out how to handle the UX/UI for the MDX entry files. \n- 4:00pm - Finally got the Obsidian package to work on Windows again. It seems that I have not opened the application in such a long time that the whole vault crashes during the cache period. The solution to the problem was to create a secondary vault, next close the broken cache* vault, then delete the broken cache* vault and finally create a new vault from the location of the broken cache*. I am not too sure if this is a common bug to address, but if it happens again then I guess I will have to make a tutorial about it.\n- 5:00pm - Going through the `Manga` notes right now and there are some issues that I already see on rendering them within Flutter and Astro. Going forward I might have to combine the md and mdx files, however it feels so backwards to do so.\n\n## Quote\n\n> Once we accept our limits, we go beyond them.\n> — <cite>Albert Einstein</cite>\n\n---\n\n## Tasks\n\n- [x] Sync Obsidian on Windows with the Github Vault.\n- [x] Improve the UX/UI on the MDX files that are being rendered by Astro.","collection":"journal","data":{"title":"Daily Monday : 2023-05-15","description":"Daily Log for 2023-05-15","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681511854055-edcb84a3e21d?fit=crop&q=85&w=1400&h=700","date":"2023-05-15T00:00:00.000Z"}},{"id":"05-16.md","slug":"05-16","body":"\n## Notes\n\n- 9:00am - When I was taking my mom to her doctor's office, I noticed that they were using a full react-based eco-system! The patients would have tablets, where they would sign forms, fill out and double check their information, schedule and more!\n- 12:00pm - Spent some of the time going through the Unity project. I still need to do some updates here and there with some plugins however they might break the game in other areas. I believe test casing or a system to test case the game might have to be on my agenda down the line.\n- 2:00pm - Quick workout session , some minor chores, damn laundry! \n- 3:00pm - One Piece, league and programming session aka Memegramming! I am trying to rotate out of Shaco and into Senna, but getting the build and learning the play style have been some issues that I wanted to resolve. Found out that Luffy pumps his own blood to get stronger but also shortens his own life.\n- 7:35pm - Read this interesting article about the `Boot Girls` aka [NPR Boot Girls](https://www.npr.org/2023/05/16/1176175801/boot-girls-atlanta-private-parking-enforcement) and its an extremely cool concept! Imagine buying a 3D printer and making unique set of keys that can unlock car boots and then selling them?! It reminds me of the blue ocean and its a great start up besides the ethics involved. \n\n## Quote\n\n> Chance is always powerful. Let your hook be always cast; in the pool where you least expect it, there will be a fish.\n> — <cite>Ovid</cite>\n\n---\n\n## Tasks\n\n- [ ] Adding Search back into the KBVE Homepage.","collection":"journal","data":{"title":"Daily Tuesday : 2023-05-16","description":"Daily Log for 2023-05-16","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1664875849504-9a85b393d572?fit=crop&q=85&w=1400&h=700","date":"2023-05-16T00:00:00.000Z"}},{"id":"05-17.md","slug":"05-17","body":"\n## Notes\n\n- 8:00am - Need to get back onto the workout flow here in the states! Damn I have to stop being lazy, maybe for fun, I should make a GPS based alarm clock? The only way to turn off the alarm clock is by going to a specific GPS location. So instead of a snooze button, it would be the GPS location that would turn it off. This was a shower thought but I think it would be an interesting concept to build out.\n- 11:00am - I been holding off too long for my Twitch stream, I think it might be interesting to bring it back up? Granted there will not be any viewers but it would great to record some of the games, specifically the gameplay, and maybe develop software that could parse through the data and grab unique clips? This could be extended out to other areas later down the line as well. Too bad that I am trash at league or the the content would have been great to watch haha.\n- 12:45pm - Traveling to eye doctor and comparing it to the doctors office yesterday, this office is super old school. They keep all their records in files and take a rather long time to process their patients. From what I noticed, they could hire an extra person that would slowly transfer over their records to a hybrid-cloud, one where the data is stored locally and within 3rd party data warehouses. The time it took to get from patient to queue was around 15 to 20 mins, including the double checking of the records, insurance, forms, ect.. this could easily be scaled down to <5 mins. \n- 1:15pm - I should start to create more issue tickets regarding what areas that I need to focus on, this way I am not all over the place. After going through all the issue tickets, I will get back into programming and then head over to the mall. \n- 1:30pm - Oh I had another idea for the GPS based application, I could sync it with a map style, so that I could sync with others that might want to go to the gym or to the park. The other side of this would be to make it easier to automate the sync of activities, like going for a hike or going onto an adventure?!\n- 2:00pm - The search on the main page was broken, going to go ahead and address that really quick. I think the style for the search can be improved later down, but for now, it would make sense to not over complicate things. \n\n## Quote\n\n> The least movement is of importance to all nature. The entire ocean is affected by a pebble.\n> — <cite>Blaise Pascal</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"Daily Wednesday : 2023-05-17","description":"Daily Log for 2023-05-17","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1667912925305-629794bdb691?fit=crop&q=85&w=1400&h=700","date":"2023-05-17T00:00:00.000Z"}},{"id":"05-18.md","slug":"05-18","body":"\n## Notes\n\n- 9:00am - Mornings are still an emotional adrift with an aura of haziness, damn I hate jet lag. However it has been getting better, I might have to sleep earlier than 12am, so I believe that its my brain just saying I am getting too old.  I added a new habit of asking `Bard` how I felt about it and seeing what it tells me!\n  > Bard : **Jet Lag and the Aging Brain**\n  > \n  > I hate jet lag. It makes me feel like I'm in a constant state of fog. I can't seem to focus, I'm always tired, and I'm just generally irritable. I've been dealing with jet lag for a few weeks now, and I'm starting to think that it's not just the time change that's making me feel this way. I think it's also my brain.\n  > \n  > As we age, our brains naturally slow down. This can make it more difficult to focus and concentrate, and it can also make us more susceptible to sleep disturbances. Jet lag can exacerbate these problems, making it even harder to get a good night's sleep and wake up feeling refreshed.\n  > \n  > In addition to the cognitive effects of jet lag, it can also have a negative impact on our mood. When we're sleep-deprived, we're more likely to experience irritability, anxiety, and depression. These symptoms can be even more pronounced in older adults, who are already more likely to experience mood disorders.\n  > \n  > If you're struggling with jet lag, there are a few things you can do to ease the symptoms. First, try to adjust your sleep schedule gradually. This means going to bed and waking up a little bit earlier each day until you're back on your regular schedule. You can also try using light therapy to help regulate your circadian rhythm. Light therapy involves exposing yourself to bright light in the morning and avoiding bright light in the evening.\n  > \n  > If you're still having trouble sleeping, there are a few over-the-counter medications that can help. Melatonin is a hormone that helps regulate sleep, and it's available in most drugstores. You can also try taking a warm bath or shower before bed, as this can help relax your muscles and make it easier to fall asleep.\n  > \n  > If you're experiencing severe jet lag or mood disturbances, it's important to talk to your doctor. They may be able to prescribe medication or recommend other treatment options.\n  > Jet lag is a common problem, but it doesn't have to ruin your vacation or business trip. By following these tips, you can minimize the symptoms and get back to feeling your best as soon as possible.\n- 11:00am - Good to see $SPY go back up towards the $415+ mark, this means I can sell off at least 100 shares that were assigned to me. I been just rolling them daily to collect the premium that comes with those shares. I wonder what bard might have to say about this too?\n  > Bard: -   \"Patience and Risk Management\"\n  > \n  > The stock market had been on a downward trend for months, and I was starting to get worried. I had been assigned 100 shares of $SPY, and I was hoping to sell them off before the price went any lower.\n  > \n  > One day, I checked the stock market and saw that $SPY was starting to go back up. I was relieved, and I decided to sell my shares. I was able to sell them for a profit, and I was glad that I had waited.\n  > \n  > I had been rolling my options contracts daily to collect the premium, and I was happy with the results. I had made a good amount of money, and I was able to reduce my risk.\n  > \n  > I was curious about what Bard would have to say about my situation. I asked him, \"What do you think about my decision to sell my $SPY shares?\"\n  > \n  > Bard said, \"I think you made the right decision. The market was on a downward trend, and you were able to sell your shares for a profit. You also reduced your risk by rolling your options contracts daily.\"\n  > \n  > I was glad to hear Bard's approval. I felt confident that I had made the right decision.\n  > \n  > I continued to trade options, and I was able to make a good amount of money. I was grateful for Bard's advice, and I was glad that I had asked him for his opinion.\n  > \n  > Here are some additional thoughts from Bard:\n  > \n  > \t- it is important to be patient when trading options. The market can be volatile, and it is important to wait for the right opportunity to sell your shares.\n  > \n  > \t-  It is also important to manage your risk. By rolling your options contracts daily, you can reduce your risk and increase your chances of making a profit.\n  > \t\n  > \t  -   Finally, it is important to do your research before you trade options. There is a lot of information available online, and it is important to learn as much as you can before you start trading.\n\n- 12:15pm - Time to start the quest of setting up Ryujinx and Yuzu to see if I can get my hands on a playable version of Zelda: Tears of the Kingdom! I am super excited to see all the dope mods that will be coming out for the game! I will start with Ryujinx first because its on `choco` already and it makes it so much easier to setup and install. I will try and write out a guide, with the help of Bard and Bing? They tend to make things a bit easier, I suppose. Lets ask Bard for help! Yay!\n  I will create the notes as ryujinx.mdx under applications. [KBVE Ryujinx docs](https://kbve.com/application/ryujinx/)\n- 4:30pm - Going to the local mall with the mom duke, hopefully she finds something worth wild to buy. I am going there to see how bad inflation gets and to take a nice walk around. \n- 7:30pm - Holy mushrooms, the mall looks so dead and vacant! Everything is overpriced or really expensive, like the meals are insanely over priced. My normal Starbucks coffee was also way over priced and the amount of calories that I consumed, I understand what it feels like to be an American again. \n- 7:45pm - Time to break down the tasks and see what I should aim to finish up today? I am thinking it might be great to finish up the React-based API project that I was eyeing for a while to wrap up. Oh I got Zelda, Tears of the Kingdom up and running! It looks great on the laptop, but sadly I do not have a mapped out controller to play the game right now.\n## Quote\n\n> When the world is so complicated, the simple gift of friendship is within all of our hands.\n> — <cite>Maria Shriver</cite>\n\n---\n\n## Tasks\n\n- [x] Setup Legend of Zelda: Tears of the Kingdom.","collection":"journal","data":{"title":"Daily Thursday : 2023-05-18","description":"Daily Log for 2023-05-18","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684316524257-83c9bfce0077?fit=crop&q=85&w=1400&h=700","date":"2023-05-18T00:00:00.000Z"}},{"id":"05-19.md","slug":"05-19","body":"\n## Notes\n\n- 9:00am - Woke up to a great day for a non-rebecca Friday! Going to clean up the car and do some generic house work for most of the day.\n- 11:00am - Going to do a deep dive into the `MINA Protocol` and see what the hype is around it. In between the research, I will look further into the CSS for the search on KBVE. \n- 4:00pm - Okay, I will break down the search into two areas with the first being the generic CSS flow and the 2nd being the additional variables that help us switch between `Dark` and `Light` mode through TailWindCSS. We were able to override the default CSS that google provided using the `@important` in our `gsc-control.css` but we were not able to extend it out into the advertisement area of the Google search results because those adverts are rendered through an `iframe`. Furthermore, we were able to use the `var(--color-primary)` and a couple other variables as a replacement for some of the key CSS classes. By using the variables, we can then use the light/dark mode feature to switch the theme without having too much of an issue. The initial route we were going to take was to just find hex colors that would suit both themes, but this ended up being the better result. \n- 7:00pm - Now for the `MINA` aspect, I am still looking through all their source / codebase but I found their ability to keep the blockchain at 22KB to be brilliant but I still did not understand how they were able to do so. I get the concept but the core fundamentals are a bit tricky for me right now, I might need to print it out, hike onto a mountain, puff some snoop and read through it all within the calmness of nature. \n\n## Quote\n\n> Whenever you have eliminated the impossible, whatever remains, however improbable, must be the truth.\n> — <cite>Arthur Conan Doyle</cite>\n\n---\n\n## Tasks\n\n- [x] Fix the CSS for Search","collection":"journal","data":{"title":"Daily Friday : 2023-05-19","description":"Daily Log for 2023-05-19","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683782852452-a97468c83617?fit=crop&q=85&w=1400&h=700","date":"2023-05-19T00:00:00.000Z"}},{"id":"05-20.md","slug":"05-20","body":"\n## Notes\n\n- 8:00am - I am slowly getting back into the flow of the EST time zone! Today was a bit slower day as I had a couple personal issues to handle.\n- 2:00pm - Going to take a break from programming and play some video games, I am thinking of heading back into Ascension and playing my duo-shadow bear tank build! The World of Warcraft private server is really great for just taking a solid break and getting into that fantasy brain rot of smashing buttons and eating elves lmfao!\n- 5:00pm - About to head out to car shop for my father because his SUV is about to reach its end of life. It is a bit weird to look at ICE vehicles after operating a Tesla for a couple years but he needs to move cargo around all day and does not feel comfortable yet with an electric mode of transport. I was really hoping that a 500 mile Tesla cyber truck at $40K would be on the market by 2023, but it seems that might be too far away from reality and his car is definitely going to die off before we get a chance to get him that. Our current strategy is find a mid-size SUV that is pre-owned within the past 2-3 years and has a solid history. The main car in our scope is the Acura RDX from 2020-2021 and decided to test drive one of them today. The car is smooth but the kick is a bit slow for me, I am too spoiled with my adult go-kart to even think about going back to this style of driving. \n- 7:00pm - Time to refractor and start the register widget. I am going to go through the repos and servers, doing some general security updates and backups. It looks like my ansible scripts are doing a great job at keeping a rotating cluster of SQL databases, including storing the backups in multiple locations. However the `MongoDB` area is a bit rough, it looks like the backups might have failed, so I guess I will have to spend some time fixing those up tonight. \n- 9:00pm - Going to read up on the patch notes for the new Astro version.\n- 10:00pm - Updating to Astro v2.5.1 and a couple other packages as well for the main website. It looks like most of the updates will not impact our website and the local build was a success, so I will go ahead and push everything all the way up to main. While I am doing that, going to throw up some quick WoW and maybe a league match in a bit? Hmm.\n\n## Quote\n\n> When you reach the end of your rope, tie a knot in it and hang on.\n> — <cite>Franklin D. Roosevelt</cite>\n\n---\n\n## Tasks\n\n- [ ] None Today! Chill day!","collection":"journal","data":{"title":"Daily Saturday : 2023-05-20","description":"Daily Log for 2023-05-20","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681825486874-c6794c471d6a?fit=crop&q=85&w=1400&h=700","date":"2023-05-20T00:00:00.000Z"}},{"id":"05-21.md","slug":"05-21","body":"\n## Notes\n\n- 1:00pm - I woke up late today :C\n- 1:30pm - After getting my thoughts and mind ready, I hoped onto fixing up the CSS a bit more for the search. I was able to grab the Iframe but have yet to apply the custom CSS into that frame but from my understanding that I will not be able to do it because of security issues, i.e the external server is a different domain (since its on Google.com) and the results are on KBVE.com, which would mean cross origin errors. The only other solution I could think of was to just replace the whole search engine when switching from dark / light mode? We could do that within the Search.jsx file and by checking the localStorage for the current skin settings. This might be the only optimal path or finding a color scheme that would match both the dark and light mode theme. I do like the idea of not having the ads blend too much into the search content, but rather make it known that these X ,Y and Zed results are a form of Advertisement. As for the usage of the engine? We are already hitting around 100-200 pageviews/searches per day as of right now but I am sure as we add more features and concepts, it could grow into something a bit more unique for a certain type of people. One of the extensions within the search that I been looking into was trying to remove the bias weights that google assigns to each user when conducting a search. The goal of that concept was to aim at having similar results across different accounts within the same region. \n- 2:50pm - Need to prepare myself to do some lawn care, so I think it be wise to take a quick break from the general flow of programming and get some generic exercise. I might even wash the cars really quick too, damn I am starting to get those `father` vibes, next thing I know, I will be complaining more about my old age. I low key still want to be a crazy old grandpa, yelling at random people, it is truly my meme spirit animal.\n- 3:00pm - The integration of GPT based search engines would be great but I am bit lost on how I should do it from both the backend and the frontend. I think the best approach would be to slowly add a couple generic GPT engines from 3rd parties as the backend before focusing on our own version. At the same time, we could then look at the UX/UI from the front end?\n\n## Quote\n\n> Let the future tell the truth and evaluate each one according to his work and accomplishments. The present is theirs; the future, for which I have really worked, is mine.\n> — <cite>Nikola Tesla</cite>\n\n---\n\n## Tasks\n\n- [ ] Minor tweaks to the CSS.","collection":"journal","data":{"title":"Daily Sunday : 2023-05-21","description":"Daily Log for 2023-05-21","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1681027104552-a45dc1cbe616?fit=crop&q=85&w=1400&h=700","date":"2023-05-21T00:00:00.000Z"}},{"id":"05-22.md","slug":"05-22","body":"\n## Notes\n\n- 9:00am - Getting ready for the markets to open and going to sell some weekly calls. I am currently looking to get rid of my [$SPY](https://kbve.com/stock/spy) at $415 and a couple hundred TSLA for around $200 this week. The premium for it all was around $1000 that I will collect for this trade, which I do not need right now, so I am going to put them all into $O, which ended up being around 16 shares. Those 16 shares will now make about $4.08? a month in dividends and if I include the cover on the $[O](https://kbve.com/stock/o) shares, then its closer to around $4.25 a month. My goal for this year is to get $O to make around $1000 a month in dividends, afterwards I will try to get $[STAG](https://kbve.com/stock/stag) past $1000 a month in dividends. \n- 11:00am - I am currently rebuilding the [Portainer](https://kbve.com/application/portainer/) eco-system and having all my laptops and desktops connected to its edge system. The goal will then be to deploy web scrappers onto those edge containers as a test case.\n- 12:00pm - I had to rewrite the City Vote scrapper a couple times to get the hang of constructors, specifically those that operate within the scope of A sync inside of JavaScript. I am a bit rough in the Nodejs department, so I think its time to do some practices.\n- 4:00pm - Looks like my $SPY are going to get assigned today for $415 a share, which is fine because I will then write a $415 put and collect another premium tomorrow.\n- 5:00pm - My docker eco-system on Windows has been running issues after a recent update and it seems to be because I also had rancher desktop installed. The rancher desktop had changed my default WSL settings to its own ubuntu instance, which had caused issues when docker was looking for its own instance. The solution was to remove rancher and all instances of WSL, then re-install [docker](https://kbve.com/application/docker) again.\n- 6:00pm - It looks like coolify does not automatically deploy the newest updates, thus I will have to find a way to setup an automated deployment or see if there is a custom plugin out there that could do it for me. \n- 9:00pm - Taking a break, playing some league and watching Barry! The final season of the show is amazing, the plot thickens and overall its been an amazing show. NoNo Hank has been absolutely brilliant!\n\n## Quote\n\n> Think as a wise man but communicate in the language of the people.\n> — <cite>William Butler Yeats</cite>\n\n---\n\n## Tasks\n\n- [x] Updating Portainer Eco-System\n- [x] Capital Refactoring for Q4 2023","collection":"journal","data":{"title":"Daily Monday : 2023-05-22","description":"Daily Log for 2023-05-22","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683450393696-e6f9e8bd785f?fit=crop&q=85&w=1400&h=700","date":"2023-05-23T00:00:00.000Z"}},{"id":"05-23.md","slug":"05-23","body":"\n## Notes\n\n- 6:00am - I got the notification of the $SPY assignment, so besides getting ready for the market, I need to do some quick workouts. I might take a nap because I am tired doe!\n- 9:00am - City vote does need a new website, layout and a general sense of direction. The best move to make would be to get the initial foundation and business plan laid out. The scope of the plan should include the basic cashflow, growth and purpose of the website.\n- 11:00am - Rebuilt my scan setup, with the files being automatically stored into Google Drive. One of the other areas that I was looking into was setting OCR, so that every file that I scan would automatically generate a document with OCR. The problem that I was facing right now was getting it to perform a bit better? It would have some issues with characters, even though they were printed? This means either the OCR software is a bit outdated or maybe I need to create an All in One / AiO type setup. I think after I finish up the Cityvote and have a bit more time on my hands, I will have that be my next project, an open source OCR software that uses multiple libraries and some machine learning to get the based position markdown output from any document and/or image. \n- 3:00pm - I will be looking through, reading and learning how to build async constructors in JavaScript for most of the night. Boring!\n\n## Quote\n\n> There is a wisdom of the head, and a wisdom of the heart.\n> — <cite>Charles Dickens</cite>\n\n---\n\n## Tasks\n\n- [x] Help family member with Medicare.\n- [x] Lawn care.","collection":"journal","data":{"title":"Daily Tuesday : 2023-05-23","description":"Daily Log for 2023-05-23","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684489453381-0547f9137387?fit=crop&q=85&w=1400&h=700","date":"2023-05-23T00:00:00.000Z"}},{"id":"05-24.md","slug":"05-24","body":"\n## Notes\n\n- 9:00am - It's hump day! Time to get cracking at the general vibes of Memegramming. \n- 3:00pm - Time to crack the fingers and get into the full programming flow! I think I will do a quick rush of getting all of the scrapper running and at the same time, do some quick unity too!+\n- 4:45pm - Going through all the unity files and decided that it might not be worth the time to update the packages. This would just break a couple of the core features and concepts within the game, which we do not want to do right now. While it is great to have some of the plugins handle the character model, world building, ect.. the draw back is that their updates have game breaking changes and sometimes it is a pain to fix through them.\n- 7:00pm - I will start to go through and break down two specific file types, the first will be the GlobalValue.cs and the other will be the PlayerStats.cs. My first train of thought would be to see exactly how the player model is currently reacting within the environment and how it is setup within the whole game. I suppose one additional area would be to see how the character reacts with an online API, however I will make sure the game can be played without having the need to use an active internet connection. \n- 9:30pm - Okay besides AppWrite\n## Quote\n\n> Where there is charity and wisdom, there is neither fear nor ignorance.\n> — <cite>Francis of Assisi</cite>\n\n---\n\n## Tasks\n\n- [x] Take out trash\n- [ ] Finish Unity API Login - Not Done, pushing it till next day.","collection":"journal","data":{"title":"Daily Wednesday : 2023-05-24","description":"Daily Log for 2023-05-24","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682271315884-a211194fbef9?fit=crop&q=85&w=1400&h=700","date":"2023-05-24T00:00:00.000Z"}},{"id":"05-25.md","slug":"05-25","body":"\n## Notes\n\n### 2023\n- 8:00am - @h0lybyte I am going to have to sleep again, my brainfog is way too heavy. However the insane jump in stock value for $NVDA was wild! Watching some people turn 10,000% - 20,000% profits from trades has been insane to watch. So many lottery winners but I am sure that the price will crash a bit down once those contracts get exchanged and settle by next week. \n- 9:00am - I was laying down on the bench and thinking about the future of $NVDA. The company will continue to benefit the most from the AI revolution, they basically got to ride the crypto wave and now are getting another jump from the mainstream push of mL\n- 3:30pm - @h0lybyte Fixed up the journal a bit! I am thinking of making it so that there is just one entry per each day. This way when I keep doing the daily journals, after a year, I can always come back and see what I wrote in the past, basically a year ago! This is still a creative way to doing the journal, but I wanted to add my own twist and turns into the mix.\n- 3:45pm - @h0lybyte Another concept that came to my mind was adding a bit of a visual novel abstract layer to each of the entries. So that instead of reading them all as a boring webpage, I could extend it out into its own unique journal. The only logical step afterwards would be to hide prizes, gifts and concepts into the journal entries for the fans/viewers.\n\n\n## Quote\n\n> The more light you allow within you, the brighter the world you live in will be.\n> — <cite>Shakti Gawain</cite>\n\n---\n\n## Tasks\n\n- [ ] Restructure Unity login API.\n- [ ] Rebuild the journal entry format.","collection":"journal","data":{"title":"May : 25","description":"Daily Log for 2023-05-25","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684482570533-b97679dd0705?fit=crop&q=85&w=1400&h=700","date":"2023-05-25T00:00:00.000Z"}},{"id":"05-26.md","slug":"05-26","body":"\n## Notes\n\n- The time stamps are a bit messy for this note because there were a couple failures during the migration to the newer journal system. \n- The Asynchronous loading seems to be working fine within our first test case inside of Unity but it automatically replaces the cut scene window. So I am thinking we need a button within the loader that the user presses again to go to actually enter the level, I am thinking of calling it `Skip` or `Next` which will be disabled initially on load and then enabled once the asynchronous function has loaded the next scene. \n- Besides spending time on the Unity project, I decided to go back into the rs project which I believe I will go ahead and end for the time being. I will return to that aspect once I get a couple concepts clear up from my plate. I believe that I am spreading myself a bit too thin for the current amount of work and backlog.\n\n## Quote\n\n> I have not failed. I've just found 10,000 ways that won't work.\n> — <cite>Thomas Edison</cite>\n\n---\n\n## Tasks\n\n- [x] Test case the asynchronous unity loader with the visual novel cut scenes.","collection":"journal","data":{"title":"May : 26","description":"Daily Log for every May 26!","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684336177286-f215831afc17?fit=crop&q=85&w=1400&h=700","date":"2023-05-26T00:00:00.000Z"}},{"id":"05-27.md","slug":"05-27","body":"\n## Notes\n\n- 9:00am This was a rough Saturday morning as well, I might have to start sleeping a bit earlier because it is definitely getting a bit too late.\n- 10:30am - Finally bought my cooking skill cape on `TwitchKBVE` on OSRS and started to look into certain profit makers for the account that I can do while I am afking it. ;)\n- 3:00pm - The major focus for the day will be getting the CityVote scrapper to be functional under a new docker container that uses the Node-Python as a base.\n- 11:00pm - I am thinking of trying a new main support because of Shaco bans, I tried Senna but she really was not my play style, so I am going to pickup Sej again! She plays a bit different from the rework, I do miss the stack of ages build on her. Back then you could have like 3-4 Rod of Ages stacked and have a ton of AP / HP / Mana over the course of the game.\n\n## Quote\n\n> Make it a rule of life never to regret and never to look back. Regret is an appalling waste of energy; you can't build on it; it's only for wallowing in.\n> — <cite>Katherine Mansfield</cite>\n\n---\n\n## Tasks\n\n- [x] Migrate to a NodeJS/Python development environment.","collection":"journal","data":{"title":"May : 27","description":"Daily Log for every May 27!","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684077140580-cd2cb0987ef2?fit=crop&q=85&w=1400&h=700","date":"2023-05-27T00:00:00.000Z"}},{"id":"05-28.md","slug":"05-28","body":"\n## Notes\n\n- 9:00am - Organizing my personal kanban will be the main goal for the day. I am a bit sad that I wasted so much time not updating and keeping it organizing. I might have to set aside around 15mins a day moving forward to maintain the board or it will fall into a huge mess!\n- 11:00am - I set aside a couple main goals for this week, I am thinking of making sure that I expand the tool library on KBVE, with the goal of having over 100+ tools within the next 3 years. After around 20-30 tools, I will go back and organize the tool page to be a bit more straight forward, including categories for developers, webmasters, gamers and memers.\n- 1:00pm - Expanded the Coolify and Portainer storage on the main dedicated server because we were running out of space, I am so grateful for the [LVM](https://kbve.com/application/lvm) notes for reminding me how easy it is. The next step might be to create an ansible script that will automatically check the file size for each instance and then make a judgement call to expand the storage. \n- 8:00pm - Listening to Fudster is exactly like injecting cancer cells into my brain. The more you listen, the faster the stages evolve. \n- 9:00pm - Finally got the shiv updated and I have all of the puppeteer running under an asynchronous factory. Now I am going to add JWT authentication and then we should be good to go with building out a basic SaaS-style tool! I will initially make the tool free for users and then add a credit system later down the line. The balance of free tools and paid advance usage will be an art form of human behavior. \n\n## Quote\n\n> Laughter is not at all a bad beginning for a friendship, and it is far the best ending for one.\n> — <cite>Oscar Wilde</cite>\n\n---\n\n## Tasks\n\n- [x] Update the storage on production containers\n- [x] Improve the City Vote Scrapper","collection":"journal","data":{"title":"May : 28","description":"Daily Log for May, 28 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682083682866-a2f99abea268?fit=crop&q=85&w=1400&h=700","date":"2023-05-28T00:00:00.000Z"}},{"id":"05-29.md","slug":"05-29","body":"\n## Notes\n\n- 8:30am Happy Memorial Day! I did not have any major plans for this weekend, I am still in the grindset mode but my sleep schedule is still a mess.\n- 11:00am - Going to look over that Magic shell script that Ziggy found and see if I can add that into KBVE. One of the ideas I was having for it was to integrate a basic GPT into the questions that the user types into the application? So it combines the audio return of yes / no but also gives you a GPT generated response via the typewriter effect. Its a bit tough to describe the product, as I can already see how to build it out within my head. Putting the pieces together will be the focus.\n- 4:00pm - Quick league matches with the homies, doing some chores and then going back to updating some of the applications. \n- 5:00pm - One of the things that has been stopping the puppeteer from scraping is anti-bot protections that websites have. So I am thinking of ways of going around it, not for any other reason but science. Within the industry, this is known as the Cat and Mouse game, where developers on both, red and blue teams, are trying to beat each other. \n- 9:30pm - Going to see if I can get a mock version of the magic conch shell up and running! There are two ways I could do the background image of bikini bottom, I could add it into the background scene or I could load it.\n\n## Quote\n\n> Chaos and Order are not enemies, only opposites.\n> — <cite>Richard Garriott</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"May : 29","description":"Daily Log for May, 29 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683983381840-ff7df07a13b1?fit=crop&q=85&w=1400&h=700","date":"2023-05-29T00:00:00.000Z"}},{"id":"05-30.md","slug":"05-30","body":"\n## Notes\n\n- 9:00am - Going to see if I can sell a couple cover calls and covered puts on a collection of stocks. I am looking to see if I can get into another position on $NVDA , I am looking at $380 puts this week. Furthermore, maybe enter $TSLA at under $190 and $SPY again for under $420.\n- 11:00am - Restructuring the AI cloud functions so that we can encapsulate it all into microservices. We are currently running about 3-5 different instances within KBVE but we could abstract out another 10-20 more 3rd party instances, that are then wrapped inside of the KBVE cloud functions. \n- 3:00pm - Woke up from a nap, going to go install a backup camera onto two of the older cars in my family's fleet. The total install cost for two 7 inch backup cameras comes in at around $400 each, I am trying to see if I can get it down to $700 or maybe work out another deal with the guy.\n- 5:00pm - The shadow magic conch shell is looking better and better! I should throw up a test case for people to see under the official url of [conch](https://kbve.com/tools/conch/). I hope everyone enjoys the absolute memes that this tool will become.\n\n## Quote\n\n> Friendship, like the immortality of the soul, is too good to be believed.\n> — <cite>Ralph Waldo Emerson</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"May : 30","description":"Daily Log for May, 30 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683576221466-57a1b7a4d608?fit=crop&q=85&w=1400&h=700","date":"2023-05-30T00:00:00.000Z"}},{"id":"05-31.md","slug":"05-31","body":"\n## Notes\n\n- 10:00am - Most of this day will be spent working on the Conch react script but also figuring out the basics of the cloud functions. The idea here will be to isolate as much of the script(s) that I am building and move a certain amount of the logic into cloud functions. I do also want to move certain functions into their own worker threads but that will be something that I can work on later down the line.\n- 1:00pm - It looks like we can continue development of RogueJester but at a limited scale, at least until we get a better understanding of the whole project. Starting Monday, we will begin a month of active but slow development. We will be doing about 3 weeks of development currently but hopefully it is enough to get the whole game to at least beta / demo.\n\n## Quote\n\n> Love yourself first and everything else falls into line. You really have to love yourself to get anything done in this world.\n> — <cite>Lucille Ball</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"May : 31","description":"Daily Log for May, 31 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682331592351-bcbcd13f3a45?fit=crop&q=85&w=1400&h=700","date":"2023-05-31T00:00:00.000Z"}},{"id":"06-01.md","slug":"06-01","body":"\n## Notes\n\n- 9:00am - Markets are doing great so far but we shall see how long it lasts, the usual debt ceiling drama always shakes up the movement. I been thinking how many people are generating millions from this uncertain drama, it seems almost manufactured to generate absolute absurd amounts of wealth. These covered calls, puts, err... well the whole wheel system has been doing great in these drama filled markets. Hopefully I can grab another 100 shares of $SPY this month, it would be crazy to see if rally into all time highs while the general economy seems to be in an earthquake fault zone.\n- 3:00pm - A quick league session and some general meme gaming as I restructure my time and brain. \n- 5:00pm - I went food shopping and noticed that certain prices have been dropping and cooling off. Part of me wants to start keeping track of the prices of certain core items, like eggs and fruits? Then maybe start to document their prices as a reference! I am sure there are already apps and services that do this, so I felt like it would just be a personal concept, maybe not really worth too much time to invest into it. \n- 8:00pm - Looking through the whole\n\n## Quote\n\n> We should not judge people by their peak of excellence; but by the distance they have traveled from the point where they started.\n> — <cite>Henry Ward Beecher</cite>\n\n---\n\n## Tasks\n\n- [ ]","collection":"journal","data":{"title":"June : 01","description":"Daily Log for June, 01 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1675434704167-1038d492c86b?fit=crop&q=85&w=1400&h=700","date":"2023-06-01T00:00:00.000Z"}},{"id":"06-02.md","slug":"06-02","body":"\n## Notes\n\n- 6:00am - I was able to get the Conch setup with GPT, now I am looking to setup multiple different models for the user to pick and choose from. I had a bit of a late sleep, if you could even call it that but rather a small nap. I am tired but I am also glad that I got a bit more hands on experience with using Nanostores!\n- 9:00am - Before the market opens, I shall take a bit of time to go through my edge instances and start to update the deployments. There are a couple instances that have not yet been updated since late last year, but they were all docker containers that did not have direct inbound connections, thus I was not too worried about them. Some of the major issues during this process was that there was no auto update and redeploying, even through I had watchtower looking over the instances. The auto-scaling seems to be no longer working but that might have to do with the fact that certain containers were degraded, thus I may have to double check my healthchecks.\n- 11:00am - I am going to rewrite the cloud function of `6479653d74613fd2766e` and create a completely new one! I am going to stick with the default naming culture for now before creating a bit more of an unique structure. Within the timeline, I want to set aside around 10-20 cloud functions that we can execute within KBVE by the end of the year. \n- 3:00pm - Almost had to sell around 400 shares of $TSLA at $215.00 mark, but I extended that mark to next week to $230. Hopefully I can keep the extension going before having to sell shares. Ideally we get a small pull back from the markets but we shall see, that $428 on the SPY is definitely something that I was not expecting. I might try to enter a position in $AAPL next week with a covered put.\n- 7:00pm - I started to build out the automated cloud deployments for my functions but there are still some issues that I need to address. Getting the NET Code and Python deployment out of the way might be the most important thing to tackle this month, so I can start to run those functions within the cloud.\n- 9:00pm - Reviewed and started to take notes on the security within the cloud function deployment, I believe that the final step would be to integration between a payment / credit system and the the deployment of the cloud functions, then we have a full SaaS system!  \n\n## Quote\n\n> The eye sees only what the mind is prepared to comprehend.\n> — <cite>Henri Bergson</cite>\n\n---\n\n## Tasks\n\n- [x] Start learning more about open runtime.\n- [ ] Create automatic open runtime deployment.","collection":"journal","data":{"title":"June : 02","description":"Daily Log for June, 02 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1682965774771-04d7350ae0c2?fit=crop&q=85&w=1400&h=700","date":"2023-06-02T00:00:00.000Z"}},{"id":"06-03.md","slug":"06-03","body":"\n## Notes\n\n- 1:00pm - All those late nights and lack of sleep has caught up, I am in such a daze. The first thing I might have to do is to double check my server's networking. We spent a decent amount of the late night / early morning going over the different types of networking. The idea was to give local IP addresses to LXC containers but had a bit of a tough time doing so. The big risk with Networking is that it is super confusing unless you have experience and get an understanding of what is actually happening. I honestly rather just let existing software handle this for me, as I consider it all black magic.\n- 4:45pm - Going to sync this repo before I begin to update the whole website to a new theme. The new theme is part of the plan of getting all of KBVE up to date across the board, ideally towards something greater! \n- 7:15pm - I am going to go over a couple popular dashboard themes and see if I can replicate some of their unique functions into the current build of `kbve.com`. I noticed that I do not have the best eslint standards and maybe I should look into addressing those issues and see if I can improve my current setup.\n\n## Quote\n\n> Listen to what you know instead of what you fear.\n> — <cite>Richard Bach</cite>\n\n---\n\n## Tasks\n\n- [ ] Update Full Website / Migrate to new Flowbite Theme.","collection":"journal","data":{"title":"June : 03","description":"Daily Log for June, 03 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683177920180-0175523b0271?fit=crop&q=85&w=1400&h=700","date":"2023-06-03T00:00:00.000Z"}},{"id":"06-04.md","slug":"06-04","body":"\n## Notes\n\n- 8:00am - This morning the main focus was updating and cleaning up the Tibi repo so that I could run commands directly from the robot and have it output the answers. A couple of problems during this stage were that the SDK for the robot was a bit outdated and the software on the robot was also a bit too old. I am thinking the better solution would be to see if I could build a web application that took in voice commands, instead of having to build something through java. \n- 11:00am - Looking at getting quick quotes to fix my rear windshield for my Tesla, but it seems that most companies near me refuse to handle window damage for the car. I had to email Tesla to get a quote and they take forever to give me a date! I suppose I am just ranting about a truly first world problem but damn it is a shame how terrible their service can be.\n- 4:00pm - We will be having our first RJ meeting since the the half a year break from active development. There has not been any major plans for the meeting, but rather a general gathering to build out the scope.\n- 9:00pm - Looking at the current storage solutions for the resume. I am thinking that I might try deepMaps from Nanostores but it seems that there are some issues with using the store within react. I will create the variable of `resumeMeta` inside of the resume.ts file and see if we can call it from there. I am going to test case the useStore with the deepMap tomorrow, hopefully I do not run into any crazy issues.\n- 11:00pm? Late - Updating my internal notes for Portainer and removing Rancher from most of my development eco-system. While the application, Rancher, was great at helping me resolve some of my storage issues, it seems that I will not be using them in production, as they seem to be causing conflicts with Portainer and Docker Swarm. Furthermore, even in the Development cycle, it seems to mess up my WSL settings. It seems that the extra headache of getting them to work is not worth the effort.\n\n## Quote\n\n> Never mistake activity for achievement.\n> — <cite>John Wooden</cite>\n\n---\n\n## Tasks\n\n- [X] - Migration of Conch Widget to KBVE.com Repo.\n- [X] - Update CV with Data/Storage. - This will be pushed forward tomorrow.","collection":"journal","data":{"title":"June : 04","description":"Daily Log for June, 04 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684134219110-6d18efc08205?fit=crop&q=85&w=1400&h=700","date":"2023-06-04T00:00:00.000Z"}},{"id":"06-05.md","slug":"06-05","body":"\n## Notes\n\n- 7:00am - Most of the morning was spent looking into how I should handle svelte within this `kbve.com` repo, but I need to open up Unity and dive a bit deeper into that workflow.\nI was able to clear up the invoice for Silver and we should be holding a meeting later today regarding the future of the game.\n\n- 9:00am - Looking over the UI/UX and there are a couple things that we could improve upon, including the mini-map and general flow of information on the screen.\n\n- 12:00pm - RJ Meeting! I will come back to this aspect and update the notes regarding this issue.\n\n- 4:00pm - Going to try the Unity Cloud build and hopefully it will be able to build the application without any major issues.\nI will have to look into how to setup the whole Unity DevOps, but from my basic understanding, it looks pretty straight forward!\nWe might try and have both repos active, one on Github and one of Unity cloud but it might end up becoming a bit too costly to run in the long term.\n\n## Quote\n\n> The person who lives life fully, glowing with life's energy, is the person who lives a successful life.\n> — <cite>Daisaku Ikeda</cite>\n\n---\n\n## Tasks\n\n- [X] - Fix the Git LFS / Github build issue with Unity. UPDATE: This task was just removed from our log.\n- [ ] - Integrate Unity Cloud builder for RougeJester.","collection":"journal","data":{"title":"June : 05","description":"Daily Log for June, 05 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1683321524139-a47fd146ddcb?fit=crop&q=85&w=1400&h=700","date":"2023-06-05T00:00:00.000Z"}},{"id":"06-06.md","slug":"06-06","body":"\n## Notes\n\n- 9:00pm - I messed up the formatting for my notes on 06-06 in the year of 2023. \n- 10:00pm - A general summary for today would be that we were able to finish up / wrap up the cloud build! It looks like Unity was able to build the game, however we still have a couple things that we need to finish up before we could release a working steam demo. One of the core concepts that I was looking into was how we could start the wishlist before throwing together the demo. I should use the word `playbale` lightly, I would say that it does run but most of the crashes are actually just minor bugs and unexpected events, per say.\n- 11:00pm - The new login system has to be setup and we need to get that going within the next couple days, so that players could load into the game without having any major issues. \n\n## Quote\n\n> A single rose can be my garden... a single friend, my world.\n> — <cite>Leo Buscaglia</cite>\n\n---\n\n## Tasks\n\n- [x] Complete a windows build.","collection":"journal","data":{"title":"June : 06","description":"Daily Log for June, 06 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684334035702-c1fd3dafa74f?fit=crop&q=85&w=1400&h=700","date":"2023-06-06T00:00:00.000Z"}},{"id":"06-07.md","slug":"06-07","body":"\n## Notes\n\n- 8:00am - The blueberries are slowly coming out! I currently have a couple plants but I am excited to see them survive through the winter and can not wait to have even more in the future. My plan might be to turn all the edges into blueberry and blackberry bushes but getting the right plant genetics is still a bit out of my scope. Maybe I could ask GPT?\n- 11:00am - Before getting back into the deep end of programming, I need to do my monthly budgeting and balance sheet. By staying with India for almost two months, I was able to save over a couple thousand dollars! Furthermore, the general market value for all my portfolios have increased across the board, it seems some have made intense gains after recovering. I am looking at those $NVDA shares and I think it might be a good time to exit my position for a while. \n- 2:00pm - I am almost ready to pull the trigger on replacing the lottie files on the website with rive! There were a couple of areas that I wanted to read further into but having that cute bear animation for my login form is a definite must! I am not too sure how I feel about going from an open source animation library to something that feels a bit closed off. I might actually just keep both and refine them into a larger library. `Library/Animation/` and then add `Lottie.astro` and `Rive.astro` as the core astro files that I should call.\n- 11:00pm - Currently extending out my grandpa's visa for India. I have not yet uploaded a couple days worth of Journals, I will make sure to update them tonight before I go to sleep. The documents searching has taken already a hour or more, I am a bit stressed out in data fetching, going deep into the depths of my storage.\n- 11:30pm - The information that India requires for extending out the visa is a bit intense, I can not wait for my grandpa to get his OCI finished, because this is definitely a huge waste of time and resources.\n- 11:45pm - I should sync all the notes on my macbook as the battery is slowly dying off, its been on for over 30 hours!\n- 11:55pm - Future information regarding the extension of the VISA in India, you will need the proof of visa, passport-size photo, scan documents of passport, proof of residence and the reason for extending the stay. In this situation, I am extending my grandpa's visa because he recently got some medical work done and is not really suited for travel yet. In my request for the extension, I included the most recent medical report and a couple professional-style letters requesting for an extension, including one from a doctor here in the US and a doctor that is from a popular local hospital in India. I figured if I could reference enough people and have a surplus of documents, they would have a bit harder time declining his extension. The goal would be to do this while getting his OCI resolved, so that we will never have to do this visa meme stuff again. \n\n## Quote\n\n> In all chaos there is a cosmos, in all disorder a secret order.\n> — <cite>Carl Jung</cite>\n\n---\n\n## Tasks\n\n- [x] Finish Balance Sheet for June and July 2023.\n- [x] Finish Grandpa's VISA extension.","collection":"journal","data":{"title":"June : 07","description":"Daily Log for June, 07 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1684770683649-9b2d74fa5554?fit=crop&q=85&w=1400&h=700","date":"2023-06-07T00:00:00.000Z"}},{"id":"06-08.md","slug":"06-08","body":"\n## Notes\n\n- 8:00am - No morning work out today, I feel a bit tired and burnt out from the vast amount of smoke coming from the wild fire. I made the terrible mistake of leaving my windows open with a cross breeze and slowly my room has the faint smell of BBQ! The whole situation with their wildfire seems to be intense, these type of situations remind me to be grateful for what we have and have to understand that we could loose it all within a blink of an eye.\n- 11:00am - Coffee and mocha whey are the best combination. The combination of the protein and the caffeine make holy a proud boy. WAIT! That might have came out wrong....  \n- 12:30pm - Going to clean up my room and re-organize some of the electronics. I think its time to take a break from software development and go deep into some hardware development. I am going to spend a couple hours looking into setting up a dev board and a small raspberry p, with the hopes to setup a fast enough cloud function to invoke it. I could rebuild a small car with camera and then let the cloud functions control the application? The only downside that I could see with the car would be the charging, as I would run into issues with the battery draining too fast. \n- 4:00pm - Hope that TSLA does not stay above $230 a share or I will have to perform some spicy memes magic to get over that bump. The price point per share seems to be a bit too much for my type of budget but we shall see as the markets have been eating up all the good news. War? Inflation? Memes? We shall see tomorrow how far the rally will go!\n- 4:15pm - Going to grab some more coffee, caffeine and switch over to some programming!\n- 5:20pm - Okay we got some feedback on the conch shell, there are a couple things we could do to improve it, including adding a button that is an action to `ask` the shell, incase they can not click the shell itself. \n- 5:39pm - Watching Ziggy play shadow of the colossus gave me some old school flash backs! This was such an amazing game back in the day, definitely up there with Zelda, at least for my childhood memories.\n- 6:00pm - Okay I really need to play some music and the fact that I can not find a solid music bot that plays YouTube videos is getting a bit annoying. So it might be time for me to build one really quick to get the job done!\n- 6:30pm - Updated Appwrite to the latest version 1.3.7 and did a basic migration to make sure that everything is okay.\n- 8:00pm - Time to fork over this music bot written in Go and quickly spin up a YT ready bot for Discord. \n- 11:59pm - EoD - Will push some tasks out for tomorrow, learning the different Go aspects was cool but will just end up using Python.\n## Quote\n\n> Imagination is more important than knowledge. For while knowledge defines all we currently know and understand, imagination points to all we might yet discover and create.\n> — <cite>Albert Einstein</cite>\n\n---\n\n## Tasks\n\n- [x] Assemble Mock IoT.\n- [x] Clean up the electrical components.\n- [x] Music Bot to Play YT videos through Discord.\n- [x] Unity Async Loader. Pushed for tomorrow.\n- [x] React Form Update. Pushed for tomorrow.\n- [x] Unity Login Migration. Pushed for tomorrow.","collection":"journal","data":{"title":"June : 08","description":"Daily Log for June, 08 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1685334467005-ccd47b955315?fit=crop&q=85&w=1400&h=700","date":"2023-06-08T00:00:00.000Z"}},{"id":"06-09.md","slug":"06-09","body":"\n## Notes\n\n### 2023\n\n- 3:30am - Finally got music playing through Discord, so I guess it might almost be time to launch the Discord.sh bot service. I am thinking that it will most likely be a private bot service, offering very specific and hybrid source bots for the servers. I will do a couple more test cases before launching it out in the future, it is also a bit late in the night for me.\n- 3:50am - The Discord Red bot in python seems to be good enough for what we are doing, it is running under python 3.11, which is good for the long term. I will most likely keep the bot as the core and then extend out private cogs that run inside of the bot, which would be one of the reasons that people would use our service, per say.\n- 4:30am - I was reading up on the recent changes on the Reddit API, it is a shame to see one of my favorite websites slowly fade into the depths of destruction. However there might be a silver lining in this, as more alternatives become popular, the resurgence of older forums, unique communities, decentralized projects, ect.. It will be interesting to see how this comes around when I read this passage a couple years into the future.\n- 5:10am - \n\n## Quote\n\n> Your sacred space is where you can find yourself again and again.\n> — <cite>Joseph Campbell</cite>\n\n---\n\n## Tasks\n\n- [ ] Make sure not all $TSLA stock get sold at $230! xD.\n- [ ] Unity Async Loader.\n- [ ] React Form Update.\n- [ ] Unity Login Migration.","collection":"journal","data":{"title":"June : 09","description":"Daily Log for June, 09 of each year.","tags":["daily"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1685052392951-4eb54985d3ae?fit=crop&q=85&w=1400&h=700","date":"2023-06-09T00:00:00.000Z"}},{"id":"asset.mdx","slug":"asset","body":"\n## J5\n\nGoing to split the branches up and then start a dev-asset-automation branch, where the n8n will commit automated commits/pushes.\nThe goal should be that all automation data mining goes through the branches, just to make sure everything is correct and to avoid any possible exploits/mal-intent.\n\n## J4\n\nI am thinking that we should construct abstract Scenes for assets, so that we can reference each aspect of them via modularity / first principle levels. If I wanted to render the assets charts, I should just be able to reference a component for the types of charts and get back what I need, rendered and compressed. We can start with simple charts and then expand them with more style, options and information. Starting with chart0 being the most basic and then we re-do/re-build as we move up from chart1 to chart9, ect...\n\nI guess the question would be how far we would want to expand the charts at the static level and then when should we start to integrate dynamic data endpoints to the charts. I believe that should be handled after we get the backtraced charts out of the way.\n\n## J3\n\n- Stripping out the extra information, such as option contract data, forward PE, RSI, ect...\n- Short hand titles might be a future issue as we scale out from 100 assets to 1000, 10000, 100K\n- International stocks also have additional tags that might cause duplication, I think the best move would be to modify them manually until we can get a better system in place?\n\n## J2\n\n- h0lybyte: I was able to pull 100 assets, format them into json. However, I was running into an issue when turning the json list of assets into MD files.\n- h0lybyte: In the n8n pipeline, the charts / img data gets stripped out.\n\n## J1\n\n- h0lybyte: Open Issue [#88](https://github.com/KBVE/kbve.com/issues/88)\n  - We will expand the amount of stock assets to around 100 and then do some data mining / data parsing for the 100~ assets as a test case. We might also expand a bit of the crypto. I was thinking it might be best to do a couple initially by hand, to see how we can build out & map out the total automation process , which will include fetching / updating.\n  - Basic pipeline would look like this: `n8n -> function_asset -> fx{var: ticker} -> .json -> .md -> gist`\n","collection":"journal","data":{"title":"Asset Dev Log","description":"Dev Log for Asset Page of KBVE!","tags":["asset"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1610993302487-6dbfc0acf4ed?fit=crop&w=1400&h=700&q=75"}},{"id":"visualnovel.mdx","slug":"visualnovel","body":"\n\n## J2\n\nh0lybyte: Okay we got the pipeline operational, even unicorned Github a couple times but it looks like it should be smooth sailing for the time being. I did spend way too much time failing on understanding the github error logs, I should practice carefully reading through the error logs and search them with better abstraction layers.\n\njohn: Added some generic player controls and a generic loading screen, to help us see what version we are currently operating in.\n\n## J1\n\nh0lybyte: Okay so on VC we were talking about the type of Unity version for the engine? I am not too sure what we wanted to do. So I went ahead and looked at the LTS release, found here -> [Unity LTS](https://unity3d.com/unity/qa/lts-releases)\n\nIt seems that the latest Unity version release was November 2022 and it is `Unity 2021.3.14f1`.\n\nGoing to build the repo , which will be public and located [here](https://github.com/kbve/2dunity/)\n\nFor the .gitignore, we did the basic unity template that Github provided, there might have be additional files added later down the line.\n\nGeneric ReadMe was also auto-generated, but we can replace that later down the line.\n\nYaml for the generic WebGL\n\n## Init\n\nThis is the first journal entry for the 2DUnity concept/engine and it is meant to be a base project for Game Jams.\n","collection":"journal","data":{"title":"Visual Novel DevLog","description":"Visual Novel Dev Log","tags":["visual","novel","vn"],"author":"KBVE Team","img":"https://images.unsplash.com/photo-1610993302487-6dbfc0acf4ed?fit=crop&w=1400&h=700&q=75"}}]