[{"title":"J5","body":"J5 Entry","slug":"https://kbve.com/journal/asset/_journal/5","content":"<p>Going to split the branches up and then start a dev-asset-automation branch, where the n8n will commit automated commits/pushes.</p>\n<p>The goal should be that all automation data mining goes through the branches, just to make sure everything is correct and to avoid any possible exploits/mal-intent.</p>"},{"title":"J4","body":"J4 Entry","slug":"https://kbve.com/journal/asset/_journal/4","content":"<h2 id=\"j4\">J4</h2>\n<p>I am thinking that we should construct abstract Scenes for assets, so that we can reference each aspect of them via modularity / first principle levels. If I wanted to render the assets charts, I should just be able to reference a component for the types of charts and get back what I need, rendered and compressed. We can start with simple charts and then expand them with more style, options and information. Starting with chart0 being the most basic and then we re-do/re-build as we move up from chart1 to chart9, ect…</p>\n<p>I guess the question would be how far we would want to expand the charts at the static level and then when should we start to integrate dynamic data endpoints to the charts. I believe that should be handled after we get the backtraced charts out of the way.</p>"},{"title":"J3","body":"Journal Entry 3","slug":"https://kbve.com/journal/asset/_journal/3","content":"<ul>\n<li>Stripping out the extra information, such as option contract data, forward PE, RSI, ect…</li>\n<li>Short hand titles might be a future issue as we scale out from 100 assets to 1000, 10000, 100K</li>\n<li>International stocks also have additional tags that might cause duplication, I think the best move would be to modify them manually until we can get a better system in place?</li>\n</ul>"},{"title":"J2","body":"Journal Entry 2","slug":"https://kbve.com/journal/asset/_journal/2","content":"<h2 id=\"j2\">J2</h2>\n<ul>\n<li>\n<p>h0lybyte: I was able to pull 100 assets, format them into json. However, I was running into an issue when turning the json list of assets into MD files.</p>\n</li>\n<li>\n<p>h0lybyte: In the n8n pipeline, the charts / img data gets stripped out.</p>\n</li>\n</ul>"},{"title":"J1","body":"Journal Entry 1","slug":"https://kbve.com/journal/asset/_journal/1","content":"<h2 id=\"j1\">J1</h2>\n<ul>\n<li>h0lybyte: Open Issue <a href=\"https://github.com/KBVE/kbve.com/issues/88\">#88</a>\n<ul>\n<li>We will expand the amount of stock assets to around 100 and then do some data mining / data parsing for the 100~ assets as a test case. We might also expand a bit of the crypto. I was thinking it might be best to do a couple initially by hand, to see how we can build out &#x26; map out the total automation process , which will include fetching / updating.</li>\n<li>Basic pipeline would look like this: <code>n8n -> function_asset -> fx{var: ticker} -> .json -> .md -> gist</code></li>\n</ul>\n</li>\n</ul>"}]