[{"id":"pass.mdx","slug":"pass","body":"\nimport Details from \"@w/Details.astro\";\nimport Pass from \"@c/Tools/Pass/Pass.astro\";\n\n---\n\n## Information\n\n<Pass />\n\n---\n\n## Notes\n\nThese are the official notes for the `pass` MDX reference document.\n\n### Log\n\n- [ ] Need to migrate `pass` tool outside into its own repo.\n- [ ] After migrating, pull the tool into the flutter application.\n\n#### Journal\n\n- ","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"Pass Generator","category":"Tools","client":"Self","publishDate":"2023-04-12T00:00:00.000Z","img":"https://images.unsplash.com/photo-1582139329536-e7284fece509?fit=crop&w=1400&h=700&q=75","description":"An extremely easy to use password / passphrase generator by KBVE.","tags":["tools","blueteam","security"]}},{"id":"status.mdx","slug":"status","body":"\nimport Details from \"@w/Details.astro\";\n\n## Operational Status\n\nThe official status page for everything related to KBVE Services and Tools.\n\n### Modes\n\nModes have not yet been launched, we are working on that right now.\n\n#### Checkly\n\nThe current operational status of the API via Checkly badge.\n\n![api uptime](https://api.checklyhq.com/v1/badges/checks/206925a6-0f7b-4669-a4fd-b61b3f5b70fc?style=for-the-badge&theme=default&responseTime=true)\n\n--- \n\n## Notes\n\nThese are the official notes for the status of KBVE and its services.\n\n### Log\n\n- [X] Operational API\n- [ ] Load balancer with a hybrid cloud and serverless.\n\n\n#### Journal\n\n<Details data=\"2023-04-11\">\n\nThere still will be a decent amount of stuff that needs to be added into the status page.\n\n</Details>\n","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"KBVE Status Page","status":1,"category":"Tools","client":"Self","publishDate":"2023-01-01T00:00:00.000Z","img":"https://images.unsplash.com/photo-1621905251189-08b45d6a269e?fit=crop&w=1400&h=700&q=75","description":"Official Status Page for all KBVE tools and services.","tags":["webmaster","tools","api","status","website"]}},{"id":"webmaster.mdx","slug":"webmaster","body":"\nimport N from \"@n/N.astro\";\n\n---\n\n## Information\n\nIf you have a website, you probably want to make sure that it is visible and performing well on search engines like Google and Bing.\nBut how do you know if your site is indexed, optimized, and free of errors?\nThat’s where the amazing KBVE webmaster tool comes in.\nOur webmaster tool is a collection of free services offered by search engines that allow you to monitor and maintain your site’s presence and performance.\nThey also help you identify and fix any issues that might affect your site’s ranking or user experience.\n\n---\n\n## Tool\n\nThe Webmaster Tool : Embed will be placed before these notes? We might be re-design the slot system within the MDX to include tools.\n\n---\n\n## Notes\n\nThese are the official notes for the `webmaster` MDX reference document.\nThe current list of services that we will be supporting will be included in this notes page.\n\nButton List:\n\n- Google Webmaster Search , located here -> `https://search.google.com/search-console?utm_source=about-page&resource_id=sc-domain:kbve.com`. \nThe trailing domain `kbve.com` will be swapped out with the domain that the user wants to run the tool on.\n\n- Ahrefs, located here -> `https://app.ahrefs.com/v2-site-explorer/overview?mode=subdomains&target=kbve.com%2F`. \nSame concept, we will just swap out the `kbve.com` with the domain variable when rendering the buttons\n\n- Majestic , located here -> `https://majestic.com/reports/site-explorer?IndexDataSource=F&oq=kbve.com&q=`\n \n\nKBVE Specific:\n\nThere are two smaller modules that we are in the blueprint stage for. \nBoth of the tools are being design to make certain aspects of SEO / SEM a bit more automated. \nMod A will be specific with finding errors within the current main domain / page. \nMod B will focus on generating suggestions to help improve the rank of the page.\n\n\n\n\n### Log\n\n- [x] Migrating to MDX.\n- [ ] Migrating AiO Webmaster tool to public.\n- [ ] Updating the general information for the MDX document.\n- [ ] Adding a couple extra videos.\n\n#### Journal\n\n- 2023-05-07\n\nStarted to write the JSX file for the webmaster tool.\nUnder the blueprint, I will test it out here through AstroJS and then later on migrate it into its own repo.\n`widget-tool-webmaster` ? And then have the tools page just pull the bundled javascript file and run it. \n\n- 2023-04-16\n\nAdded tabs to the webmaster tool. Testing the private script.\n\n- 2023-04-11\n\nAdded the details widget and will start to expand upon the notes, with the goal of launching our first webmaster tool within the end of Q2.\nAlso added a task list under the log, to make it easier.\n\n- 2022-12-10\n\nIt looks like we have better mdx support with AstroJS v2, I think I might try a bring the webmaster tool online via this page.\nDev Notes for launch.\nMajor issue with MDX files on the render and dev side.\nCurrently, it seems that mdx files are causing a decent amount of issues for us within the `Content` System/API.\nI am going to use this as a test case for the mdx problems, hopefully I could find a patchwork solution until the next major release for AstroJS. \nI did reach out to the team but it seems that they are on holiday break but they are aware of the issues and have stated that this is an experimental area.\n","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"WebMaster Tools","category":"Tools","client":"Self","frontpage":true,"publishDate":"2023-01-01T00:00:00.000Z","img":"https://images.unsplash.com/photo-1595844730298-b960ff98fee0?fit=crop&w=1400&h=700&q=75","description":"The Webmaster Tool is an AiO reference tool-belt for any website owner/designer. It will include all the links you need to help bolster your website above the competition!","tags":["webmaster","tools","seo","website"]}}]