[{"id":"conch.mdx","slug":"conch","body":"\nimport Conch from \"@c/Tools/Conch/Conch.astro\";\n\n<Conch />","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"Shadow Conch","category":"Tools","client":"Self","publishDate":"2023-05-30T00:00:00.000Z","img":"/assets/img/bg/bikini_bottom_bg.jpg","description":"We decided to visit the depths of the underground dark realm and have obtained the legendary shadow shell of the magical conch! This is a fan service / paradoy tool that is meant for the memes!","tags":["tools","memes"]}},{"id":"cv.mdx","slug":"cv","body":"\nimport CV from \"@c/Tools/CV/CV.astro\"\n\n<CV />\n\n* * *\n\n## Information\nThe resume builder application / project will be something that can be built really quick and should have a couple amazing functionalities built into it!\n\nWithout going too deep into the scope, I am going to start going through existing online resume builders and see if I can get the general gist of what everyone is looking for. I am thinking that this should not be too complex of a project and we should aim to modularize as much of it as we can.\n\n## Scope\nThe project scope will be split into three areas of focus, data, render and print. The data aspect will focus on the storage and information that the CV/Resume will need, the render will be the output and display of the CV and finally the print would be the finished product, i.e print ready, maybe in png, pdf, ect...\n\n### Data\nThe data for the resume builder will be stored locally through the local storage, we will most likely use nanostores to manage that for us. According to some of the searching that I have done, the base line of data management seems to be a JSONResume schema, which follows this breakdown.\n\n- `meta` - Metadata for the Resume\n\t- `tool` - The current tool that is using the meta data.\n- `basics` - Basic information for the person.\n\t- `name` - The name of the person on the resume\n\t- `label` - Personal label / title of that person, i.e `Web Developer` , `Full Stack Developer`\n\t- `image` - Personal profile of the person, usually a headshot.\n\t- `summary` - A general summary for that person, limited to a couple sentences.\n\t- `website` - The person's official website.\n\t- `email` - The person's email.\n\t- `location` - JSON Object\n\t\t- `city` - City where the person lives.\n\t\t- `countryCode` - Nation that the person is from/lives.\n\t- profiles - Array of user profiles\n\t\t- `0` - First Index of the array\n\t\t\t- `username` - Username of the profile\n\t\t\t- `url` - URL of the profile\n\t\t\t- `network` - Network for the profile, including Github, Twitter, ect..\n- `education` - An array for the education.\n\t- `endDate` - Date for the end\n\t- `startDate` - Date for the start\n\t- `area` - The area that the person studied.\n\t- `studyType` - The type of program, Masters, Degree, Cert. ect..\n\t- `institution` - Location of where the program/education was offered. \n- `references` - An array for the references\n\t- `reference` - A small summary for the reference\n\t- `name` - Name of the person that is in relationship to the reference\n- `skills` - An array for the skills\n\t- `keywords` - An array for the keywords related to this skill\n\t- `level` - Level of the skill, i.e Senior, Jr, \n\t- `name` - Name of the skill, Frontend, Backend, Devops\n- `awards` - An array for the rewards\n\t- `title` - Title of the award\n\t- `date` - The date when the award was given.\n\t- `awarder` - The entity that gave the award.\n\t- `summary` - The summary of the reward\n- `work` - An array of the companies that you have worked for.\n\t- `name` - Name of the company.\n\t- `position` - Position held at the company\n\t- `url` - URL of the company.\n\t- `startDate` - Start date of when you started at the company.\n\t- `endDate` - The end date of when you stopped working at the company.\n\t- `summary` - The summary of the job.\n- interests - Array\n\t- `name` - Name of the interest.\n\t- `keywords` - Array of keywords related to that interest.\n- projects - Array\n\t- `name` - Name of the project.\n\t- `startDate` - Start date of the project.\n\t- `endDate` - End date of the project.\n\t- `summary` - Summary of the project.\n\t- `highlights` - Array of additional information.\n\t- `url` - URL of the project \n\nWe can break down each category further, `meta` seems to be for the meta storage data, including theme choice. language and image references. \n\n### Render\nI am thinking we will do the rendering inside of React and maybe follow the basic markdown concept for the resume. We might not want to let people inject direct HTML to avoid XSS attacks and if any developer really wants to add their own HTML, they could just output the existing resume and then edit it locally near the end.\n\nI suppose within the render concept would be the style library, I am looking at using tailwind because it seems to be straightforward and easy, with almost all the basic css being very user friendly. \n\nThe input of the resume data might be better in markdown? I will come back to this part when I get a bit closer towards the render aspect. In this first run of setting up the resume builder, I am thinking we would use the interweave react library, which safely renders HTML and markdown.\n\n### Print\nThe print will definitely be near the end as it might be a bit rough to resolve. I really do not want to mess around with PDF output right now.\n\n---\n\n## Notes\nThere were some talks about integrating GPT into the resume building aspect, but I am thinking that should be near the end, once the three core scopes above are addressed, then we can go back to the data scope and start to add GPT functionality. In this situation, we already have several cloud functions that are ready to deploy into a production environment, so we could utilize those when we reach this area.\n\n---\n\n## Developer\n\nThe location for the codebase will be under src/module/CV within the KBVE.com repo! We were debating if we wanted to create a whole new repository for the project but it might be a bit too much?\n","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"CV Resume Builder","category":"Tools","client":"Self","publishDate":"2023-04-12T00:00:00.000Z","img":"https://images.unsplash.com/photo-1454165804606-c3d57bc86b40?fit=crop&w=1400&h=700&q=75","description":"An open source and simple resume builder!","tags":["tools","resume","cv"]}},{"id":"pass.mdx","slug":"pass","body":"\nimport Details from \"@w/Details.astro\";\nimport Pass from \"@c/Tools/Pass/Pass.astro\";\n\n---\n\n## Information\n\n<Pass />\n\n---\n\n## Notes\n\nThese are the official notes for the `pass` MDX reference document.\n\n### Log\n\n- [ ] Need to migrate `pass` tool outside into its own repo.\n- [ ] After migrating, pull the tool into the flutter application.\n\n#### Journal\n\n- ","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"Pass Generator","category":"Tools","client":"Self","publishDate":"2023-04-12T00:00:00.000Z","img":"https://images.unsplash.com/photo-1582139329536-e7284fece509?fit=crop&w=1400&h=700&q=75","description":"An extremely easy to use password / passphrase generator by KBVE.","tags":["tools","blueteam","security"]}},{"id":"status.mdx","slug":"status","body":"\nimport Details from \"@w/Details.astro\";\n\n## Operational Status\n\nThe official status page for everything related to KBVE Services and Tools.\n\n### Modes\n\nModes have not yet been launched, we are working on that right now.\n\n#### Checkly\n\nThe current operational status of the API via Checkly badge.\n\n![api uptime](https://api.checklyhq.com/v1/badges/checks/206925a6-0f7b-4669-a4fd-b61b3f5b70fc?style=for-the-badge&theme=default&responseTime=true)\n\n--- \n\n## Notes\n\nThese are the official notes for the status of KBVE and its services.\n\n### Log\n\n- [X] Operational API\n- [ ] Load balancer with a hybrid cloud and serverless.\n\n\n#### Journal\n\n<Details data=\"2023-04-11\">\n\nThere still will be a decent amount of stuff that needs to be added into the status page.\n\n</Details>\n","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"KBVE Status Page","status":1,"category":"Tools","client":"Self","publishDate":"2023-01-01T00:00:00.000Z","img":"https://images.unsplash.com/photo-1621905251189-08b45d6a269e?fit=crop&w=1400&h=700&q=75","description":"Official Status Page for all KBVE tools and services.","tags":["webmaster","tools","api","status","website"]}},{"id":"webmaster.mdx","slug":"webmaster","body":"\nimport N from \"@n/N.astro\";\n\n---\n\n## Information\n\nIf you have a website, you probably want to make sure that it is visible and performing well on search engines like Google and Bing.\nBut how do you know if your site is indexed, optimized, and free of errors?\nThat’s where the amazing KBVE webmaster tool comes in.\nOur webmaster tool is a collection of free services offered by search engines that allow you to monitor and maintain your site’s presence and performance.\nThey also help you identify and fix any issues that might affect your site’s ranking or user experience.\n\n---\n\n## Tool\n\nThe Webmaster Tool : Embed will be placed before these notes? We might be re-design the slot system within the MDX to include tools.\n\n---\n\n## Notes\n\nThese are the official notes for the `webmaster` MDX reference document.\nThe current list of services that we will be supporting will be included in this notes page.\n\nButton List:\n\n- Google Webmaster Search , located here -> `https://search.google.com/search-console?utm_source=about-page&resource_id=sc-domain:kbve.com`. \nThe trailing domain `kbve.com` will be swapped out with the domain that the user wants to run the tool on.\n\n- Ahrefs, located here -> `https://app.ahrefs.com/v2-site-explorer/overview?mode=subdomains&target=kbve.com%2F`. \nSame concept, we will just swap out the `kbve.com` with the domain variable when rendering the buttons\n\n- Majestic , located here -> `https://majestic.com/reports/site-explorer?IndexDataSource=F&oq=kbve.com&q=`\n \n\nKBVE Specific:\n\nThere are two smaller modules that we are in the blueprint stage for. \nBoth of the tools are being design to make certain aspects of SEO / SEM a bit more automated. \nMod A will be specific with finding errors within the current main domain / page. \nMod B will focus on generating suggestions to help improve the rank of the page.\n\n\n\n\n### Log\n\n- [x] Migrating to MDX.\n- [ ] Migrating AiO Webmaster tool to public.\n- [ ] Updating the general information for the MDX document.\n- [ ] Adding a couple extra videos.\n\n#### Journal\n\n- 2023-05-07\n\nStarted to write the JSX file for the webmaster tool.\nUnder the blueprint, I will test it out here through AstroJS and then later on migrate it into its own repo.\n`widget-tool-webmaster` ? And then have the tools page just pull the bundled javascript file and run it. \n\n- 2023-04-16\n\nAdded tabs to the webmaster tool. Testing the private script.\n\n- 2023-04-11\n\nAdded the details widget and will start to expand upon the notes, with the goal of launching our first webmaster tool within the end of Q2.\nAlso added a task list under the log, to make it easier.\n\n- 2022-12-10\n\nIt looks like we have better mdx support with AstroJS v2, I think I might try a bring the webmaster tool online via this page.\nDev Notes for launch.\nMajor issue with MDX files on the render and dev side.\nCurrently, it seems that mdx files are causing a decent amount of issues for us within the `Content` System/API.\nI am going to use this as a test case for the mdx problems, hopefully I could find a patchwork solution until the next major release for AstroJS. \nI did reach out to the team but it seems that they are on holiday break but they are aware of the issues and have stated that this is an experimental area.\n","collection":"tools","data":{"layout":"../../layouts/theme/mdx.astro","title":"WebMaster Tools","category":"Tools","client":"Self","frontpage":true,"publishDate":"2023-01-01T00:00:00.000Z","img":"https://images.unsplash.com/photo-1595844730298-b960ff98fee0?fit=crop&w=1400&h=700&q=75","description":"The Webmaster Tool is an AiO reference tool-belt for any website owner/designer. It will include all the links you need to help bolster your website above the competition!","tags":["webmaster","tools","seo","website"]}}]